[
  {
    "errata_id": "7670",
    "doc-id": "RFC2864",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "RFC 2026",
    "orig_text": "Ini adalah merupakan perniagaan terbesar di dunia melibatkan hak dan pemilikan saya saya, mohd hanafi bin Ngah /JohnSmith yang bernombor Passport United state 125289501 dan 780101-11-7727 /A3874487 di Malaysia, memandangkan keseluruhan perniagaan saya melibatkan 76 buah negara termasuk Estonia, Australia, Belgium, United State, United Kingdom, EU Eropah, Singapore, Greece, Thailand dan banyak lagi negara melibatkan duit dan dana dan saya yang sah dan legal dan memandangkan terlalu banyak penipuan penyelewengan data, penindasan hak hak pemilik sah saya. Mohd hanafi bin Ngah, ini bukan sahaja berlaku di luar negara termasuk United state, EU,Perancis, namun juga penyalah guna, penindasan, pen zalim, perompak ini juga di MALAYSIA,. ini adalah melibatkan harta dan duit in dilibatkan duit, harta, dana MOHD HANAFI NGAH/JOHNSMITH,malah kesemua bank bank akaun saya didormainkan atau dibuat tidak aktif, langsung tidak diberikan hak hak pemilikan saya, penindasan hak serta kezaliman ini terjadi kepada saya dan saya menyeru agar kesemua negara negara memberikan hak mutlak saya sekarang setelah hampir 7 tahun diambil alih kerajaan kerajaan tanpa memberikan duit saya walaupun USD 1 DOLLAR. Ini adalah kezaliman terbesar di dunia. ",
    "correct_text": "Dan diharap andai yang mampu memberikan hak hak saya semula seperti ku kesemua bank bank akaun perniagaan dan milik personal MOHD HANAFI BIN NGAH ATAU JOHNSMITH di 76 buah negara termasuk Malaysia.\r\nMereka konon orang yang hebat dan berpengaruh, namun sebenarnya mempunyai satu sikap atau entiti kotor dan dan. hitam, serta satu sikap tamak dan jijik. Ini bukanlah sikap kita sebagai manusia, kerana kita mengambil hak orang tanpa mempedulikan kebajikan beliau serta memonopoli perniagaan perniagaan beliau. ",
    "notes": "Dengan pemberitahuan ini, agar anda merupakan komuniti terbesar dunia dan perniagaan diharapkan kembalikan kesemua hak hak saya terutama melibatkan duit serta bank bank akaun saya di kesemua 76 buah negara dan menetapkan satu garis  IP ADRESS khusus RFC2026 untuk saya dalam wiki arau ietf  semata mata khs untuk perlindungan saya dan hanya saya sahaja yang boleh mengambil duit dimana mana negara pun kerana ini adalah hak dan pemilikan sah saya.",
    "submit_date": "2023-10-09",
    "submitter_name": "mohd hanafi ngah",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  }
]
