[
  {
    "errata_id": "1893",
    "doc-id": "RFC3031",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "4.1.6",
    "orig_text": "It is important to note that if Ru and Rd are adjacent LSRs in an LSP\r\n   for X1 and X2, forwarding will still be done correctly if Ru assigns\r\n   distinct labels to X1 and X2 while Rd assigns just one label to the\r\n   both of them.  This just means that R1 will map different incoming\r\n   labels to the same outgoing label, an ordinary occurrence.\r\n",
    "correct_text": "It is important to note that if Ru and Rd are adjacent LSRs in an LSP\r\n   for X1 and X2, forwarding will still be done correctly if Ru assigns\r\n   distinct labels to X1 and X2 while Rd assigns just one label to the\r\n   both of them.  This just means that Rd will map different incoming\r\n   labels to the same outgoing label, an ordinary occurrence.\r\n",
    "notes": "R1 should be replaced by Rd since there is no reference for R1.",
    "submit_date": "2009-09-24",
    "submitter_name": "Dande Rajasekhar",
    "verifier_id": "109",
    "verifier_name": "Ross Callon",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "2782",
    "doc-id": "RFC3031",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "2.2",
    "orig_text": " layer 3                   the protocol layer at which IP and its\r\n                           associated routing protocols operate\r\n                           link layer synonymous with layer 2\r\n\r\n",
    "correct_text": " layer 3                   the protocol layer at which IP and its\r\n                           associated routing protocols operate\r\n \r\n link layer                synonymous with layer 2\r\n\r\n",
    "notes": "Wrong text indentation",
    "submit_date": "2011-04-18",
    "submitter_name": "Valeria Elisabetta Mattavelli",
    "verifier_id": "119",
    "verifier_name": "Adrian Farrel",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "2803",
    "doc-id": "RFC3031",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "3.1",
    "orig_text": "Ru will label with packet with label value L",
    "correct_text": "Ru will label the packet with label value L",
    "notes": null,
    "submit_date": "2011-05-08",
    "submitter_name": "maligree",
    "verifier_id": "119",
    "verifier_name": "Adrian Farrel",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "2967",
    "doc-id": "RFC3031",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "3.20",
    "orig_text": "When order control is used, each LSR should adopt, for a given set of\r\nFECs, the granularity used by its next hop for those FECs.",
    "correct_text": "When ordered control is used, each LSR should adopt, for a given set of\r\nFECs, the granularity used by its next hop for those FECs.",
    "notes": null,
    "submit_date": "2011-09-11",
    "submitter_name": "fl",
    "verifier_id": "119",
    "verifier_name": "Adrian Farrel",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "2992",
    "doc-id": "RFC3031",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "3.12",
    "orig_text": "If the FTN maps a particular label to a set of NHLFEs that contains\r\nmore than one element, exactly one element of the set must be chosen\r\nbefore the packet is forwarded. The procedures for choosing an\r\nelement from the set are beyond the scope of this document. Having\r\nthe FTN map a label to a set containing more than one NHLFE may be\r\nuseful if, e.g., it is desired to do load balancing over multiple\r\nequal-cost paths.",
    "correct_text": "If the FTN maps a particular FEC to a set of NHLFEs that contains\r\nmore than one element, exactly one element of the set must be chosen\r\nbefore the packet is forwarded. The procedures for choosing an\r\nelement from the set are beyond the scope of this document. Having\r\nthe FTN map a FEC to a set containing more than one NHLFE may be\r\nuseful if, e.g., it is desired to do load balancing over multiple\r\nequal-cost paths.",
    "notes": "Since FTN is used for packets that arrive unlabeled (as ILM is used for label-NHLFEs), this section should be corrected. It says that \"FTN maps a particular label to a set of NHLFEs\"",
    "submit_date": "2011-10-12",
    "submitter_name": "Bala Venkata",
    "verifier_id": "119",
    "verifier_name": "Adrian Farrel",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "3171",
    "doc-id": "RFC3031",
    "errata_status_code": "Rejected",
    "errata_type_code": "Editorial",
    "section": "3.20",
    "orig_text": "   Given a set of FECs which are \"aggregatable\" into a single FEC, it is\r\n   possible to (a) aggregate them into a single FEC, (b) aggregate them\r\n   into a set of FECs, or (c) not aggregate them at all.  Thus we can\r\n   speak of the \"granularity\" of aggregation, with (a) being the\r\n   \"coarsest granularity\", and (c) being the \"finest granularity\".\r\n",
    "correct_text": "   Given a set of FECs which are \"aggregatable\" into a single FEC, it is\r\n   possible to (a) aggregate them into a single FEC, (b) aggregate them\r\n   into a set of FECs, or (c) not aggregate them at all.  Thus we can\r\n   speak of the \"granularity\" of aggregation, with (a) being the\r\n   \"coarsest granularity\", and (b) being the \"finest granularity\".\r\n",
    "notes": "In the case of (c) the aggregation is not used, so there is no granularity.\n --VERIFIER NOTES-- \nNot aggregating is a degenerate case of aggregation where a one-to-one aggregation mapping is used. Thus, the result is the \"finest granularity\".   ",
    "submit_date": "2012-04-01",
    "submitter_name": "Nikolai Malykh",
    "verifier_id": "119",
    "verifier_name": "Adrian Farrel",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "348",
    "doc-id": "RFC3031",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "2.3",
    "orig_text": "   LDP                       Label Distribution Protocol\r\n   L2                        Layer 2 L3                        Layer 3\r\n   LSP                       Label Switched Path",
    "correct_text": "   LDP                       Label Distribution Protocol\r\n   L2                        Layer 2 \r\n   L3                        Layer 3\r\n   LSP                       Label Switched Path",
    "notes": "there is a missing CR/LF",
    "submit_date": "2005-03-01",
    "submitter_name": "John Kristoff",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "3689",
    "doc-id": "RFC3031",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "5.2.1",
    "orig_text": "      6. <PulledUnconditional, RequestWhenNeeded, N/A, ReleaseOnChange,\r\n         UseImmediate>\r\n\r\n         This is downstream-on-demand label distribution with\r\n         independent control and conservative label retention mode,\r\n         without loop detection.\r\n\r\n      7. <PulledUnconditional, RequestWhenNeeded, N/A, ReleaseOnChange,\r\n         UseIfLoopNotDetected>",
    "correct_text": "      6. <PulledUnconditional, RequestWhenNeeded, RequestRetry,\r\n         ReleaseOnChange, UseImmediate>\r\n\r\n         This is downstream-on-demand label distribution with\r\n         independent control and conservative label retention mode,\r\n         without loop detection.\r\n\r\n      7. <PulledUnconditional, RequestWhenNeeded, RequestRetry,\r\n         ReleaseOnChange, UseIfLoopNotDetected>",
    "notes": "If the \"Request Procedure\" is different than \"Request Never\", then a \"NotAvailable Procedure\" should be specified. In this case, the \"Request Retry\" procedure is the right option for Downstream on Demand.\r\n\r\n[Note that the reported original text has been updated to reflect the actual text in the RFC]\n --VERIFIER NOTES-- \nThis report is rejected for a number of reasons.\r\n\r\nThe first point to note is that the text in section 5.2 is intended to show how the different label distribution schemes will interoperate. It is not intended to cover every wrinkle or be a normative. In that light, the downstream-on-demand operations can be considered to be consistent with a converged IGP in which case the failure to return a LabelMapping would simply not arise or would represent a marginal error that should not be blindly retried.\r\n\r\nConsider for example that the routing tables on the two routers are not in agreement. Can the upstream router know which one is out of synch?\r\n\r\nConsider that the downstream router has run out of labels (maybe not realistic these days, but it was a concern once upon a time). Would retrying the request help?\r\n\r\nThe second point to note is that if this text *is* considered to be normative (i.e., an absolute definition of how downstream-on-demand operates) then any change is also normative. Since the current text is what the authors and WG intended to write, a change to this text would be a change of substance and needs more than just an errata report (for example, an Internet-Draft).",
    "submit_date": "2013-07-28",
    "submitter_name": "Renato Westphal",
    "verifier_id": "119",
    "verifier_name": "Adrian Farrel",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "4331",
    "doc-id": "RFC3031",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "3.22",
    "orig_text": "When a labeled packet is traveling along an LSP, it may occasionally\r\nhappen that it reaches an LSR at which the ILM does not map the\r\npacket's incoming label into an NHLFE, even though the incoming label\r\nis itself valid.  This can happen due to transient conditions, or due\r\nto an error at the LSR which should be the packet's next hop.",
    "correct_text": "When a labeled packet is traveling along an LSP, it may occasionally\r\nhappen that it reaches an LSR at which the ILM does not map the\r\npacket's incoming label into an NHLFE, even though the incoming label\r\nis itself valid and it has a usable L3 next hop.  This can happen due\r\nto transient conditions, or due to an error at the LSR which should\r\nbe the packet's next hop.",
    "notes": "Although the reporter is concerned about ambiguity in terms of why the ILM doesn't map a valid label into an NHLFE, the reason that might happen is really irrelevant.  The original statement clearly specifies that it could be an error or transient condition.\r\n\r\nThe correct action of discarding a packet where the label doesn't map into a n NHLFE applies regardless of whether or not there is a usable L3 next hop.\r\nThis proposed errata would thus add incorrect ambiguity for no purpose.\r\n\r\n================================================\r\n\r\nThere is ambiguity as to the cause of the \"ILM [not mapping] the packet's incoming label into an NHLFE\". It could be read in a number of ways, of which only one can be correct:\r\n\r\n1. The label is valid in terms of syntax (e.g. not Implicit NULL), but no binding has been installed because the label hasn't been advertised. Clearly, 3.18 covers this case already, and is inconsistent with the section title of \"Lack of Outgoing Label\" so this interpretation is unlikely to have been intended.\r\n\r\n2. The label is valid and is expected to be used for forwarding, but an NHLFE entry is missing or not usable because the interface the next hop is reachable over has gone down, or for some other reason isn't usable. This interpretation is ruled out by the statement that \"it is tempting in such cases to strip off the label stack and attempt to forward the packet further via conventional forwarding\", which wouldn't be possible if the interface was down.\r\n\r\n3. A resource allocation error occurred meaning that the ILM binding was allocated, but the NHLFE entry couldn't be allocated. There is no mention of resource issues in this or related sections so again this interpretation seems unlikely.\r\n\r\n4. The label is valid and is expected to be used for forwarding, but the LSR has received no label binding from the LSP's next hop even though it has a usable L3 next hop  (i.e. it lacks an outgoing label). It cannot map to an NHLFE entry because the actions in section 3.10 don't include popping and forwarding as unlabeled. This is therefore the interpretation that best fits.\r\n\r\nTo clarify that interpretation 4 is the one intended, the phrase \"and it has a usable L3 next hop\" is inserted into the text, using the definition of L3 next hop from section 3.17.\n --VERIFIER NOTES-- \n   Although the reporter is concerned about ambiguity in terms of why the ILM doesn't map a valid label into an NHLFE, the reason that might happen is really irrelevant. The original statement clearly specifies that it could be an error or transient condition.\r\n\r\nThe correct action of discarding a packet where the label doesn't map into a n NHLFE applies regardless of whether or not there is a usable L3 next hop.\r\nThis proposed errata would thus add incorrect ambiguity for no purpose.",
    "submit_date": "2015-04-09",
    "submitter_name": "Robert Shearman",
    "verifier_id": "140",
    "verifier_name": "Alia Atlas",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "5002",
    "doc-id": "RFC3031",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "3.8",
    "orig_text": "   Liberal label retention mode allows for quicker adaptation to routing\r\n   changes, but conservative label retention mode though requires an LSR\r\n   to maintain many fewer labels.",
    "correct_text": "   Liberal label retention mode allows for quicker adaptation to routing\r\n   changes, while conservative label retention mode requires an LSR to\r\n   maintain many fewer labels.",
    "notes": "Grammar error in original text, which may make it harder for some to read and understand.\r\nVerifier Notes: (removed the spurious \"though\")",
    "submit_date": "2017-04-21",
    "submitter_name": "Eric Gray",
    "verifier_id": "2",
    "verifier_name": "RFC Editor",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "5643",
    "doc-id": "RFC3031",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "Terminology",
    "orig_text": "<missing>",
    "correct_text": "label edge router - a router capable of accepting an unlabelled packet,\r\nand through MPLS processing, may MPLS encapsulate the packet by adding\r\n a label stack. ",
    "notes": "I am doing some MPLS review.\r\n\r\nThe book I'm using said an LER was an (RFC3031) MPLS edge node. I believed it was any router that could take unlabelled packets and label them, regardless of where the router was within the MPLS domain. (In other words, an MPLS router was not an LER if it would not MPLS label unlabelled packets and forward them.)\r\n\r\nI decided to check RFC3031 for a definition, and discovered there isn't a definition at all for \"label edge router\", or a match on any text that matches \"label edge\" or \"LER\".\r\n\r\nRFC6178 clarifies LER processing of IPv4 packets, and the general description of processing matches my understanding of what an LER is. \r\n\r\nHowever, it doesn't formally define an \"label edge router\" either, and I think an update to RFC3031 should be where \"label edge router\" is formally defined.\n --VERIFIER NOTES-- \nThis is not an error with RFC3031. It is inappropriate to use an Errata Report to add a new term to an RFC.",
    "submit_date": "2019-02-25",
    "submitter_name": "Mark Smith",
    "verifier_id": "149",
    "verifier_name": "Deborah Brungard",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "6240",
    "doc-id": "RFC3031",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": "3.10",
    "orig_text": "3.10. The Next Hop Label Forwarding Entry (NHLFE)\r\n\r\n   The \"Next Hop Label Forwarding Entry\" (NHLFE) is used when forwarding\r\n   a labeled packet.  It contains the following information:\r\n\r\n   1. the packet's next hop\r\n\r\n   2. the operation to perform on the packet's label stack; this is one\r\n      of the following operations:\r\n\r\n      a) replace the label at the top of the label stack with a\r\n         specified new label\r\n\r\n      b) pop the label stack\r\n\r\n      c) replace the label at the top of the label stack with a\r\n         specified new label, and then push one or more specified new\r\n         labels onto the label stack.\r\n\r\n   It may also contain:\r\n\r\n      d) the data link encapsulation to use when transmitting the packet\r\n\r\n      e) the way to encode the label stack when transmitting the packet\r\n\r\n      f) any other information needed in order to properly dispose of\r\n         the packet.\r\n\r\n   Note that at a given LSR, the packet's \"next hop\" might be that LSR\r\n   itself.  In this case, the LSR would need to pop the top level label,\r\n   and then \"forward\" the resulting packet to itself.  It would then\r\n   make another forwarding decision, based on what remains after the\r\n   label stacked is popped.  This may still be a labeled packet, or it\r\n   may be the native IP packet.\r\n\r\n   This implies that in some cases the LSR may need to operate on the IP\r\n   header in order to forward the packet.\r\n\r\n   If the packet's \"next hop\" is the current LSR, then the label stack\r\n   operation MUST be to \"pop the stack\".",
    "correct_text": "3.10. The Next Hop Label Forwarding Entry (NHLFE)\r\n\r\n   The \"Next Hop Label Forwarding Entry\" (NHLFE) is used when forwarding\r\n   a labeled packet on an LSR or an unlabeled packet on an Ingress MPLS router. It \r\n   contains the following information:\r\n\r\n   1. the packet's next hop\r\n\r\n   2. the operation to perform on the packet's label stack; this is one\r\n      of the following operations:\r\n\r\n      a) replace the label at the top of the label stack with a\r\n         specified new label\r\n\r\n      b) pop the label stack\r\n\r\n      c) replace the label at the top of the label stack with a\r\n         specified new label, and then push one or more specified new\r\n         labels onto the label stack.\r\n\r\n      d) push a new label on an unlabeled packet\r\n\r\n\r\n   It may also contain:\r\n\r\n      e) the data link encapsulation to use when transmitting the packet\r\n\r\n      f) the way to encode the label stack when transmitting the packet\r\n\r\n      g) any other information needed in order to properly dispose of\r\n         the packet.\r\n\r\n   Note that at a given LSR, the packet's \"next hop\" might be that LSR\r\n   itself.  In this case, the LSR would need to pop the top level label,\r\n   and then \"forward\" the resulting packet to itself.  It would then\r\n   make another forwarding decision, based on what remains after the\r\n   label stacked is popped.  This may still be a labeled packet, or it\r\n   may be the native IP packet.\r\n\r\n   This implies that in some cases the LSR may need to operate on the IP\r\n   header in order to forward the packet.\r\n\r\n   If the packet's \"next hop\" is the current LSR, then the label stack\r\n   operation MUST be to \"pop the stack\".",
    "notes": "Section 3.10 defines NHLFE, and it sounds from the definition that this piece of information is used by an MPLS router only when packet is already labeled. Now, when section 3.12 (FTN) defines the relationship between FEC and NHLFE, the definition of NHLFE in section 3.10 does not align with FTN definition.",
    "submit_date": "2020-07-27",
    "submitter_name": "Jitendra Kumar Sharma",
    "verifier_id": "149",
    "verifier_name": "Deborah Brungard",
    "update_date": "2021-02-26 13:59:13"
  },
  {
    "errata_id": "6450",
    "doc-id": "RFC3031",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": "GLOBAL",
    "orig_text": "2.2. Terminology defines the terms\r\n\r\n        Layer 2         layer 2 the protocol layer under layer 3 \r\n                        (which therefore offers the services used by layer 3)\r\n        Layer 3         the protocol layer at which IP and its associated \r\n                        routing protocols operate\r\n\r\n2.3. Acronyms and Abbreviations defines \r\n\r\n        L2              Layer 2\r\n        L3              Layer 3\r\n\r\nHowever, in 3.14. Scope and Uniqueness of Labels, 4.3. Label Stacks and Implicit Peering, 4.5. LSP Trees as Multipoint-to-Point Entities, and 4.6. LSP Tunneling between BGP Border Routers, L1, L2 and L3 are used as differentiating names for certain labels attached to packets. \r\n\r\nOf course, in 3.23. Time-to-Live (TTL), L2 is used to refer to layer 2 frame header and to a layer 2 switch, which is correct. \r\n\r\nHowever, in 4.3. Label Stacks and Implicit Peering, the term level 1 is used to refer to the LIFO (stack) ordinal number of a label then named L1 and given a protocol layer 2 protocol of layer 2 (L2). Furthermore, labels named L2 and then L1 are pushed onto the stack of labels prefixed to the packet. To top it all off the packet's stack attribute as protocol level 2 (L2). \r\n\r\nOf course, in 3.17. LSP Next Hop, 4.1.5. The Implicit NULL Label, 5.1.1.2. PushConditional, 5.1.1.4. PulledConditional, 5.1.2.2. RequestWhenNeeded, 5.1.3. Upstream LSR: NotAvailable Procedure, 5.1.4. Upstream LSR: Release Procedure, 5.1.4.2. NoReleaseOnChange, 5.1.5. Upstream LSR: labelUse Procedure, 5.2.2. Schemes for LSRs that do not Support Label Merging, refer to L3 meaning level 3, which is correct. \r\n\r\nFurthermore, in 3.1. Labels, 3.2. Upstream and Downstream LSRs, 3.4. Label Assignment and Distribution, 3.5. Attributes of a Label Binding, 3.14. Scope and Uniqueness of Labels, 4.1.2.2. Distributing Labels, 5.1.5. Upstream LSR: labelUse Procedure, 5.1.5.2. UseIfLoopNotDetected, 5.1.6. Downstream LSR: Withdraw Procedure\r\n\r\n * L is used as a name for a certain label attached to packet, and \r\n\r\n * L is used as a arbitrary value assigned to a label attached to a packet\r\n",
    "correct_text": "I have not provided any corrected text as I've literally \"highlighted\" 44 places in a pdf format file of RFC 3031 that are ambiguous. \r\n\r\nAs there is no facility to attach a file to this Report Errata for RFC3031 form, i will send the file commented pdf file upon request. ",
    "notes": "My rational for highlighting (no pun intended) these problems is that the overloading of the L2, L3 abbreviations layer 2 and layer 3, with the names L1, L2, L3 and L for labels, plus the use of L1 and L2 as indexed names for the ordinal position of a label prefixed to a payload, then to use L2 and L3 as to actually mean layer 2 and layer is uh ... sloppy. \r\n\r\n\r\nHonestly, I can't understand how RFC 3031 has been posted for twenty years and that it is on the Standards Track and no one has found these problems. \r\n\r\nIts similar to when someone publishes a mathematical treatise and use the same set of variable names {x, y, z, t} over and over again in different contexts spread throughout the paper. Its intractable and practically gibberish. \r\n\r\nI apologize if my criticism is harsh regarding this problem but I spent a considerable amount of my time reading this document trying to make sense of it before I realized that the fault is not mine but it is of the document.\r\n\r\n[Andrew] This seems to wide and generalized to be a simple errata, as such I am marking this as held for document update.",
    "submit_date": "2021-03-00",
    "submitter_name": "Duane L. Anderson",
    "verifier_id": "174",
    "verifier_name": "Andrew Alston",
    "update_date": "2022-05-26 06:56:33"
  },
  {
    "errata_id": "696",
    "doc-id": "RFC3031",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "3.20",
    "orig_text": "For example, a set of distinct address prefixes might all have the same\r\negress node, and label swapping might be used only to get the the traffic \r\nto the egress node. ",
    "correct_text": "For example, a set of distinct address prefixes might all have the same\r\negress node, and label swapping might be used only to get the traffic \r\nto the egress node. \r\n",
    "notes": "Notice the double 'the'.",
    "submit_date": "2005-03-01",
    "submitter_name": "John Kristoff",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  }
]
