[
  {
    "errata_id": 844,
    "doc-id": "RFC3161",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "2.4.2",
    "orig_text": "   unacceptedExtension (16),\r\n     -- the requested extension is not supported by the TSA\r\n    addInfoNotAvailable (17)\r\n      -- the additional information requested could not be understood\r\n      -- or is not available\r\n    systemFailure       (25)\r\n      -- the request cannot be handled due to system failure  }",
    "correct_text": "   unacceptedExtension (16),\r\n     -- the requested extension is not supported by the TSA\r\n    addInfoNotAvailable (17),\r\n      -- the additional information requested could not be understood\r\n      -- or is not available\r\n    systemFailure       (25)\r\n      -- the request cannot be handled due to system failure  }",
    "notes": "Missing comma after the descriptor of the OID of PKIFailureInfo,\r\nat the end of line \"addInfoNotAvailable (17).\r\n\r\nfrom pending",
    "submit_date": "2007-01-31",
    "submitter_name": "Stefan Doerpinghaus",
    "verifier_id": 112,
    "verifier_name": "Tim Polk",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 1879,
    "doc-id": "RFC3161",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": 3.6,
    "orig_text": "Upon receiving a valid request, the server MUST respond with either a valid response with content type application/timestamp-response or with an HTTP error.\r\n ",
    "correct_text": "Upon receiving a valid request, the server MUST respond with either a valid response with content type application/timestamp-reply or with an HTTP error.",
    "notes": "\"application/timestamp-reply\" are used in the rest parts of RFC 3161 (4 occurencies).  Furthermore, known existing implementations are using \r\n\"application/timestamp-reply\".",
    "submit_date": "2009-09-15",
    "submitter_name": "Nick Pope",
    "verifier_id": 112,
    "verifier_name": "Tim Polk",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 2931,
    "doc-id": "RFC3161",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "2.4.2",
    "orig_text": "   PKIStatus ::= INTEGER {\r\n      granted                (0),\r\n      -- when the PKIStatus contains the value zero a TimeStampToken, as\r\n         requested, is present.\r\n      grantedWithMods        (1),\r\n       -- when the PKIStatus contains the value one a TimeStampToken,\r\n         with modifications, is present.\r\n      rejection              (2),\r\n      waiting                (3),\r\n      revocationWarning      (4),\r\n\r\n       -- this message contains a warning that a revocation is\r\n       -- imminent\r\n      revocationNotification (5)\r\n       -- notification that a revocation has occurred  }\r\n",
    "correct_text": "   PKIStatus ::= INTEGER {\r\n      granted                (0),\r\n      -- when the PKIStatus contains the value zero a TimeStampToken, as\r\n      -- requested, is present.\r\n      grantedWithMods        (1),\r\n      -- when the PKIStatus contains the value one a TimeStampToken,\r\n      -- with modifications, is present.\r\n      rejection              (2),\r\n      waiting                (3),\r\n      revocationWarning      (4),\r\n\r\n       -- this message contains a warning that a revocation is\r\n       -- imminent\r\n      revocationNotification (5)\r\n       -- notification that a revocation has occurred -- }\r\n",
    "notes": "In ASN.1 syntax 1988, all comment lines must be prefixed with double-hyphen, and comment lines followed by some content must be terminated with a double-hyphen.",
    "submit_date": "2011-08-12",
    "submitter_name": "Benjamin Dauvergne",
    "verifier_id": 124,
    "verifier_name": "Sean Turner",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 2932,
    "doc-id": "RFC3161",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "2.4.2",
    "orig_text": "    systemFailure       (25)\r\n      -- the request cannot be handled due to system failure  }",
    "correct_text": "    systemFailure       (25)\r\n      -- the request cannot be handled due to system failure -- }",
    "notes": "In ASN.1 syntax 1988, comment lines followed by content must be terminated by a double-hyphen.",
    "submit_date": "2011-08-12",
    "submitter_name": "Benjamin Dauvergne",
    "verifier_id": 124,
    "verifier_name": "Sean Turner",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 4042,
    "doc-id": "RFC3161",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": 2.1,
    "orig_text": "   8.    not to examine the imprint being time-stamped in any way (other\r\n         than to check its length, as specified in the previous bullet).\r\n\r\n   9.    not to include any identification of the requesting entity in\r\n         the time-stamp tokens.\r\n\r\n   10.   to sign each time-stamp token using a key generated exclusively\r\n         for this purpose and have this property of the key indicated on\r\n         the corresponding certificate.\r\n\r\n   11.   to include additional information in the time-stamp token, if\r\n         asked by the requester using the extensions field, only for the\r\n         extensions that are supported by the TSA.  If this is not\r\n         possible, the TSA SHALL respond with an error message.\r\n",
    "correct_text": "   8.    not to examine the imprint being time-stamped in any way (other\r\n         than to check its length, as specified in the previous bullet).\r\n\r\n   9.    to sign each time-stamp token using a key generated exclusively\r\n         for this purpose and have this property of the key indicated on\r\n         the corresponding certificate.\r\n\r\n   10.   to include additional information in the time-stamp token, if\r\n         asked by the requester using the extensions field, only for the\r\n         extensions that are supported by the TSA.  If this is not\r\n         possible, the TSA SHALL respond with an error message.\r\n",
    "notes": "\r\n\r\nThere exists at least one legal mandate in at least one jurisdiction that contravenes strict compliance with RFC3161.  It is easier to work to change IETF non-binding standards than it is to change legal mandates.\r\n\r\nThe State of Nevada regulates Time Stamps, under Nevada Administrative Code chapter 720 section 160.  It requires that Time Stamps, to be recognized by its courts, must contain the identification of the requesting entity (the \"identity of the person appending or attaching the notation\") in the time-stamp tokens.\r\n\r\nThe Administrative Code may be found at this URL: http://www.leg.state.nv.us/NAC/NAC-720.html#NAC720Sec160  I have also quoted the relevant section below.  (The parenthetical reference to NRS 720.150 is a reference to Nevada Revised Statutes, the statutory authority for the administrative code section.)\r\n\r\nNAC 720.160  \"Time stamp\" defined. (NRS 720.150)  \"Time stamp\" means:\r\n     1.  A notation that:\r\n     (a) Is digitally signed by a certification authority;\r\n     (b) Is appended or attached to a message, digital signature or certificate; and\r\n     (c) Indicates at least:\r\n          (1) The date and time the notation was appended or attached; and\r\n          (2) The identity of the person appending or attaching the notation; or\r\n     2.  To append or attach such a notation to a message, digital signature or certificate.\r\n     (Added to NAC by Sec'y of State by R155-98, eff. 12-2-99)\r\n\r\nPlease note that the requirement of NAC 720.160.1(c)(2) went into effect in December 1999, more than 18 months before RFC3161 was published in August 2001.  The attempt by a non-legislative body (IETF pkix-wg) to contravene the will of a legislative body was either abject ignorance or utter hubris.\r\n\r\nA TimeStampToken extension would be able to contain the mandatory data.  However, such an extension would necessarily violate current RFC3161 section 2.1.9.\r\n\r\nThe reason for this change is actually technical (from a legal sense), though it may appear to be editorial in nature.  As digests grow older, they necessarily have a much longer time that they have subject to the Birthday Attack.  As of the date of this errata submission, SHA-1 is disallowed by the Computer Security Resource Center of US National Institute of Science and Technology (NIST) for new digital signature generation, due to potential weakening due to increased temporal attack surface.\r\n\r\nThis means that sooner or later, an older timestamp is going to be found that matches the digest of a newer document.  The goal is to ensure that the document in question was actually in the possession of the particularly-named person identified as having attached the timestamp, by making that person available for testimony in the event of a dispute.  If there are multiple timestamps available using different digest algorithms that all have the same time (within a few seconds of each other), that raises the probability that the document did in fact exist at that time.  However, because new digest algorithms are introduced over time, it is not feasible to expect that all provided timestamps for a given document will necessarily be at the same time -- as long as all the digests that existed at the time the timestamps were generated have their times match, and the timestamps with new digests were not created before the new digests were implemented, it's the best evidence available that the timestamped data existed at the latest of the times of the timestamps from digests that existed simultaneously.  (Be VERY careful about accepting timestamps that are more than thirty seconds apart from algorithms that existed simultaneously, and only in the murkiest situations should any set of timestamps using algorithms that existed simultaneously ever be accepted that are stamped as being more than two minutes apart.)\r\n\r\nRFC3161 Section 2.4.1 defines a TimeStampReq format which does not provide the actual datum to be timestamped.  Any attempt at a protocol which does make the Certification Authority be the one attaching the timestamp to the datum would have to provide the datum to the custody of the Certification Authority, which would exceed the scope of the protocol defined by RFC3161.  Thus, a true RFC3161-compliant implementation would have to use nonstandard extensions to either the submission protocol (leaving the datum in the care of the Time Stamp Server) or the TimeStampReq and TimeStampToken contents (containing the datum in, presumably, an extension containing an ASN.1 OCTET STRING), in order to comply with this legal mandate in such a way that the identity of the person requesting the imprint (and thus presumed to hold the datum in the first place) does not need to be included within the TimeStampToken.  Unfortunately, this would also necessitate a violation of RFC3161 section 2.1.8, to prevent false statements from being signed in a jurisdiction where digital signatures have the force of acknowledgments before notaries public.\r\n\r\nThe erratum submitter respectfully requests that a Time Stamp working group be reconvened for an update to the protocol to address this and other errata which are currently held for update.\n --VERIFIER NOTES-- \n\r\nThis is not an erratum but a change request. Please send to the pkix list if\r\nit's still useful.",
    "submit_date": "2014-07-05",
    "submitter_name": "Kyle Hamilton",
    "verifier_id": 128,
    "verifier_name": "Stephen Farrell",
    "update_date": "2019-09-10 09:09:03"
  }
]
