[
  {
    "errata_id": 1634,
    "doc-id": "RFC3143",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": "2.2.2",
    "orig_text": "2.2.2 Interception proxies prevent introduction of new HTTP methods\r\n\r\n   Name\r\n      Interception proxies prevent introduction of new HTTP methods\r\n\r\n   Classification\r\n      Architecture\r\n\r\n   Description\r\n      A proxy that receives a request with a method unknown to it is\r\n      required to generate an HTTP 501 Error as a response.  HTTP\r\n      methods are designed to be extensible so there may be applications\r\n      deployed with initial support just for the user agent and origin\r\n      server.  An interception proxy that hijacks requests which include\r\n      new methods destined for servers that have implemented those\r\n      methods creates a de-facto firewall where none may be intended.\r\n\r\n   Significance\r\n      Medium within interception proxy environments.\r\n\r\n   Implications\r\n      Renders new compliant applications useless unless modifications\r\n      are made to proxy software.  Because new methods are not required\r\n      to be globally standardized it is impossible to keep up to date in\r\n      the general case.\r\n\r\n   Solution(s)\r\n      Eliminate the need for interception proxies.  A client receiving a\r\n      501 in a traditional HTTP environment may either choose to repeat\r\n      the request to the origin server directly, or perhaps be\r\n      configured to use a different proxy.\r\n\r\n   Workaround\r\n      Level 5 switches (sometimes called Level 7 or application layer\r\n      switches) can be used to keep HTTP traffic with unknown methods\r\n      out of the proxy.  However, these devices have heavy buffering\r\n      responsibilities, still require TCP sequence number spoofing, and\r\n      do not interact well with persistent connections.\r\n\r\n      The HTTP/1.1 specification allows a proxy to switch over to tunnel\r\n      mode when it receives a request with a method or HTTP version it\r\n      does not understand how to handle.\r\n\r\n   Contact\r\n      Patrick McManus <mcmanus@AppliedTheory.com>\r\n      Henrik Nordstrom <hno@hem.passagen.se> (HTTP/1.1 clarification)\r\n\r\n",
    "correct_text": "- none -",
    "notes": "The whole subsection needs to be removed. There is no requirement in RFC2616 for proxies to generate a 501 status for unknown methods.\r\n\r\nMark Nottingham wrote: I don't think that deleting this section is the right answer; some interception proxies *do* prevent the introduction of new methods; it's just the text about 501 that's wrong.\r\n",
    "submit_date": "2008-12-13",
    "submitter_name": "Julian Reschke",
    "verifier_id": 116,
    "verifier_name": "Alexey Melnikov",
    "update_date": "2019-09-10 09:09:03"
  }
]
