[
  {
    "errata_id": 3474,
    "doc-id": "RFC3118",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": 2,
    "orig_text": "   If the RDM field contains 0x00, the replay detection field MUST be\r\n   set to the value of a monotonically increasing counter.  Using a\r\n   counter value such as the current time of day (e.g., an NTP-format\r\n   timestamp [4]) can reduce the danger of replay attacks.  This method\r\n   MUST be supported by all protocols.",
    "correct_text": "   If the RDM field contains 0x00, the replay detection field MUST be\r\n   set to the value of a strictly increasing counter.  Using a\r\n   counter value such as the time since the epoch (e.g., an NTP-format\r\n   timestamp [4]) can reduce the danger of replay attacks.  This method\r\n   MUST be supported by all protocols.",
    "notes": "The term \"monotonically increasing\" does not actually mean what the authors and editors hope it means.  :-)  An example of a monotonically increasing sequence is: \r\n  1, 2, 2, 2, 2, 2, 2...  \r\n\r\nStrictly following that definition in the current section 2 would allow replays of captured packets.  Changing the term to \"strictly increasing\" requires that subsequent values are greater than previous values.  This would mean that a captured packet replayed with the same Authentication Information value would not meet the criteria described in my proposed corrected text, and should consequently be detected as a replay attack by a recipient.\r\n\r\nThe term monotonically increasing is also used at the end of Section 6 and should also be replaced with strictly increasing.\r\n\r\nAlso, the use of the term  \"time of day\" could be problematic.  If the first packet were sent just before midnight, and the second sent just after midnight, then the value of the second would be much lower than the value of the first.  To align with the NTP example, I'm suggesting a change in text to be something that is actually increasing.",
    "submit_date": "2013-02-02",
    "submitter_name": "Chris Lonvick",
    "verifier_id": 117,
    "verifier_name": "Ralph Droms",
    "update_date": "2019-09-10 09:09:03"
  }
]
