[
  {
    "errata_id": "610",
    "doc-id": "RFC4342",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "6",
    "orig_text": "      2. A Receive Rate option, defined in Section 8.3, specifying the\r\n         rate at which data was received since the last DCCP-Ack was\r\n         sent.",
    "correct_text": "      2. A Receive Rate option, defined in Section 8.3, specifying the\r\n         rate at which data was received over the last round-trip time.",
    "notes": "Section 8.3 of RFC 4342 (DCCP CCID 3) specifies that the Receive\r\nRate option reports the receive rate since the last feedback packet\r\nwas sent.  In contrast, Section 6.2 of RFC 3448 (TFRC) specifies\r\nthat the feedback packet reports the receive rate over the last\r\nround-trip time.  As a result, the receive rate specified by\r\nRFC 4342 differs from that of TFRC for a feedback packet after an\r\nidle period; the receive rate report specified in RFC 4342 reports\r\nthe receive rate over the entire idle period.  The receive rate\r\nreported by RFC 4342 also differs from that of TFRC for an early\r\nfeedback packet reporting a new loss event.  This errata updates\r\nRFC 4342 to use the definition of the receive rate as specified in\r\nRFC 3448.",
    "submit_date": "2007-10-24",
    "submitter_name": "Sally Floyd",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "611",
    "doc-id": "RFC4342",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "8.3",
    "orig_text": "      Its four data bytes indicate the rate at which\r\n      the receiver has received data since it last sent an\r\n      acknowledgement, in bytes per second.  To calculate this receive\r\n      rate, the receiver sets t to the larger of the estimated round-\r\n      trip time and the time since the last Receive Rate option was\r\n      sent.",
    "correct_text": "      Its four data bytes indicate the rate at which\r\n      the receiver has received data over the last round-trip time,\r\n      in bytes per second.  To calculate the time interval t for\r\n      calculating this receive rate, the receiver follows Section\r\n      6.2 of [RFC3448].",
    "notes": "This errata updates RFC 4342 to use the definition of the receive rate \r\nas specified in RFC 3448.",
    "submit_date": "2007-10-24",
    "submitter_name": "Sally Floyd",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "612",
    "doc-id": "RFC4342",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "8.3",
    "orig_text": "        ",
    "correct_text": "      Assume that the sender receives two feedback packets with \r\n      Acknowledgement Numbers A1 and A2, respectively.  Further assume\r\n      that the sender sent no data packets in between Sequence Numbers\r\n      A1+1 and A2, inclusive.  (All those packets must have been pure\r\n      acknowledgements, Sync and SyncAck packets, and so forth.)  Then\r\n      the sender MAY, at its discretion, ignore the second feedback\r\n      packet's Receive Rate option.  Note that when the sender decides\r\n      to ignore such an option, it MUST NOT reset the nofeedback timer\r\n      as it normally would; the nofeedback timer will expire as if the\r\n      second feedback packet had not been received.",
    "notes": "This is a new paragraph to be added to the end of Section 8.3.\r\nIt specifies that if the interval covered by a feedback packet doesn't include \r\nany data packets, then the sender doesn't have to use the reported receive rate.",
    "submit_date": "2007-10-24",
    "submitter_name": "Sally Floyd",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "829",
    "doc-id": "RFC4342",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "5",
    "orig_text": "   Translating this to the packet-based congestion control of CCID 3,\r\n   the initial CCID 3 sending rate is allowed to be at least two packets\r\n   per RTT, and at most four packets per RTT, depending on the packet\r\n   size.  The initial rate is only allowed to be three or four packets\r\n   per RTT when, in terms of segment size, that translates to at most\r\n   4380 bytes per RTT.",
    "correct_text": "   Therefore, in contrast to [RFC3448], the initial CCID 3 sending rate\r\n   is allowed to be at least two packets per RTT, and at most four\r\n   packets per RTT, depending on the packet size.  The initial rate is\r\n   only allowed to be three or four packets per RTT when, in terms of\r\n   segment size, that translates to at most 4380 bytes per RTT.  This\r\n   might be implemented, for example, by setting the initial sending\r\n   rate to min(4*s, max(2*s, 4380 bytes)), where \"s\" as usual is the\r\n   packet size in bytes.",
    "notes": "Clarification of initial sending rates.\r\n\r\nReported By: Eddie Kohler and Sally Floyd, from Gerrit Renker and Arjuna Sathiaseelan \r\n\r\nfrom pending",
    "submit_date": "2007-02-07",
    "submitter_name": "Eddie Kohler",
    "verifier_id": "2",
    "verifier_name": "",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "830",
    "doc-id": "RFC4342",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "5",
    "orig_text": "   The sender's measurement of the round-trip time uses the Elapsed Time\r\n   and/or Timestamp Echo option contained in feedback packets, as\r\n   described in Section 8.2. The Elapsed Time option is required, while\r\n   the Timestamp Echo option is not.  The sender maintains an average\r\n   round-trip time heavily weighted on the most recent measurements.",
    "correct_text": "   The sender's measurement of the round-trip time uses DCCP's mechanisms\r\n   for round-trip time measurement.  This includes Elapsed Time and/or\r\n   Timestamp Echo options.  As described in Section 8.2, feedback packets\r\n   must carry an Elapsed Time option; Timestamp Echo is optional.\r\n   The sender maintains an average round-trip time heavily weighted on the\r\n   most recent measurements.  Senders MAY use any available round-trip time\r\n   measurements, including from the initial Request-Response packet exchange,\r\n   to maintain this average.  This differs from [RFC 3448], which constrains\r\n   round-trip time measurements to feedback packets only.",
    "notes": "Clarification of round-trip time measurement.\r\n\r\nReported By: Eddie Kohler and Sally Floyd, from Gerrit Renker and Arjuna Sathiaseelan \r\n\r\nfrom pending",
    "submit_date": "2007-02-07",
    "submitter_name": "Eddie Kohler",
    "verifier_id": "2",
    "verifier_name": "",
    "update_date": "2019-09-10 09:09:03"
  }
]
