[
  {
    "errata_id": "6291",
    "doc-id": "RFC4568",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "7.1.4",
    "orig_text": "If the offerer includes an IP address and/or port that differs from\r\n   that used previously for a media stream (or FEC stream), the offerer\r\n   MUST include a new master key with the offer (and in so doing, it\r\n   will be creating a new crypto context where the ROC is set to zero).      \r\n   Similarly, if the answerer includes an IP address and/or port that\r\n   differs from that used previously for a media stream (or FEC stream),\r\n   the answerer MUST include a new master key with the answer (and hence\r\n   create a new crypto context with the ROC set to zero).  The reason\r\n   for this is that when the answerer receives an offer or the offerer\r\n   receives an answer with an updated IP address and/or port, it is not\r\n   possible to determine if the other side has access to the old crypto\r\n   context parameters (and in particular the ROC).  For example, if one\r\n   side is a decomposed media gateway, or if a SIP back-to-back user\r\n   agent is involved, it is possible that the media endpoint changed and\r\n   no longer has access to the old crypto context.  By always requiring\r\n   a new master key in this case, the answerer/offerer will know that\r\n   the ROC is zero for this offer/answer, and any key lifetime\r\n   constraints will trivially be satisfied too.  Another consideration\r\n   here applies to media relays; if the relay changes the media endpoint\r\n   on one side transparently to the other side, the relay cannot operate\r\n   as a simple packet reflector but will have to actively engage in SRTP\r\n   packet processing and transformation (i.e., decryption and re-\r\n   encryption, etc.).\r\nFinally, note that if the new offer is rejected, the old crypto\r\n   parameters remain in place.\r\n",
    "correct_text": null,
    "notes": "(and in so doing, it\r\n   will be creating a new crypto context where the ROC is set to zero).      \r\n    -Which crypto context for which direction?  Logically this would be the crypto context for media towards the new IP address ?\r\n\r\n(and hence\r\n   create a new crypto context with the ROC set to zero). \r\n   -What if the offerer stays the same and only the answerer changes the IP address?\r\nNew crypto context in direction towards new IP address?  \r\n\r\nBy always requiring\r\n   a new master key in this case, the answerer/offerer will know that\r\n   the ROC is zero for this offer/answer,\r\n   -Is this resetting crypto context for both directions of media flow?\r\n\r\nIs this section based on having offer and answerer both change the IP address.  \r\nWhat if the offerer did not change the IP address but the answerer does change it.\r\nWhat is the expected behavior for media/crypto context/ROC for both sides?\r\n\r\nWhat is expected for IP address of 0.0.0.0 for hold, should this reset crypto context as well?\r\n\r\nHow should all of this be handled for the case of switching to MoH server and then back to original call?\r\nSBC ------------- CUCM ------------ EXP (signaling)\r\nSBC --------------------------------- EXP (media stream 1)\r\nSBC --------------------------------- MOH (media stream 2)\r\n\r\nSBC ------------- CUCM ------------ EXP \r\n<--------------------SDP with IP1ofEXP part of early offer from SBC\r\nCrypto context for media towards EXP \r\n<--------------------SDP with IP2ofMoH part of delayed offer from CUCM and additional early offer CUCM.  CUCM initiates MoH signaling towards SBC.\r\nCrypto context for media towards MoH (only SBC and MoH know about this)\r\n<--------------------SDP with IP1ofEXP part of delayed offer from CUCM\r\nCrypto context for media towards EXP.  Should this be the same as the original if SSRC did not change for media from SBC towards Expressway?",
    "submit_date": "2020-09-16",
    "submitter_name": "David Nguyen",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  },
  {
    "errata_id": "6808",
    "doc-id": "RFC4568",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "9.2",
    "orig_text": "srtp-crypto-suite   = \"AES_CM_128_HMAC_SHA1_32\" /\r\n                            \"F8_128_HMAC_SHA1_32\" /\r\n                            \"AES_CM_128_HMAC_SHA1_80\" /\r\n                            srtp-crypto-suite-ext\r\n",
    "correct_text": "srtp-crypto-suite   = \"AES_CM_128_HMAC_SHA1_32\" /\r\n                            \"F8_128_HMAC_SHA1_80\" /\r\n                            \"AES_CM_128_HMAC_SHA1_80\" /\r\n                            srtp-crypto-suite-ext\r\n",
    "notes": "Section 6.2.3 uses 80 bit for F8 (IANA registration)",
    "submit_date": "2022-01-05",
    "submitter_name": "Fritz",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  }
]
