[
  {
    "errata_id": "85",
    "doc-id": "RFC4448",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "",
    "orig_text": "1)  a subtle typo\r\n\r\nSection 4.5 of RFC 4448, on top of page 12, says:\r\n\r\n   The Ethernet PW management model follows the general PW management\r\n   model defined in [RFC3985] and [PWE3-MIB].  Many common PW management\r\n   facilities are provided here, with no additional Ethernet specifics\r\n   necessary.  Ethernet-specific parameters are defined in an additional\r\n   MIB module, [PW-MIB].\r\n\r\nIt should say, replacing \"here\" by \"there\":\r\n\r\n   The Ethernet PW management model follows the general PW management\r\n   model defined in [RFC3985] and [PWE3-MIB].  Many common PW management\r\n|  facilities are provided there, with no additional Ethernet specifics\r\n   necessary.  Ethernet-specific parameters are defined in an additional\r\n   MIB module, [PW-MIB].\r\n\r\n\r\n(2)  terminological issue / violation of reference model\r\n\r\nSection 4.4.1 of RFC 4448, on pp. 9/10, says:\r\n\r\n--- snip ---\r\n   When the PE receives an Ethernet frame, and the frame has a VLAN tag,\r\n   we can distinguish two cases:\r\n\r\n      1. The tag is service-delimiting.  This means that the tag was\r\n         placed on the frame by some piece of service provider-operated\r\n         equipment, and the tag is used by the service provider to\r\n         distinguish the traffic.  For example, LANs from different\r\n         customers might be attached to the same service provider\r\n         switch, which applies VLAN tags to distinguish one customer's\r\n         traffic from another's, and then forwards the frames to the PE.\r\n\r\n      2. The tag is not service-delimiting.  This means that the tag was\r\n         placed in the frame by a piece of customer equipment, and is\r\n         not meaningful to the PE.\r\n\r\n   Whether or not the tag is service-delimiting is determined by local\r\n   configuration on the PE.\r\n--- snip ---\r\n\r\nIMHO, this is a very unfortunate explanation.\r\n\r\na) The term, \"service delimiting\", apparently here is defined\r\n   by the origin of the tag, not by its function.\r\n   I do not believe that this is the appropriate way to deal with;\r\n   later on in RFC 4448, it (reasonably) seems to be permitted\r\n   that a service-delimiting tag has been provided by a CE device!\r\n\r\nb) The situation described in bullet 1), with a provider owned\r\n   switch, removes the PW terminating entity from the provider\r\n   *edge*, turning it from a \"PE\" device into a \"P\" device,\r\n   which is highly inconsistent with the service model developed\r\n   in Section 1 of RFC 4448, and leads to a clash in terminology.\r\n   To stay within that model, the \"coloring\" function described\r\n   in bullet 1) must conceptionally be performed by the NSP\r\n   function *within* the (PW terminating) PE device. (And it might\r\n   as well be performed in customer equipment, i.e. at the CE.)\r\n\r\nPerhaps, the above text should be improved.\r\nI'll try at a first proposal:\r\n\r\n--- snip ---\r\n   When the PE receives an Ethernet frame, and the frame has a VLAN tag,\r\n   we can distinguish two cases:\r\n\r\n      1. The tag is service-delimiting.\r\n\t This means that the tag was introduced for the single purpose\r\n\t of identifying the frame for the PW service, e.g., to select a\r\n\t specific PW for transmission of the frame.  A service-\r\n\t delimiting tag may have been added on the CE side or in the\r\n         (conceptual) NSP function of the PE edge.\r\n\t Ordinarily, any service-delimiting tag will not be transmitted\r\n\t over the PW, i.e., it will be removed before PW encapsulation.\r\n\r\n      2. The tag is not service-delimiting.  This means that the tag is\r\n         not meaningful to the PW endpoints and must be transmitted over\r\n\t the PW.\r\n\t Such tag usually was placed in the frame by a piece of customer\r\n\t equipment, but it might as well be added or modified by the NSP\r\n\t function of the PW terminating PE device.\r\n\r\n   Whether or not the tag is service-delimiting is determined by local\r\n   configuration on the PE.\r\n--- snip ---",
    "correct_text": "",
    "notes": "from pending",
    "submit_date": "2006-05-25",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": "122",
    "verifier_name": "Stewart Bryant",
    "update_date": "2019-09-10 09:09:03"
  }
]
