[
  {
    "errata_id": 57,
    "doc-id": "RFC4566",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": 99,
    "orig_text": "(1)  typo\r\n\r\nOn page 7 of RFC 4566, Section 4.6 says:\r\n\r\n   The SDP specification recommends the use of the ISO 10646 character\r\n|  sets in the UTF-8 encoding [5] to allow many different languages to\r\n   be represented.  However, to assist in compact representations, SDP\r\n   also allows other character sets such as ISO 8859-1 to be used when\r\n   desired.  Internationalisation only applies to free-text fields\r\n   (session name and background information), and not to SDP as a whole.\r\n\r\nIt should say:\r\n\r\n   The SDP specification recommends the use of the ISO 10646 character\r\n|  set in the UTF-8 encoding [5] to allow many different languages to\r\n   be represented.  However, to assist in compact representations, SDP\r\n   also allows other character sets such as ISO 8859-1 to be used when\r\n   desired.  Internationalisation only applies to free-text fields\r\n   (session name and background information), and not to SDP as a whole.\r\n\r\n\r\n(2)  inconsistent specification\r\n\r\nContrary to the text in Section 4.6 (see above), Section 5 of RFC 4566\r\nspecifies, at the bottom of page 7:\r\n\r\n   An SDP session description is entirely textual using the ISO 10646\r\n   character set in UTF-8 encoding.  SDP field names and attribute names\r\n   use only the US-ASCII subset of UTF-8, but textual fields and\r\n   attribute values MAY use the full ISO 10646 character set.  [...]\r\n\r\nThese conflicting specifications might become a source of\r\ninteroperability problems, and therefore, the conflict should be\r\nresolved by a clarification !!!\r\n\r\nNote: Subsequent text in sections 5.* specifies behaviour related\r\nto the \"a=charset\" attribute required if other charsets than UTF-8\r\nare used in certain fields; therefore, the latter exclusive UTF-8\r\nrule is most probably too restrictive and hence inappropriate.\r\n\r\n\r\n(3)  misleading text / inconsistency + typo (missing article)\r\n\r\nStill in Section 5, the second-to-last paragraph on page 8 of RFC 4566\r\nsays:\r\n\r\n   An SDP session description consists of a session-level section\r\n   followed by zero or more media-level sections.  The session-level\r\n   part starts with a \"v=\" line and continues to the first media-level\r\n|  section.  Each media-level section starts with an \"m=\" line and\r\n|  continues to the next media-level section or end of the whole session\r\n   description.  In general, session-level values are the default for\r\n   all media unless overridden by an equivalent media-level value.\r\n\r\nThe second sentence does not accomodate for an important corner case\r\nmentioned in the first sentence, and thus should be amended with\r\nsimilar wording as below. The third sentence is imprecise as well,\r\nbecause the \"or\" does not uniquely select the 'right' condition.\r\n\r\nIt should better say:\r\n\r\n   An SDP session description consists of a session-level section\r\n   followed by zero or more media-level sections.  The session-level\r\n   part starts with a \"v=\" line and continues to the first media-level\r\n|  section (or the end of the whole description, whichever comes first).\r\n   Each media-level section starts with an \"m=\" line and continues to\r\n|  the next media-level section or the end of the whole session\r\n|  description - whichever comes first.  In general, session-level\r\n   values are the default for all media unless overridden by an\r\n   equivalent media-level value.\r\n\r\n\r\n(4)  significant mis-specification\r\n\r\nIn the \"Session description\" block, on top of page 9, the RFC says:\r\n\r\n         c=* (connection information -- not required if included in\r\n              all media)\r\n         b=* (zero or more bandwidth information lines)\r\n\r\nIt should say:\r\n\r\n         c=* (connection information -- not required if included in\r\n              all media descriptions)\r\n         b=* (zero or more bandwidth information lines)\r\n\r\nRationale:\r\nStrictly differentiating between \"media\" and \"media description\"\r\nis always required to avoid confusion! ...\r\nAnd connection information is rarely (if ever) seen in the media!\r\n\r\n\r\n(5)  improper wording related with IP addresses\r\n\r\nIP addresses (in IPv4 and IPv6) are always assigned to an interface,\r\nnot to a host or 'machine'.  Therefore, a Standards Track RFC\r\nshould never talk about  '*the* IP address of a machine'.\r\nFQDNs are also not necessarily unique for a 'machine', e.g. a server\r\nhaving multiple, 'role-based' FQDNs.\r\n\r\nTherefore, in Section 5.2, the last paragraph on page 11,\r\n\r\n|  <unicast-address> is the address of the machine from which the\r\n      session was created.  For an address type of IP4, this is either\r\n|     the fully qualified domain name of the machine or the dotted-\r\n|     decimal representation of the IP version 4 address of the machine.\r\n|     For an address type of IP6, this is either the fully qualified\r\n      domain name of the machine or the compressed textual\r\n|     representation of the IP version 6 address of the machine.  For\r\n      both IP4 and IP6, the fully qualified domain name is the form that\r\n|     SHOULD be given unless this is unavailable, in which case the\r\n      globally unique address MAY be substituted.  A local IP address\r\n      MUST NOT be used in any context where the SDP description might\r\n      leave the scope in which the address is meaningful (for example, a\r\n      local address MUST NOT be included in an application-level\r\n      referral that might leave the scope).\r\n\r\nshould say:\r\n\r\n|  <unicast-address> is an address of the machine from which the\r\n      session was created.  For an address type of IP4, this is either\r\n|     a fully qualified domain name of the machine or the dotted-\r\n|     decimal representation of an IP version 4 address of the machine.\r\n|     For an address type of IP6, this is either a fully qualified\r\n      domain name of the machine or the compressed textual\r\n|     representation of an IP version 6 address of the machine.  For\r\n      both IP4 and IP6, the fully qualified domain name is the form that\r\n|     SHOULD be given unless this is unavailable, in which case a\r\n      globally unique address MAY be substituted.  A local IP address\r\n      MUST NOT be used in any context where the SDP description might\r\n      leave the scope in which the address is meaningful (for example, a\r\n      local address MUST NOT be included in an application-level\r\n      referral that might leave the scope).\r\n\r\n\r\n(6)  improper term used\r\n\r\na)\r\nSection 5.6 twice uses the term, \"conference\", where IMHO, according\r\nto the definitions given in Section 2, the term, \"session\" should\r\nbe used.  This change makes the text better conform with the\r\nclassification of the \"e=\" and \"p=\" lines on page 9, as well.\r\n\r\nThe first textual paragraph of Section 5.6, on page 13, says:\r\n\r\n   The \"e=\" and \"p=\" lines specify contact information for the person\r\n|  responsible for the conference.  This is not necessarily the same\r\n|  person that created the conference announcement.\r\n\r\nIt should say:\r\n\r\n   The \"e=\" and \"p=\" lines specify contact information for the person\r\n|  responsible for the session.  This is not necessarily the same person\r\n|  that created the session announcement.\r\n\r\nb)\r\nAnother instance of this issue occurs in Section 5.7, at the bottom\r\nof page 14.  There, the RFC says:\r\n\r\n   o  Sessions using an IPv4 multicast connection address MUST also have\r\n      a time to live (TTL) value present in addition to the multicast\r\n      address.  The TTL and the address together define the scope with\r\n|     which multicast packets sent in this conference will be sent.  TTL\r\n      values MUST be in the range 0-255.  [...]\r\n\r\nIt should say:\r\n\r\n   o  Sessions using an IPv4 multicast connection address MUST also have\r\n      a time to live (TTL) value present in addition to the multicast\r\n      address.  The TTL and the address together define the scope with\r\n|     which multicast packets sent in this session will be sent.  TTL\r\n      values MUST be in the range 0-255.  [...]\r\n\r\nc)\r\nFinally, the last sentence of the second paragraph of Section 5.13,\r\non page 21,\r\n\r\n                                                   [...].  Attribute\r\n   fields can also be added before the first media field; these\r\n   \"session-level\" attributes convey additional information that applies\r\n   to the conference as a whole rather than to individual media.\r\n\r\nshould say, accordingly:\r\n\r\n                                                   [...].  Attribute\r\n   fields can also be added before the first media field; these\r\n   \"session-level\" attributes convey additional information that applies\r\n|  to the session as a whole rather than to individual media.\r\n\r\n\r\n(7)  clarification\r\n\r\nThe second paragraph of Section 5.9, on page 17, says:\r\n\r\n   The first and second sub-fields give the start and stop times,\r\n   respectively, for the session.  These values are the decimal\r\n   representation of Network Time Protocol (NTP) time values in seconds\r\n   since 1900 [13].  To convert these values to UNIX time, subtract\r\n   decimal 2208988800.\r\n\r\nTo make the time base unique and absolute, the time zone (UTC) needs to\r\nbe specified.\r\nHence, the RFC should say:\r\n\r\n   The first and second sub-fields give the start and stop times,\r\n   respectively, for the session.  These values are the decimal\r\n   representation of Network Time Protocol (NTP) time values in seconds\r\n|  since 1900, UTC [13].  To convert these values to UNIX time, subtract\r\n   decimal 2208988800.\r\n\r\n\r\n(8)  typo (missing article)\r\n\r\nThe second text paragraph of section 5.10, on page 18, says:\r\n\r\n   To make description more compact, times may also be given in units of\r\n   days, hours, or minutes.  [...]\r\n\r\nIt should say:\r\n\r\n|  To make the description more compact, times may also be given in\r\n   units of days, hours, or minutes.  [...]\r\n\r\n\r\n(9)  legacy term not replaced\r\n\r\nSince the advent of SIP and the Offer/Answer Model for SDP, it is\r\nno more appropriate, in a general context, to name a\r\n'session description' just a 'session announcement'.\r\n\r\nThe final paragraph of Section 5.11, on page 19, says:\r\n\r\n   If a session is likely to last several years, it is expected that the\r\n   session announcement will be modified periodically rather than\r\n   transmit several years' worth of adjustments in one session\r\n   announcement.\r\n\r\nIt should say therefore:\r\n\r\n   If a session is likely to last several years, it is expected that the\r\n|  session description will be modified periodically rather than\r\n|  transmitting several years' worth of adjustments in one session\r\n|  description.\r\n\r\n\r\n(10) clarification of 'charset' related terminology, plus typos\r\n\r\nSection 5.13 makes use of legacy terminology related to character\r\nsets and \"charsets\".  It should use the stable, IESG policy based\r\nIETF terminology.\r\n\r\na)\r\nHence, the first paragraph on page 22:\r\n\r\n   Attribute values are octet strings, and MAY use any octet value\r\n   except 0x00 (Nul), 0x0A (LF), and 0x0D (CR).  By default, attribute\r\n   values are to be interpreted as in ISO-10646 character set with UTF-8\r\n   encoding.  Unlike other text fields, attribute values are NOT\r\n   normally affected by the \"charset\" attribute as this would make\r\n   comparisons against known values problematic.  However, when an\r\n   attribute is defined, it can be defined to be charset dependent, in\r\n   which case its value should be interpreted in the session charset\r\n   rather than in ISO-10646.\r\n\r\nshould better say:\r\n\r\n   Attribute values are octet strings, and MAY use any octet value\r\n   except 0x00 (Nul), 0x0A (LF), and 0x0D (CR).  By default, attribute\r\n|  values are to be interpreted as in the ISO-10646 character set with\r\n   UTF-8 encoding.  Unlike other text fields, attribute values are NOT\r\n   normally affected by the \"charset\" attribute as this would make\r\n   comparisons against known values problematic.  However, when an\r\n   attribute is defined, it can be defined to be charset dependent, in\r\n   which case its value should be interpreted in the session charset\r\n   rather than in UTF-8.\r\n\r\nNote: RFC 1815 has been deprecated; 'ISO-10646' is *not* considered a\r\n\"charset\", whereas 'UTF-8' is.\r\n\r\nb)\r\nIn Section 6, at the bottom of page 28, the RFC says:\r\n\r\n      a=charset:<character set>\r\n\r\n         This specifies the character set to be used to display the\r\n         session name and information data.  By default, the ISO-10646\r\n         character set in UTF-8 encoding is used.  If a more compact\r\n         representation is required, other character sets may be used.\r\n         For example, the ISO 8859-1 is specified with the following SDP\r\n         attribute:\r\n\r\n            a=charset:ISO-8859-1\r\n\r\nThe above headline should say:\r\n\r\n      a=charset:<charset>\r\n\r\nor perhaps even better:\r\n\r\n      a=charset:<IANA-charset>\r\n\r\nand the text body above should be changed to say:\r\n\r\n|        This specifies the character set and encoding (\"charset\") to be\r\n|        used for the session name and information data.  By default,\r\n|        the ISO-10646 character set in UTF-8 encoding (charset \"UTF-8\")\r\n         is used.  If a more compact representation is required, other\r\n|        charsets may be used.  For example, the ISO 8859-1 charset is\r\n         specified with the following SDP attribute:\r\n         [...]\r\n\r\nNote: The session description does not determine how parts of it\r\nare *displayed* (theres may be some transcoding used, and fonts\r\nor typefaces, etc., the charset must only be specified for SDP.)\r\n\r\nThe subsequent text on page 29,\r\n\r\n         This is a session-level attribute and is not dependent on\r\n         charset.  The charset specified MUST be one of those registered\r\n         with IANA, such as ISO-8859-1.  The character set identifier is\r\n         a US-ASCII string and MUST be compared against the IANA\r\n         identifiers using a case-insensitive comparison.  If the\r\n         identifier is not recognised or not supported, all strings that\r\n         are affected by it SHOULD be regarded as octet strings.\r\n\r\n         Note that a character set specified MUST still prohibit the use\r\n         of bytes 0x00 (Nul), 0x0A (LF), and 0x0d (CR).  Character sets\r\n         requiring the use of these characters MUST define a quoting\r\n         mechanism that prevents these bytes from appearing within text\r\n         fields.\r\n\r\nshould be changed to say (fixing typos as well):\r\n\r\n         This is a session-level attribute and is not dependent on\r\n         charset.  The charset specified MUST be one of those registered\r\n|        with IANA, such as ISO-8859-1.  The charset identifier is a\r\n         US-ASCII string and MUST be compared against the IANA\r\n         identifiers using a case-insensitive comparison.  If the\r\n         identifier is not recognised or not supported, all strings that\r\n         are affected by it SHOULD be regarded as octet strings.\r\n\r\n|        Note that a charset specified MUST still prohibit the use of\r\n|        bytes 0x00 (NUL), 0x0A (LF), and 0x0D (CR).  Charsets requiring\r\n         the use of these characters MUST define a quoting mechanism\r\n         that prevents these bytes from appearing within text fields.\r\n\r\n\r\n(11)  language related issues, plus typos\r\n\r\nThe RFC text on pp. 29/30 does not properly distinguish between, and\r\nmesses up, the specifics of session content (and its language[s]) and\r\nthe session *description* content (and the language[s] used therein).\r\n\r\nNote: I show more context than absolutely necessary to perform the\r\nrecommended changes, to make these better understandable.\r\n\r\na)\r\nOn mid-page 29, RFC 4566 says:\r\n\r\n      a=sdplang:<language tag>\r\n\r\n         This can be a session-level attribute or a media-level\r\n         attribute.  As a session-level attribute, it specifies the\r\n         language for the session description.  As a media-level\r\n         attribute, it specifies the language for any media-level SDP\r\n         information field associated with that media.  Multiple sdplang\r\n         attributes can be provided either at session or media level if\r\n|        multiple languages in the session description or media use\r\n|        multiple languages, in which case the order of the attributes\r\n|        indicates the order of importance of the various languages in\r\n|        the session or media from most important to least important.\r\n\r\n(The last half-sentence is wrong and inappropriate.)\r\n\r\nIt should better say:\r\n\r\n      a=sdplang:<language tag>\r\n\r\n         This can be a session-level attribute or a media-level\r\n         attribute.  As a session-level attribute, it specifies the\r\n         language for the session description.  As a media-level\r\n         attribute, it specifies the language for any media-level SDP\r\n         information field associated with that media.  Multiple sdplang\r\n         attributes can be provided either at session or media level if\r\n|        multiple languages in the session or media description use\r\n|        multiple languages.\r\n\r\nb)\r\nSkipping one paragraph, the next one says:\r\n\r\n         The \"sdplang\" attribute value must be a single RFC 3066\r\n         language tag in US-ASCII [9].  It is not dependent on the\r\n         charset attribute.  An \"sdplang\" attribute SHOULD be specified\r\n|        when a session is of sufficient scope to cross geographic\r\n         boundaries where the language of recipients cannot be assumed,\r\n|        or where the session is in a different language from the\r\n         locally assumed norm.\r\n\r\nIt should say:\r\n\r\n         The \"sdplang\" attribute value must be a single RFC 3066\r\n         language tag in US-ASCII [9].  It is not dependent on the\r\n         charset attribute.  An \"sdplang\" attribute SHOULD be specified\r\n|        when a session description is of sufficient scope to cross\r\n         geographic boundaries where the language of recipients cannot\r\n|        be assumed, or where the session description is in a different\r\n         language from the locally assumed norm.\r\n\r\nc)\r\nNext, in the explanations for:\r\n\r\n      a=lang:<language tag>\r\n\r\nextending from page 29 to page 30,\r\n\r\n         This can be a session-level attribute or a media-level\r\n         attribute.  As a session-level attribute, it specifies the\r\n         default language for the session being described.  As a media-\r\n         level attribute, it specifies the language for that media,\r\n  <<page break>>\r\n         overriding any session-level language specified.  Multiple lang\r\n         attributes can be provided either at session or media level if\r\n|        the session description or media use multiple languages, in\r\n         which case the order of the attributes indicates the order of\r\n         importance of the various languages in the session or media\r\n         from most important to least important.\r\n\r\nshould be corrected to say:\r\n\r\n         This can be a session-level attribute or a media-level\r\n         attribute.  As a session-level attribute, it specifies the\r\n         default language for the session being described.  As a media-\r\n         level attribute, it specifies the language for that media,\r\n  <<page break>>\r\n         overriding any session-level language specified.  Multiple lang\r\n         attributes can be provided either at session or media level if\r\n|        the session or media use multiple languages, in which case the\r\n         order of the attributes indicates the order of importance of\r\n|        the various languages in the session or media, from most\r\n         important to least important.\r\n\r\n\r\n\r\n\r\nNote: In the meantime (since the publication of RFC 4566), RFC 3066\r\nhas been superseded by RFC 4646 plus RFC 4647, now together denoted\r\nas BCP 47.\r\n\r\n\r\n(12)  typo\r\n\r\nOn page 31, in the second paragraph of Section 7, RFC 4566 says:\r\n\r\n            [...].  Many different transport protocols may be used to\r\n   distribute session description, and the nature of the authentication\r\n   will differ from transport to transport.  [...]\r\n\r\nIt should say:\r\n\r\n            [...].  Many different transport protocols may be used to\r\n|  distribute session descriptions, and the nature of the authentication\r\n   will differ from transport to transport.  [...]\r\n\r\n\r\n(13)  SDP Grammar issues  (ABNF in Section 9, p. 39 ff.),\r\n\r\na)\r\nThe rule for 'repeat-interval'  (page 41)  could easily have\r\nre-used (incorporated) the 'integer' rule:\r\n\r\n   repeat-interval =     POS-DIGIT *DIGIT [fixed-len-time-unit]\r\n\r\nis equivalent to:\r\n\r\n   repeat-interval =     integer [fixed-len-time-unit]\r\n\r\nb)\r\nThe rule for FQDN, at the bottom of page 42, is wrong;\r\nFQDNs really should allow up to 255 characters!\r\n                         v\r\n|  FQDN =                4*(alpha-numeric / \"-\" / \".\")\r\n                         ; fully qualified domain name as specified\r\n                         ; in RFC 1035 (and updates)\r\n\r\nBecause details are not gived (can be found at other places),\r\nthis rule should perhaps be only minimally corrected to say:\r\n\r\n|  FQDN =                *(alpha-numeric / \"-\" / \".\")\r\n                         ; fully qualified domain name as specified\r\n                         ; in RFC 1035 (and updates)\r\n\r\n\r\nAt a minimum, serious issues should be addressed,\r\ne.g. (2), (10), (11), and the ABNF mistake (13b).",
    "correct_text": "",
    "notes": "from pending\r\n\r\n--VERIFIER COMMENT--\r\nWhile you raise a number of valid minor issues, I see nothing which\r\nneeds urgent attention or correction. I'll keep a record of these\r\nissues, to be included if there is a revision to RFC 4566, but I see\r\nno need to submit an errata note to the RFC Editor.\r\n",
    "submit_date": "2006-11-09",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": 99,
    "verifier_name": "Colin Perkins",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 1089,
    "doc-id": "RFC4566",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": 9,
    "orig_text": "IP6-multicast =       hexpart [ \"/\" integer ]\r\n\r\nIP6-address =         hexpart [ \":\" IP4-address ]\r\n\r\nhexpart =             hexseq / hexseq \"::\" [ hexseq ] /\r\n                              \"::\" [ hexseq ]\r\n\r\nhexseq  =             hex4 *( \":\" hex4)\r\n\r\nhex4    =             1*4HEXDIG",
    "correct_text": "IP6-multicast =       IP6-address [ \"/\" integer ]\r\n\r\nIP6-address =                                      6( h16 \":\" ) ls32\r\n                          /                       \"::\" 5( h16 \":\" ) ls32\r\n                          / [               h16 ] \"::\" 4( h16 \":\" ) ls32\r\n                          / [ *1( h16 \":\" ) h16 ] \"::\" 3( h16 \":\" ) ls32\r\n                          / [ *2( h16 \":\" ) h16 ] \"::\" 2( h16 \":\" ) ls32\r\n                          / [ *3( h16 \":\" ) h16 ] \"::\"    h16 \":\"   ls32\r\n                          / [ *4( h16 \":\" ) h16 ] \"::\"              ls32\r\n                          / [ *5( h16 \":\" ) h16 ] \"::\"              h16\r\n                          / [ *6( h16 \":\" ) h16 ] \"::\"\r\n\r\nh16 =                 1*4HEXDIG\r\n\r\nls32 =                ( h16 \":\" h16 ) / IP4-address",
    "notes": "Correct IPv6 ABNF.",
    "submit_date": "2007-12-06",
    "submitter_name": "Colin Perkins",
    "verifier_id": 107,
    "verifier_name": "Cullen Jennings",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 1795,
    "doc-id": "RFC4566",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": 9,
    "orig_text": "   decimal-uchar =       DIGIT\r\n                         / POS-DIGIT DIGIT\r\n                         / (\"1\" 2*(DIGIT))\r\n                         / (\"2\" (\"0\"/\"1\"/\"2\"/\"3\"/\"4\") DIGIT)\r\n                         / (\"2\" \"5\" (\"0\"/\"1\"/\"2\"/\"3\"/\"4\"/\"5\"))\r\n",
    "correct_text": "   decimal-uchar =       DIGIT\r\n                         / POS-DIGIT DIGIT\r\n                         / (\"1\" 2(DIGIT))\r\n                         / (\"2\" (\"0\"/\"1\"/\"2\"/\"3\"/\"4\") DIGIT)\r\n                         / (\"2\" \"5\" (\"0\"/\"1\"/\"2\"/\"3\"/\"4\"/\"5\"))\r\n",
    "notes": "The \"*\" is removed from the 3rd line.\r\n\r\nThe current RFC accepts any number starting with \"1\" and followed by\r\n2 or more digits (like 1000 or 123456789) as a valid \"decimal-uchar\"\r\nbecause of this error, because \"1\" 2*(DIGIT) means 2 or more digits\r\nfollowing a \"1\". The correction, 2(DIGIT) means *exactly* 2 digits\r\nfollowing a \"1\", which covers the range 100-199.",
    "submit_date": "2009-06-19",
    "submitter_name": "Leandro Lucarella",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 2517,
    "doc-id": "RFC4566",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": 5.14,
    "orig_text": "If the <proto> sub-field is \"RTP/AVP\" or \"RTP/SAVP\" the <fmt> \r\nsub-fields contain RTP payload type numbers.  When a list of \r\npayload type numbers is given, this implies that all of these \r\npayload formats MAY be used in the session, but the first of these \r\nformats SHOULD be used as the default format for the session.",
    "correct_text": "If the <proto> sub-field is \"RTP/AVP\" or \"RTP/SAVP\" the <fmt> \r\nsub-fields contain RTP payload type numbers.  When a list of \r\npayload type numbers is given, this implies that all of these \r\npayload formats MAY be used in the session, and these payload \r\nformats are listed in order of preference, with the first format listed \r\nbeing preferred; in that case the first acceptable payload format \r\nfrom the beginning of the list SHOULD be used for the session.",
    "notes": "The word ‘default‘ is improper here, because payload format is not implied, but explicitly indicated. This may lead to a misunderstanding and confusion.\r\nThe corrections are proposed in order to avoid confusion and to give complete clear instructions in case of multiple payload type numbers indicated.",
    "submit_date": "2010-09-13",
    "submitter_name": "Victor S. Osipov",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 3278,
    "doc-id": "RFC4566",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": 5,
    "orig_text": "At page 9:\r\n\r\n\r\n      Media description, if present\r\n         m=  (media name and transport address)",
    "correct_text": "\r\n      Media description, if present\r\n         m=* (media name and transport address)\r\n\r\n",
    "notes": "A '*' is added making \"m=\" lines optional\r\n\r\nRationale: \r\nThe description about media lines in section 5, page 9 is conflicting with the ABNF syntax of media-description in Section 9, page 40\r\n\r\nmedia-descriptions =  *( media-field\r\n                         information-field\r\n                         *connection-field\r\n                         bandwidth-fields\r\n                         key-field\r\n                         attribute-fields )\r\n\r\nAccording to the ABNF grammar, an SDP description can have zero \"m=\" lines, but according to the description at page 9, at least one line must be present.  Note that the conflict could be solved also by replacing the media-descriptions definition with \r\n\r\n   media-descriptions =  1*( media-field ... )\r\n\r\nbut at page 8 (still Section 5) it is said\r\n\r\n   An SDP session description consists of a session-level section\r\n   followed by zero or more media-level sections. ...\r\n               ^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\nso, I guess that the ABNF grammar is correct.\n --VERIFIER NOTES-- \n Please see the discussion at  http://www.ietf.org/mail-archive/web/mmusic/current/msg09398.html",
    "submit_date": "2012-07-03",
    "submitter_name": "Riccardo Bernardini",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 4769,
    "doc-id": "RFC4566",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "5.3.",
    "orig_text": "5.3.  Session Name (\"s=\")\r\n\r\n      s=<session name>\r\n\r\n   The \"s=\" field is the textual session name.  There MUST be one and\r\n   only one \"s=\" field per session description.  The \"s=\" field MUST NOT\r\n   be empty and SHOULD contain ISO 10646 characters (but see also the\r\n   \"a=charset\" attribute).  If a session has no meaningful name, the\r\n   value \"s= \" SHOULD be used (i.e., a single space as the session\r\n   name).\r\n",
    "correct_text": "5.3.  Session Name (\"s=\")\r\n\r\n      s=<session name>\r\n\r\n   The \"s=\" field is the textual session name.  There MUST be one and\r\n   only one \"s=\" field per session description.  The \"s=\" field MUST NOT\r\n   be empty and SHOULD contain ISO 10646 characters (but see also the\r\n   \"a=charset\" attribute).  If a session has no meaningful name, the\r\n   value \"s=-\" SHOULD be used (i.e., a single dash as the session\r\n   name).\r\n",
    "notes": "In 3rd paragraph of section 5. is written: whitespace MUST NOT be used on either side of the \"=\" sign, which is incosistent with subsection 5.3. Therefore I suggest to use \"-\" (single dash) instead of \" \" (single space) for sessions without meaningful name.\n --VERIFIER NOTES-- \n The mmusic working group is in the process of updating RFC 4566. If the issue applies to the updated text ( https://datatracker.ietf.org/doc/draft-ietf-mmusic-rfc4566bis/ ), please send comments to mmusic@ietf.org rather than file errata reports against RFC 4566.",
    "submit_date": "2016-08-08",
    "submitter_name": "Petr Vaněk",
    "verifier_id": 147,
    "verifier_name": "Ben Campbell",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 4903,
    "doc-id": "RFC4566",
    "errata_status_code": "Reported",
    "errata_type_code": "Editorial",
    "section": 9,
    "orig_text": "   ; SDP Syntax\r\n   session-description = proto-version\r\n                         origin-field\r\n                         session-name-field\r\n                         information-field\r\n                         uri-field\r\n                         email-fields\r\n                         phone-fields\r\n                         connection-field\r\n                         bandwidth-fields\r\n                         time-fields\r\n                         key-field\r\n                         attribute-fields\r\n                         media-descriptions\r\n\r\n   connection-field =    [%x63 \"=\" nettype SP addrtype SP\r\n                         connection-address CRLF]\r\n                         ;a connection field must be present\r\n                         ;in every media description or at the\r\n                         ;session-level\r\n\r\n   media-descriptions =  *( media-field\r\n                         information-field\r\n                         *connection-field\r\n                         bandwidth-fields\r\n                         key-field\r\n                         attribute-fields )\r\n",
    "correct_text": "   ; SDP Syntax\r\n   session-description = proto-version\r\n                         origin-field\r\n                         session-name-field\r\n                         information-field\r\n                         uri-field\r\n                         email-fields\r\n                         phone-fields\r\n                         [connection-field]\r\n                         bandwidth-fields\r\n                         time-fields\r\n                         key-field\r\n                         attribute-fields\r\n                         media-descriptions\r\n\r\n   connection-field =    %x63 \"=\" nettype SP addrtype SP\r\n                         connection-address CRLF\r\n                         ;a connection field must be present\r\n                         ;in every media description or at the\r\n                         ;session-level\r\n\r\n   media-descriptions =  *( media-field\r\n                         information-field\r\n                         *connection-field\r\n                         bandwidth-fields\r\n                         key-field\r\n                         attribute-fields )\r\n",
    "notes": "in BNF of SDP, \r\nconnection-field itself is optional [0, 1], but media-description has multiple [0,) connection-field.\r\nit seems conflict, because multiple of optional fields doesn't finish because multiple filed can't find when to end.\r\n\r\nso change connection-field itself not optional (remove []) and, replace session-descriptions connection-field as optional.",
    "submit_date": "2017-01-12",
    "submitter_name": "Jxck",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5183,
    "doc-id": "RFC4566",
    "errata_status_code": "Reported",
    "errata_type_code": "Editorial",
    "section": "6.  SDP Attr",
    "orig_text": " a=rtpmap:<payload type> <encoding name>/<clock rate> [/<encoding\r\n         parameters>]",
    "correct_text": " a=rtpmap:<payload type> <encoding name>/<clock rate>[/<encoding\r\n         parameters>]",
    "notes": "rtpmap requires format below\r\n\r\na=rtpmap:97 L16/8000\r\na=rtpmap:98 L16/11025/2\r\n\r\nno space between clock rate and optional parameter",
    "submit_date": "2017-11-14",
    "submitter_name": "no space before encoding parameter in rtpmap value",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5595,
    "doc-id": "RFC4566",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": 5,
    "orig_text": "An example SDP description is:\r\n\r\n      v=0\r\n      o=jdoe 2890844526 2890842807 IN IP4 10.47.16.5\r\n      s=SDP Seminar\r\n      i=A Seminar on the session description protocol\r\n      u=http://www.example.com/seminars/sdp.pdf\r\n      e=j.doe@example.com (Jane Doe)\r\n      c=IN IP4 224.2.17.12/127\r\n      t=2873397496 2873404696\r\n      a=recvonly\r\n      m=audio 49170 RTP/AVP 0\r\n      m=video 51372 RTP/AVP 99\r\n      a=rtpmap:99 h263-1998/90000",
    "correct_text": "An example SDP description is:\r\n\r\n      v=0\r\n      o=jdoe 2890844526 2890842807 IN IP4 10.47.16.5\r\n      s=SDP Seminar\r\n      i=A Seminar on the session description protocol\r\n      u=http://www.example.com/seminars/sdp.pdf\r\n      e=j.doe@example.com (Jane Doe)\r\n      c=IN IP4 224.2.17.12/127\r\n      a=recvonly\r\n      t=2873397496 2873404696\r\n      m=audio 49170 RTP/AVP 0\r\n      m=video 51372 RTP/AVP 99\r\n      a=rtpmap:99 h263-1998/90000",
    "notes": "In section 5 it indicates that the SDP lines MUST appear in the exact order given at the top of Page 9.\r\nThe order that is shown indicates that the Session Attributes  appear before the Time Description.\r\n\r\nHowever in the example included in this section which explains that Media Attributes have precedence over Session Attributes for a media stream  contradicts the order as the  Session Attribute of sendonly is included below the  Time Description.\r\n\r\nEither the example is incorrect, or the normative description is poorly explained and some variability in the order of lines in the SDP is allowed.",
    "submit_date": "2019-01-08",
    "submitter_name": "Gavin Scallan",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 6022,
    "doc-id": "RFC4566",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": 9,
    "orig_text": "   ; sub-rules of 'e=', see RFC 2822 for definitions\r\n   email-address        = address-and-comment / dispname-and-address\r\n                          / addr-spec\r\n   address-and-comment  = addr-spec 1*SP \"(\" 1*email-safe \")\"\r\n   dispname-and-address = 1*email-safe 1*SP \"<\" addr-spec \">\"\r\n\r\n   ; sub-rules of 'p='\r\n   phone-number =        phone *SP \"(\" 1*email-safe \")\" /\r\n                         1*email-safe \"<\" phone \">\" /\r\n                         phone",
    "correct_text": "   ; sub-rules of 'e=', see RFC 2822 for definitions\r\n   email-address        = address-and-comment / dispname-and-address\r\n                          / addr-spec\r\n   address-and-comment  = addr-spec 1*SP \"(\" 1*email-safe \")\"\r\n   dispname-and-address = 1*email-safe 1*SP \"<\" addr-spec \">\"\r\n\r\n   ; sub-rules of 'p='\r\n   phone-number =        phone *SP \"(\" 1*email-safe \")\" /\r\n                         1*email-safe 1*SP \"<\" phone \">\" /\r\n                         phone",
    "notes": "There's an inconsistency between the definitions of dispname-and-address and phone-number. I am not sure if this is intentional or not, and in practice this doesn't change what's matched (as email-safe includes spaces), but I thought it'd be worth mentioning since I myself got tripped up when translating the grammar.\r\n\r\nAlternatively, perhaps 1*SP should be removed from dispname-and-address.",
    "submit_date": "2020-03-16",
    "submitter_name": "Megan Ruggiero",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": null
  }
]
