[
  {
    "errata_id": "958",
    "doc-id": "RFC4779",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "",
    "orig_text": "(1)  Section 5.2 -- bad acronym expansion\r\n\r\nWithin Section 5.2, bullet B. on page 11 says:\r\n\r\n   B.  Problems with IPv6 Neighbor Discovery (ND) on CM and CMTS.  In\r\n|      IPv4, these devices rely on Internet Group Multicast Protocol\r\n       (IGMP) join messages to track membership of hosts that are part\r\n       of a particular IP multicast group.  [...]\r\n\r\nIt should say:\r\n\r\n   B.  Problems with IPv6 Neighbor Discovery (ND) on CM and CMTS.  In\r\n|      IPv4, these devices rely on Internet Group Management Protocol\r\n       (IGMP) join messages to track membership of hosts that are part\r\n       of a particular IP multicast group.  [...]\r\n\r\n\r\n(2)  Section 5.2.1.3 -- typo / missing article\r\n\r\nThe first paragraph of Section 5.2.1.3, on top of page 14 says:\r\n\r\n                                                 [...].  In order to do\r\n   that, the CM and CMTS must forward Neighbor Discovery (ND) packets\r\n|  between ER and the hosts attached to the CM.\r\n          ^\r\nIt should say:\r\n\r\n                                                 [...].  In order to do\r\n   that, the CM and CMTS must forward Neighbor Discovery (ND) packets\r\n|  between the ER and the hosts attached to the CM.\r\n          ^^^^^\r\n\r\n\r\n(3)  Section 5.2.1.4 -- typo / missing article\r\n\r\nThe first paragraph of Section 5.2.1.4, on mid-page 14 says:\r\n\r\n                    [...].  If there is a GWR present, it will also use\r\n|  static default route to the ER.\r\n\r\nIt should say:\r\n\r\n                    [...].  If there is a GWR present, it will also use\r\n|  a static default route to the ER.\r\n   ^^\r\n\r\n\r\n(4)  Section 5.2.2 -- typo / missing article\r\n\r\nOn page 15, the text for scenario #2 says:\r\n\r\n   [...]\r\n   This scenario is also easy to deploy since the cable operator just\r\n|  needs to add GWR at the customer site.\r\n               ^\r\nIt should say:\r\n\r\n   [...]\r\n   This scenario is also easy to deploy since the cable operator just\r\n|  needs to add a GWR at the customer site.\r\n               ^^^\r\n\r\n\r\n(5)  Section 5.2.2.2.3 -- wrong article\r\n\r\nOn page 18, the second paragraph of Section 5.2.2.2.3 says:\r\n\r\n   The GWR will use its IPv4 address to source the tunnel to the ER.\r\n|  The tunnel endpoint will be the IPv4 address of the ER.  [...]\r\n                               ^^^\r\nIt should say:\r\n\r\n   The GWR will use its IPv4 address to source the tunnel to the ER.\r\n|  The tunnel endpoint will be an IPv4 address of the ER.  [...]\r\n                               ^^\r\n\r\nRationale:\r\n  Since IP addresses usually identify *interfaces* and routers\r\n  presumably have more than one IP interface, it is improper\r\n  to talk about *the* IP address of a router.\r\n\r\n\r\n(6)  Section 5.2.2.3 -- improper text in figure ?\r\n\r\nOn page 19, Figure 5.2.2.3 is:\r\n\r\n                           +-----------+   +-------------+\r\n     +-----+  +-------+    |   Cable   |   | CMTS / Edge |\r\n     |Host |--|  CM   |----|  (HFC)    |---|             |=>ISP\r\n     +-----+  +-------+    |  Network  |   |   Router    | Network\r\n                           +-----------+   +-------------+\r\n\r\n|    |-------||---------------------------||---------------|\r\n|     IPv4/v6              IPv4/v6              IPv4/v6\r\n\r\nBecause all parts of the network shown are dual-stack, it makes\r\nno sense to show two boundaries between similar regions.\r\nHence, the figure should better be:\r\n\r\n                           +-----------+   +-------------+\r\n     +-----+  +-------+    |   Cable   |   | CMTS / Edge |\r\n     |Host |--|  CM   |----|  (HFC)    |---|             |=>ISP\r\n     +-----+  +-------+    |  Network  |   |   Router    | Network\r\n                           +-----------+   +-------------+\r\n\r\n|    |-----------------------------------------------------|\r\n|                          IPv4/v6\r\n\r\n\r\n(7)  Section 5.2.2.5.2\r\n\r\nThe first paragraph of Section 5.2.2.5.2, at the bottom of page 22,\r\nsays:\r\n\r\n   Since the CM/GWR is dual stack, it can receive an IPv4 or IPv6\r\n   address using DHCP for management purposes.  As the GWR functionality\r\n|  is embedded in the CM, it will need an IPv6 address for forwarding\r\n   data traffic.  IPv6 address assignment for the CM/GWR and host can be\r\n   done via DHCPv6 or DHCP-PD.\r\n\r\nApparently, to be able to *forward* IPv6 traffic, the GWR needs at least\r\ntwo IPv6 addresses.  Therefore, the RFC should perhaps better say:\r\n\r\n   Since the CM/GWR is dual stack, it can receive an IPv4 or IPv6\r\n   address using DHCP for management purposes.  As the GWR functionality\r\n|  is embedded in the CM, it will need IPv6 addresses for forwarding\r\n   data traffic.  IPv6 address assignment for the CM/GWR and host can be\r\n   done via DHCPv6 or DHCP-PD.\r\n\r\n\r\n(8)  Section 5.2.3 -- missing articles\r\n\r\nThe first paragraph of Section 5.2.3 says, at the top of page 24:\r\n\r\n                          [...].  MLDv2 is almost identical to IGMPv3\r\n|  and also supports ASM (Any-Source Multicast) and SSM (Source-Specific\r\n   Multicast) service models.\r\n\r\nIt should say:\r\n\r\n                          [...].  MLDv2 is almost identical to IGMPv3\r\n|  and also supports the ASM (Any-Source Multicast) and the SSM (Source-\r\n   Specific Multicast) service models.\r\n\r\n\r\n(9)  Section 6.2.1.2 -- typo\r\n\r\nOn page 30, the bullet B. within Section 6.2.1.2 says:\r\n\r\n             v\r\n       The later option allows it to contact a remote DHCPv6 server, if\r\n       needed.  [...]\r\n\r\nIt should say:\r\n             vv\r\n|      The latter option allows it to contact a remote DHCPv6 server, if\r\n       needed.  [...]\r\n\r\n\r\n(10)  Section 6.2.2 -- typo\r\n\r\nIn the last paragraph on page 31, Section 6.2.2 says:\r\n\r\n                                 v\r\n|  This solution scales better then the Point-to-Point, but since there\r\n   is only one PPP session per ATM PVC, the subscriber can choose a\r\n   single ISP service at a time.\r\n\r\nIt should say:\r\n                                 v\r\n|  This solution scales better than the Point-to-Point, but since there\r\n   is only one PPP session per ATM PVC, the subscriber can choose a\r\n   single ISP service at a time.\r\n\r\n\r\n(11)  Section 6.3 -- clarity\r\n\r\nThe last paragraph of Section 6.3 (second paragraph on page 39) says:\r\n\r\n   This facilitates the deployment of multicast services.  The\r\n   discussion of this section applies to all the multicast sections in\r\n|  the document.\r\n     ^\r\nIt should say:\r\n\r\n   This facilitates the deployment of multicast services.  The\r\n   discussion of this section applies to all the multicast sections in\r\n|  this document.\r\n     ^^\r\n\r\n(12)  Section 6.3.1 -- grammar / typos\r\n\r\nThe first paragraph of Section 6.3.1, on page 39, says:\r\n      v\r\n|  Any Source Multicast (ASM) is useful for Service Providers that\r\n   intend to support the forwarding of multicast traffic of their\r\n   customers.  It is based on the Protocol Independent Multicast -\r\n   Sparse Mode (PIM-SM) protocol and it is more complex to manage\r\n   because of the use of Rendezvous Points (RPs).  With IPv6, static RP\r\n|  and Bootstrap Router [BSR] can be used for RP-to-group mapping\r\n   similar to IPv4.  [...]\r\n\r\nIt should say:\r\n      v\r\n|  Any-Source Multicast (ASM) is useful for Service Providers that\r\n   intend to support the forwarding of multicast traffic of their\r\n   customers.  It is based on the Protocol Independent Multicast -\r\n   Sparse Mode (PIM-SM) protocol and it is more complex to manage\r\n   because of the use of Rendezvous Points (RPs).  With IPv6, static RP\r\n|  and Bootstrap Routers [BSR] can be used for RP-to-group mapping\r\n   similar to IPv4.  [...]\r\n\r\nAlternatively, the last sentence above could be reworded to say:\r\n\r\n   because of the use of Rendezvous Points (RPs).  With IPv6, static RP\r\n|  and the Bootstrap Router protocol [BSR] can be used for RP-to-group\r\n   mapping similar to IPv4.  [...]\r\n\r\n\r\n(13)  Section 8.1 -- multiple flaws\r\n\r\nNear the end of the first paragraph on page 56, Section 8.1 says:\r\n\r\n              [...].  The AP forwards all the packets coming to/from\r\n|  host to the Edge Router.  The underlying connection between the AP\r\n|  and Edge Router could be based on any access layer technology such as\r\n   HFC/Cable, FTTH, xDSL, etc.\r\n\r\nIt should say:\r\n\r\n              [...].  The AP forwards all the packets coming to/from\r\n|  hosts to the Edge Router.  The underlying connection between the AP\r\n|  and the Edge Router could be based on any access layer technology\r\n   such as HFC/Cable, FTTH, xDSL, etc.\r\n\r\nIn the second paragraph on page 56, Section 8.1 says:\r\n\r\n|                [...].  In most of the cases, SP assigns a limited\r\n   number of public IP addresses to its customers.  [...]\r\n\r\nIt should say:\r\n                                               vvvv\r\n|                [...].  In most of the cases, the SP assigns a limited\r\n   number of public IP addresses to its customers.  [...]\r\n\r\nAt the end of the section (near the bottom of page 56), the RFC says:\r\n\r\n|  A. Layer 2 NAP with Layer 3 termination at NSP Edge Router\r\n\r\n|  B. Layer 3 aware NAP with Layer 3 termination at Access Router\r\n\r\nIt should say either:\r\n\r\n|  A. Layer 2 NAP with Layer 3 termination at an NSP Edge Router\r\n\r\n|  B. Layer 3 aware NAP with Layer 3 termination at an Access Router\r\n\r\nor:\r\n\r\n|  A. Layer 2 NAP with Layer 3 termination at NSP Edge Routers\r\n\r\n|  B. Layer 3 aware NAP with Layer 3 termination at Access Routers\r\n\r\n\r\n(14)  Section 8.1.1 -- grammar\r\n\r\nThe first paragraph of Section 8.1.1, at the bottom of page 56, says:\r\n\r\n   When a Layer 2 switch is present between AP and Edge Router, the AP\r\n|  and Layer 2 switch continues to work as a bridge, forwarding IPv4 and\r\n   IPv6 packets from WLAN Host/Router to Edge Router and vice versa.\r\n\r\nIt should say:\r\n\r\n   When a Layer 2 switch is present between AP and Edge Router, the AP\r\n|  and Layer 2 switch continue to work as a bridge, forwarding IPv4 and\r\n   IPv6 packets from WLAN Host/Router to Edge Router and vice versa.\r\n\r\n\r\n(15)  Section 8.1.2\r\n\r\nOn page 59, the second paragraph of Section 8.1.2 says:\r\n\r\n   When the WLAN Host initiates the connection, the AAA authentication\r\n|  and association process with WLAN AP will be similar, as explained in\r\n   Section 8.1.1.\r\n                               ^                       ^\r\nIt should say:\r\n\r\n   When the WLAN Host initiates the connection, the AAA authentication\r\n|  and association process with the WLAN AP will be similar as explained\r\n   in Section 8.1.1.\r\n                               ^^^^^                       ^\r\n\r\n(16)  Section 8.1.2.2 -- clarification needed\r\n\r\nOn page 60, bullet C. of Section 8.1.2.2 says:\r\n\r\n       vv                                                             vv\r\n|  C.  It can use its link-local address to communicate with the ER.  It\r\n       can also dynamically acquire through stateless auto-configuration\r\n       the address for the link between itself and the ER.  [...]\r\n\r\nThe double \"it\" is unclear and inprecise.  (The immediately preceding\r\nsentences refer to three different entities, the DHCP server, the\r\nAccess Router, and the Edge Router -- which one is \"it\" ?)\r\n\r\nPresumably, it was intended to refer to the Access Router, and not to\r\nthe AAA Server, but -- according to Figure 8.1.2 -- only the latter\r\npotentially has a common link with the ER and hence can use link-local\r\naddresses, whereas the AR is connected to the ER via the Access\r\nProvider Network that might comprise multiple IP hops on the route\r\nfrom AR to ER.\r\n\r\nIt should say (text provided by Adeel):\r\n\r\nThe Access Router can dynamically acquire through stateless address auto-configuration the address for the link between itself and the ER. This step is followed by a request via DHCP-PD for a\r\n+prefix shorter than /64 that in turn is divided in /64s and assigned to its interfaces connecting the hosts on the customer site.\r\n\r\n\r\n(17)  Section 8.1.2.3 -- missing article\r\n\r\nThe last paragraph of Section 8.1.2.3, on mid-page 61, says:\r\n\r\n   If the Access Router is owned by the SP, then the Access Router will\r\n|  also run IPv6 IGP, and will be part of the SP IPv6 routing domain\r\n   (OSPFv3 or IS-IS).  [...]\r\n\r\nIt should say:\r\n\r\n   If the Access Router is owned by the SP, then the Access Router will\r\n|  also run an IPv6 IGP, and will be part of the SP IPv6 routing domain\r\n   (OSPFv3 or IS-IS).  [...]\r\n\r\n\r\n(18)  Section 8.1.3 -- missing articles\r\n\r\nSection 8.1.3, near the bottom of page 61, says:\r\n\r\n   PPP Terminated Aggregation (PTA) and L2TPv2 Access Aggregation (LAA)\r\n   models, as discussed in Sections 6.2.2 and 6.2.3, respectively, can\r\n   also be deployed in IPv6 WLAN environment.\r\n\r\nIt should say:\r\n\r\n|  The PPP Terminated Aggregation (PTA) and L2TPv2 Access Aggregation\r\n   (LAA) models, as discussed in Sections 6.2.2 and 6.2.3, respectively,\r\n|  can also be deployed in an IPv6 WLAN environment.\r\n\r\n\r\n(19)  Section 8.1.3.1 -- missing articles\r\n\r\nAt the bottom of page 61, the first paragraph Section 8.1.3.1 says:\r\n                                   v\r\n|  While deploying the PTA model in IPv6 WLAN environment, the Access\r\n   Router is Layer 3 aware and it has to be upgraded to support IPv6.\r\n\r\nIt should say:\r\n                                   vvvv\r\n|  While deploying the PTA model in an IPv6 WLAN environment, the Access\r\n   Router is Layer 3 aware and it has to be upgraded to support IPv6.\r\n\r\nThe bottom line on page 61,\r\n                                            v\r\n|  Figure 8.1.3.1 describes the PTA Model in IPv6 WLAN environment.\r\n\r\nshould say:\r\n                                            vvvv\r\n|  Figure 8.1.3.1 describes the PTA Model in an IPv6 WLAN environment.\r\n\r\nAlternatively, \"the\" could be inserted in place of \"an\", in both cases.\r\n\r\n\r\n(20)  Section 8.1.3.2\r\n\r\nOn page 62, the literally same changes as presented in item (19)\r\nshould be applied as well.\r\n\r\n\r\n(21)  Section 8.2 -- multiple grammar issues\r\n\r\nThe first paragraph on top of page 64 says:\r\n\r\n                                  vvvvv\r\n|  It is important to note that in the shared wireless environments,\r\n   multicast can have a significant bandwidth impact.  [...]\r\n\r\nIt should say:\r\n                                  v\r\n|  It is important to note that in shared wireless environments,\r\n   multicast can have a significant bandwidth impact.  [...]\r\n\r\nThe second paragraph on page 64 says:\r\n\r\n                          vvvvvv\r\n|  The IPv6 WLAN Hosts can also join desired multicast groups as long as\r\n   they are enabled to support MLDv1 or MLDv2.  [...]\r\n\r\nIt should say:\r\n                          v\r\n|  The IPv6 WLAN Hosts can join desired multicast groups as long as they\r\n   are enabled to support MLDv1 or MLDv2.  [...]\r\n\r\n(Rationale:\r\n \"also\" lacks similar context in preceding that might be resumed here.)\r\n\r\nThe third paragraph on page 64 says:\r\n                                        vvvvv\r\n|                [...].  The Edge Router has also needs to be enabled\r\n|  for PIM-SSM in order to receive joins from IPv6 WLAN Hosts or WLAN/\r\n   Access Router (if present), and send joins towards the SP core.\r\n\r\nIt should say:\r\n                                        v\r\n|                [...].  The Edge Router also needs to be enabled for\r\n|  PIM-SSM in order to receive joins from IPv6 WLAN Hosts or the WLAN/\r\n   Access Router (if present), and send joins towards the SP core.\r\n\r\nThe sixth paragraph on page 64 says:\r\n                                    vvvvv\r\n|  This problem is inherited by WLAN that can impact both IPv4 and IPv6\r\n   multicast packets; it is not specific to IPv6 multicast.\r\n\r\nIt should say:\r\n                                    vvvvv\r\n|  This problem is inherited by WLANs and can impact both IPv4 and IPv6\r\n   multicast packets; it is not specific to IPv6 multicast.\r\n\r\nFinally, the last paragraph on page 64 says:\r\n                       v\r\n|  While deploying WLAN (IPv4 or IPv6), one should adjust their\r\n   broadcast/multicast settings if they are in danger of dropping\r\n   application dependent frames.  [...]\r\n\r\nIt should say:\r\n                       vv\r\n|  While deploying WLANs (IPv4 or IPv6), one should adjust their\r\n   broadcast/multicast settings if they are in danger of dropping\r\n   application dependent frames.  [...]\r\n\r\n\r\n(22)  Section 8.3 -- improper article\r\n\r\nThe third paragraph of Section 8.3, on mid-page 65 says:\r\n\r\n        [...]  The same IPv4 QoS concepts and methodologies should be\r\n|  applied for the IPv6 as well.\r\n              ^^^^^\r\nIt should say:\r\n\r\n        [...]  The same IPv4 QoS concepts and methodologies should be\r\n|  applied for IPv6 as well.\r\n              ^\r\n\r\n(23)  Section 8.4 -- word twister\r\n\r\nThe first paragraph of Section 8.4, near the bottom of page 65, says:\r\n\r\n                                                  vvvvvvvvvvvvvvvvv\r\n|  There are limited changes that have to be done for WLAN the Host/\r\n   Router in order to enhance security.  [...]\r\n\r\nIt should say:\r\n                                                  vvvvvvvvvvvvvvvvv\r\n|  There are limited changes that have to be done for the WLAN Host/\r\n   Router in order to enhance security.  [...]\r\n\r\n\r\n(24)  Section 10\r\n\r\nThe last sub-item of item (21) above recurs in Section 10.\r\nAt the end of bullet E. , near the bottom of page 72, the RFC says:\r\n\r\n                        vvvvv\r\n                                            [...].  This problem is\r\n|      inherited by WLAN that can impact both IPv4 and IPv6 multicast\r\n       packets; it is not specific to IPv6 multicast.\r\n\r\nIt should say:\r\n                        vvvvv\r\n                                            [...].  This problem is\r\n|      inherited by WLANs and can impact both IPv4 and IPv6 multicast\r\n       packets; it is not specific to IPv6 multicast.\r\n",
    "correct_text": "[see above]",
    "notes": "Authors verified changes.  Did not split into multiple items.\r\n\r\nfrom pending.",
    "submit_date": "2007-05-14",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": "2",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  }
]
