[
  {
    "errata_id": 56,
    "doc-id": "RFC4567",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "99The abstract says:",
    "orig_text": "   General guidelines are also given on how the framework should be used\r\n   together with SIP and RTSP.  The usage with the Multimedia Internet\r\n   KEYing (MIKEY) key management protocol is also defined.",
    "correct_text": "   General guidelines are also given on how the framework should be used\r\n   together with SIP and SAP.  The usage with the Multimedia Internet\r\n   KEYing (MIKEY) key management protocol is also defined.",
    "notes": " As can be seen from the title and the body of the RFC, and\r\nas has been correctly stated in the first paragraph of the Abstract,\r\nthe RFC primarily deals with SDP and RTSP; it \"also\" considers the use\r\nof the SDP extensions with SIP (Section 4.1.2) and SAP (Section 4.1.3).\r\nHence, SAP should be mentioned in the second paragraph of the Abstract\r\ninstead of RTSP.",
    "submit_date": "2006-11-01",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 809,
    "doc-id": "RFC4567",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": 99,
    "orig_text": "(1) [[posted separately.]]\r\n \r\n(2)  inappropriate text (cut&paste error?)\r\n\r\nOn page 6, the explanation below the ABNF in Section 3.2 says:\r\n\r\n   where KMPID is as defined in Section 3 of this memo, \"base64\" as\r\n   defined in [SDPnew], and \"URI\" as defined in Section 3 of [RFC3986].\r\n\r\nIt should say:\r\n\r\n   where KMPID is as defined in Section 3 of this memo and \"URI\" as\r\n   defined in Section 3 of [RFC3986].\r\n\r\nRationale: \"base64\" does not appear in the ABNF of Section 3.2 !\r\n\r\n\r\n(3)  incomplete sentence\r\n\r\nThe first paragraph of Section 4.1.1, on page 8, says:\r\n\r\n   The processing when SDP is used is slightly different according to\r\n   the way SDP is transported, and if it uses an offer/answer or\r\n   announcement.  The processing can be divided into four different\r\n   steps:\r\n\r\nIt should say:\r\n\r\n   The processing when SDP is used is slightly different according to\r\n   the way SDP is transported, and if it uses an offer/answer or\r\n|  announcement model.  The processing can be divided into four\r\n   different steps:\r\n\r\n\r\n(4)  misleading word omission\r\n\r\nWithin Section 5.4, the explanation at top of page 21,\r\n\r\n   Each RTSP header is inserted in the SETUP related to the audio and\r\n   video separately:\r\n\r\nshould be clarified to say:\r\n\r\n|  A key management RTSP header is inserted in the SETUP related to the\r\n   audio and video separately:\r\n\r\n\r\n(5)  suspected inconsistency\r\n\r\nThe last paragraph of Section 7, on page 22, says:\r\n\r\n   The server will need to be able to know the identity of the client\r\n   before creating and sending a MIKEY message.  [...]\r\n\r\nIMHO, it is not clear how this fits with the text on page 14.\r\nPerhaps, a 3-way handshake with client auth in DESCRIBE could\r\nbe considered.\r\n\r\n\r\n(6)  inconsistency between ABNF and IANA registrations\r\n\r\nPerhaps, a late change to the ABNF in the body of the RFC has lead\r\nto inconsistencies in the filled out IANA registration templates\r\nas presented in Section 9.1 and 9.3; in particular, the hypothetical\r\nattribute name \"key-mgmt-att-field\" referred to in fact should be just\r\n\"key-mgmt\"; \"key-mgmt-att-field\" is the name of the ABNF production\r\nrule (introduced in  Section 3.1) for this literal; in the template\r\nthe literal name of the attribute is needed.\r\n\r\nTherefore:\r\n\r\nIn Section 9.1, near the bottom of page 25, change\r\n\r\n      SDP Attribute Field (\"att-field\"):\r\n\r\n        Name:               key-mgmt-att-field\r\n\r\nto say:\r\n\r\n      SDP Attribute Field (\"att-field\"):\r\n\r\n        Name:               key-mgmt\r\n\r\nand in Section 9.3, on page 26, change\r\n\r\n   Purpose:        Usage of MIKEY with the key-mgmt-att-field\r\n                    attribute and the keymgmt RTSP header\r\n\r\nto say:\r\n\r\n|  Purpose:        Usage of MIKEY with the key-mgmt SDP attribute\r\n                    and the keymgmt RTSP header\r\n\r\n[ I also have added \"SDP\" for additional clarification. ]\r\n\r\n\r\n(7)  missing articles\r\n\r\nThe first paragraph of the Abstract, on page 1 of RFC 4567, says:\r\n\r\n   This document defines general extensions for Session Description\r\n   Protocol (SDP) and Real Time Streaming Protocol (RTSP) to carry\r\n   messages, as specified by a key management protocol, in order to\r\n   secure the media.  [...]\r\n\r\nIt should say:\r\n\r\n|  This document defines general extensions for the Session Description\r\n|  Protocol (SDP) and the Real Time Streaming Protocol (RTSP) to carry\r\n   messages, as specified by a key management protocol, in order to\r\n   secure the media.  [...]\r\n\r\n\r\n(8)  missing article\r\n\r\nNear the top of page 7, the paragraph,\r\n\r\n   We define one new RTSP status code to report error due to any failure\r\n   during the key management processing (Section 4.2):\r\n\r\nshould say:\r\n\r\n|  We define one new RTSP status code to report an error due to any\r\n   failure during the key management processing (Section 4.2):\r\n\r\n\r\n(9)  missing article\r\n\r\nWithin Section 4.2, the last bullet on page 15 says:\r\n\r\n   * Key management responses for the initial establishment of security\r\n     parameters for an individual media SHALL only be included in SETUP\r\n     for the corresponding media stream.\r\n\r\nIt should say:\r\n\r\n   * Key management responses for the initial establishment of security\r\n|    parameters for an individual media SHALL only be included in the\r\n     SETUP for the corresponding media stream.\r\n\r\n\r\n(10)  typo (singular/plural mismatch)\r\n\r\nWithin Section 5.2, the explanation of the example, in the lower\r\nhalf of page 19,\r\n\r\n   The client checks the validity of the received MIKEY message, and, in\r\n   case of successful verification, it accept the message.  [...]\r\n\r\nshould say:\r\n\r\n   The client checks the validity of the received MIKEY message, and, in\r\n|  case of successful verification, it accepts the message.  [...]",
    "correct_text": "",
    "notes": "from pending",
    "submit_date": "2006-11-01",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 2247,
    "doc-id": "RFC4567",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": 3.2,
    "orig_text": "key-mgmt-spec = \"prot\" \"=\" KMPID \";\" [\"uri\" \"=\" %22 URI %22 \";\"] ",
    "correct_text": "key-mgmt-spec = \"prot\" \"=\" KMPID \";\" [\"uri\" \"=\" %22 URI %22 \";\"] [\"data\" \"=\" %22 base64 %22 \";\"]",
    "notes": "There is an inconsistency between the ABNF for key-mgmt-spec on page 6 and the two SETUP examples on top of page 21.  In both examples a field data=\"...\" is present in the keymgmt header, but the ABNF on page 6 does not allow for it.  The suggested correction solves the inconsistency.\r\n\r\n\r\n--- From reviewer Dale Worley --\r\nThe grammar needs additional work because key-mgmt-spec is not\r\ncorrectly attached to the original ABNF, and the production provided\r\ndoes not allow the parameters to appear in any order.  In addition,the\r\nterminating CRLF is not shown in the ABNF.  A more correct version is:\r\n\r\n  extension-header =/ KeyMgmt\r\n(Is this the correct nonterminal to extend?  RFC 4567 section 3.2 does\r\nnot make it clear what sort of header \"KeyMgmt\" is.)\r\n\r\n  KeyMgmt = \"KeyMgmt\" \":\" key-mgmt-spec 0*(\",\" key-mgmt-spec) CRLF\r\n\r\n  key-mgmt-spec = \"prot\" \"=\" KMPID 0*(key-mgmt-spec-param)\r\n\r\n  key-mgmt-spec-param = \";\" \"uri\" \"=\" %22 URI %22\r\n                      / \";\" \"data\" \"=\" %22 base64 %22\r\n\r\nThe whole situation is troublesome because the RFC does not make it\r\nclear to what degree the 'prot', 'uri', and 'data' elements are\r\nrequired to be in a certain order.  Given that many headers are copied\r\nfrom HTTP, the implication is that the first element (that is,\r\n\"prot=KMPID\") must appear in the first position, but the following\r\nelements (\"uri\" and \"data\") may be in any order.  But current practice\r\nmay have de-facto standardized a different rule.  We need some input\r\nfrom someone who is familiar with current practice.\r\n\r\n------\r\nThe MMUSIC WG list was polled and the responses were that allowing these parameters to appear in any order was an acceptable technical solution.\r\n",
    "submit_date": "2010-05-06",
    "submitter_name": "Riccardo Bernardini",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  }
]
