[
  {
    "errata_id": "833",
    "doc-id": "RFC4778",
    "errata_status_code": "Rejected",
    "errata_type_code": "Editorial",
    "section": "",
    "orig_text": "(2)  Section 2.1.2 -- typo\r\n\r\nThe final paragraph of Section 2.1.2, on page 9, says:\r\n\r\n|  How ISPs manage these logins vary greatly, although many of the\r\n   larger ISPs employ some sort of AAA mechanism to help automate\r\n   privilege-level authorization and utilize the automation to bypass\r\n   the need for a second authentication step.  [...]\r\n\r\nIt should say:\r\n                                   vvv\r\n|  How ISPs manage these logins varies greatly, although many of the\r\n   larger ISPs employ some sort of AAA mechanism to help automate\r\n   privilege-level authorization and utilize the automation to bypass\r\n   the need for a second authentication step.  [...]\r\n\r\n\r\n(3)  Section 2.2 -- typo\r\n\r\nThe first paragraph of Section 2.2, on page 10, says:\r\n\r\n                         [...].  Note that while many of the security\r\n   concerns and practices are the same for OOB management and in-band\r\n   management, most ISPs prefer an OOB management system, since access\r\n|  to the devices that make up this management network are more\r\n   vigilantly protected and considered to be less susceptible to\r\n   malicious activity.\r\n\r\nIt should say:\r\n\r\n                         [...].  Note that while many of the security\r\n   concerns and practices are the same for OOB management and in-band\r\n   management, most ISPs prefer an OOB management system, since access\r\n|  to the devices that make up this management network is more\r\n   vigilantly protected and considered to be less susceptible to\r\n   malicious activity.\r\n\r\n\r\n(4)  Section 2.2.2 -- typo, and mis-wording\r\n\r\n(4a)\r\nWithin Section 2.2.2, the 4th paragraph on page 13 says:\r\n\r\n                                             [...].  Most large ISPs\r\n   have multiple SNMP systems accessing their routers so it takes more\r\n|  then one maintenance period to get all the strings fixed in all the\r\n   right systems.  SNMP RW is not used and is disabled by configuration.\r\n     ^\r\nIt should say:\r\n\r\n                                             [...].  Most large ISPs\r\n   have multiple SNMP systems accessing their routers so it takes more\r\n|  than one maintenance period to get all the strings fixed in all the\r\n   right systems.  SNMP RW is not used and is disabled by configuration.\r\n\r\n(4b)\r\nThe next (5th) paragraph on page 13 says:\r\n\r\n   Access control is strictly enforced for infrastructure devices by\r\n|  using stringent filtering rules.  A limited set of IP addresses are\r\n   allowed to initiate connections to the infrastructure devices and are\r\n|  specific to the services to which they are to limited (i.e., SSH and\r\n   SNMP).\r\n                                             ^^^^\r\nI suspect that it was intended to say:\r\n\r\n   Access control is strictly enforced for infrastructure devices by\r\n|  using stringent filtering rules.  A limited set of IP addresses is\r\n|  allowed to initiate connections to the infrastructure devices, and\r\n|  these addresses are specifically limited to the respective services\r\n|  (i.e., SSH and SNMP).\r\n\r\n(or use similar wording).\r\n\r\n\r\n(5)  Section 2.2.3 -- word twister\r\n\r\nIn Section 2.2.3, on page 15, the 3rd bullet says:\r\n\r\n   o  Data Origin Authentication - Management traffic is strictly\r\n      filtered to allow only specific IP addresses to have access to the\r\n|     infrastructure devices.  This does not alleviate risk the from\r\n      spoofed traffic, although when combined with edge filtering using\r\n      BCP38 [RFC2827] and BCP84 [RFC3704] guidelines (discussed in\r\n      Section 2.5), then the risk of spoofing is mitigated, barring a\r\n      compromised internal system.  [...]\r\n\r\nIt should say:\r\n\r\n   o  Data Origin Authentication - Management traffic is strictly\r\n      filtered to allow only specific IP addresses to have access to the\r\n|     infrastructure devices.  This does not alleviate the risk from\r\n      spoofed traffic, although when combined with edge filtering using\r\n      BCP38 [RFC2827] and BCP84 [RFC3704] guidelines (discussed in\r\n      Section 2.5), then the risk of spoofing is mitigated, barring a\r\n      compromised internal system.  [...]\r\n\r\n\r\n(6)  Section 2.3 -- typo\r\n\r\nThe 1st sentence of Section 2.3, on top of page 16, says:\r\n\r\n   This section refers to how traffic is handled that traverses the\r\n|  network infrastructure device.  [...]\r\n\r\nIt should say:\r\n\r\n   This section refers to how traffic is handled that traverses the\r\n|  network infrastructure devices.  [...]\r\n                                ^\r\n\r\n(7)  Section 2.3.4 -- typo\r\n\r\nThe last paragraph of Section 2.3.4, on page 18, says:\r\n\r\n                                        [...].  One such example is at\r\n|  edge boxes, where up to 1000 T1s connecting into a router with an\r\n   OC-12 (Optical Carrier) uplink.  [...]\r\n                                           ^^^\r\nIt should say:\r\n\r\n                                        [...].  One such example is at\r\n|  edge boxes, where up to 1000 T1s connect into a router with an OC-12\r\n   (Optical Carrier) uplink.  [...]\r\n\r\n\r\n(8)  Section 2.5.2 -- typos\r\n\r\n(8a)\r\nThe first paragraph of Section 2.5.2, on page 24, says:\r\n\r\n   Images and configurations are stored on specific hosts that have\r\n   limited access.  All access and activity relating to these hosts are\r\n|  authenticated and logged via AAA services.  When uploaded/downloading\r\n   any system software or configuration files, either TFTP, FTP, or SCP\r\n   can be used.  Where possible, SCP is used to secure the data transfer\r\n   and FTP is generally never used.  All SCP access is username/password\r\n   authenticated but since this requires an interactive shell, most ISPs\r\n   will use shared key authentication to avoid the interactive shell.\r\n   While TFTP access does not have any security measures, it is still\r\n   widely used, especially in OOB management scenarios.  Some ISPs\r\n|  implement IP-based restriction on the TFTP server, while some custom\r\n   written TFTP servers will support MAC-based authentication.  The\r\n   MAC-based authentication is more common when using TFTP to bootstrap\r\n   routers remotely.\r\n\r\nIt should say:\r\n\r\n   Images and configurations are stored on specific hosts that have\r\n   limited access.  All access and activity relating to these hosts are\r\n|  authenticated and logged via AAA services.  When uploading /\r\n   downloading any system software or configuration files, either TFTP,\r\n   FTP, or SCP can be used.  Where possible, SCP is used to secure the\r\n   data transfer and FTP is generally never used.  All SCP access is\r\n   username/password authenticated but since this requires an\r\n   interactive shell, most ISPs will use shared key authentication to\r\n   avoid the interactive shell.  While TFTP access does not have any\r\n   security measures, it is still widely used, especially in OOB\r\n|  management scenarios.  Some ISPs implement IP-based restrictions on\r\n   the TFTP server, while some custom written TFTP servers will support\r\n   MAC-based authentication.  The MAC-based authentication is more\r\n   common when using TFTP to bootstrap routers remotely.\r\n\r\n(8b)\r\nThe second paragraph of Section 2.5.2, on page 24, says:\r\n\r\n   [...]                      v     vv\r\n|  In at least one environment these, tools are Kerberized to take\r\n   advantage of automated authentication (not confidentiality).\r\n   'Rancid' is one popular publicly available tool for detecting\r\n   configuration and system changes.\r\n\r\nIt should say:\r\n\r\n   [...]                      vv     v\r\n|  In at least one environment, these tools are Kerberized to take\r\n   advantage of automated authentication (not confidentiality).\r\n   'Rancid' is one popular publicly available tool for detecting\r\n   configuration and system changes.\r\n\r\n\r\n(9)  Appendix A.2 -- typo\r\n\r\nThe second bullet in Appendix A.2, on page 34, says:\r\n                             vvvvvvvvvv\r\n|  o  IP Source Route Option can allows attackers to establish stealth\r\n      TCP connections.\r\n\r\nIt should say:\r\n\r\n|  o  IP Source Route Option can allow attackers to establish stealth\r\n      TCP connections.",
    "correct_text": "[not submitted]",
    "notes": "Merike Kaeo wrote:\r\n\"The spelling/typos I'm not so sure make that much of a difference for anyone reading them and would prefer that they not be used.\"\r\n\r\nfrom pending",
    "submit_date": "2007-02-15",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": "2",
    "verifier_name": "Merike Kaeo",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "835",
    "doc-id": "RFC4778",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "2.2.3",
    "orig_text": "   SSH may not be supported on legacy equipment.  In some cases,\r\n   changing the host name of a device requires an SSH rekey event since\r\n   the key is based on some combination of host name, Message\r\n   Authentication Code (MAC) address, and time.",
    "correct_text": "   SSH may not be supported on legacy equipment.  In some cases,\r\n   changing the host name of a device requires an SSH rekey event since\r\n   the key is based on some combination of host name, Media Access\r\n   Control (MAC) address, and time.\r\n\r\n(Or perhaps simply, and more generally, use \"link layer address\"\r\n in place of \"Media Access Control (MAC) address\".)\r\n\r\n\r\n",
    "notes": "wrong acronym expansion",
    "submit_date": "2007-02-15",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": "2",
    "verifier_name": "Merike Kaeo",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "843",
    "doc-id": "RFC4778",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": "",
    "orig_text": "Studying the recently published RFC 4788 (EVRCB)\r\nauthored by you, and comparing it with similar recent\r\npublications,  I'm surprised to find a quite unusual\r\nsyntax used in the 'a=fmtp' SDP lines there.\r\n\r\nUsually, media type parameters included into 'a=fmtp' SDP lines\r\nare separated by semicolons as in the MIME type declaration.\r\n\r\nThe most recent RFC formally specifying this behaviour was\r\nRFC 4749, Section 6.2 of which says:\r\n\r\n   o  Any remaining parameters go in the SDP \"a=fmtp\" attribute by\r\n      copying them directly from the media type string as a semicolon\r\n      separated list of parameter=value pairs.\r\n\r\nAs another example, RFC 4396, in section 9.1, explicitely specifies\r\nthe syntax as:\r\n        a=fmtp:<dynamic payload type>\r\n               <parameter name>=<value>[,<value>]\r\n               [; <parameter name>=<value>]\r\n\r\nNote: This is *not* ABNF, as can be ssen from the context there.\r\n      Matching RFC-4234 ABNF should have been stated there as:\r\n        a=fmtp:<dynamic-payload-type>\r\n               <parameter-name> \"=\" <value> *(\",\" <value>)\r\n               *(\";\" <parameter-name> \"=\" <value> *(\",\" <value>))\r\n\r\nThis was common practice over many years.\r\n\r\nSection 6.7 of RFC 4788 deviates from this practice, omitting\r\nthe semicolon in the examples.  From the prose description,\r\nit is not quite clear whether the phrase,\r\n    \"... copying it directly from the MIME media type string\"\r\nwas meant to comprise the separating semicolons often considered\r\npart of MIME type parameters as well, or not.\r\nUnfortunately, no precise formal description (ABNF) is given.\r\nThe examples given all omit the usual semicolons, e.g.:\r\n\r\n     a=fmtp:97 silencesupp=1 dtxmax=32 dtxmin=12 hangover=1\r\n                            ^         ^         ^\r\n\r\nHas this omission been done intentionally?\r\n\r\nIf yes, what have been the reasons to do so?\r\n  I fear that the unusual definition might cause\r\n  interoperability problems; at least it makes the use\r\n  of uniform parsing of 'a=fmtp' SDP lines impossible.",
    "correct_text": "[not submitted]",
    "notes": "from pending",
    "submit_date": "2007-01-22",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": "106",
    "verifier_name": "Ron Bonica",
    "update_date": "2019-09-10 09:09:03"
  }
]
