[
  {
    "errata_id": 1039,
    "doc-id": "RFC4888",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": 99,
    "orig_text": "(1)  outdated / inappropriate Reference\r\n\r\nThe second bullet in Section 2.1 of RFC 4888, on top of page 5, says:\r\n\r\n              [...].  For instance, given a voice application using an 8\r\n      kbps algorithm (e.g., G.729) and taking a voice sample every 20 ms\r\n|     (as in RFC 1889 [6]), the packet transmission rate will be 50\r\n      packets per second.  [...]\r\n\r\nand Section 6.2, on page 12, contains the details for the ref. [6].\r\n\r\nRFC 1889 has long been obsoleted by STD 64, RFC 3550.\r\nFurthermore, I seriously doubt whether the reference to the core\r\nRTP specification is appropriate here; most probably, a reference\r\nto the RTP A/V profile specification, STD 65, RFC 3551, would have\r\nbeen much more appropriate, because Section 4.5.6 of that RFC\r\ncontains the current specification with the relevant details\r\nfor the G.729 codec mentioned in the example.\r\n\r\n\r\n(2)  textual issues in Section 1\r\n\r\nThe first paragraph of Section 1, on page 3 of RFC 4888, says:\r\n\r\n   With current Network Mobility (NEMO) Basic Support [1], all\r\n   communications to and from nodes in a mobile network must go through\r\n   the bi-directional tunnel established between the Mobile Router and\r\n   its Home Agent (also known as the MRHA tunnel) when the mobile\r\n|  network is away.  Although such an arrangement allows Mobile Network\r\n   Nodes to reach and be reached by any node on the Internet,\r\n   limitations associated to the base protocol degrade overall\r\n   performance of the network and, ultimately, can prevent all\r\n   communications to and from the Mobile Network Nodes.\r\n\r\nIt should perhaps better say, inserting \"from home\" for clarification:\r\n\r\n   With current Network Mobility (NEMO) Basic Support [1], all\r\n   communications to and from nodes in a mobile network must go through\r\n   the bi-directional tunnel established between the Mobile Router and\r\n   its Home Agent (also known as the MRHA tunnel) when the mobile\r\n|  network is away from home.  Although such an arrangement allows\r\n   Mobile Network Nodes to reach and be reached by any node on the\r\n   Internet, limitations associated to the base protocol degrade overall\r\n   performance of the network and, ultimately, can prevent all\r\n   communications to and from the Mobile Network Nodes.\r\n\r\nIn the subsequent second paragraph of Section 1,\r\n\r\n   Some of these concerns already exist with Mobile IPv6 [4] and were\r\n   addressed by the mechanism known as Route Optimization, which is part\r\n   of the base protocol.  With Mobile IPv6, Route Optimization mostly\r\n|  improves the end-to-end path between the Mobile Node and\r\n   Correspondent Node, with an additional benefit of reducing the load\r\n   of the Home Network, thus its name.\r\n\r\nperhaps another article \"the\" should have been inserted:\r\n\r\n   Some of these concerns already exist with Mobile IPv6 [4] and were\r\n   addressed by the mechanism known as Route Optimization, which is part\r\n   of the base protocol.  With Mobile IPv6, Route Optimization mostly\r\n|  improves the end-to-end path between the Mobile Node and the\r\n   Correspondent Node, with an additional benefit of reducing the load\r\n   of the Home Network, thus its name.\r\n\r\n\r\n(3) Appendix A,  Section A.4.3\r\n\r\nIn the last paragraph of Section A.4.3, at the bottom of page 21,\r\nRFC 4888 says:\r\n\r\n              [...].  This is particularly useful for a short-term\r\n   communications that may easily be retried if it fails.  [...]\r\n\r\nthe phrase\r\n            \"a short-term communications\"\r\n\r\nshould have been corrected to say either\r\n\r\n            \"a short-term communication\"\r\nor:\r\n            \"short-term communications\" .",
    "correct_text": "",
    "notes": null,
    "submit_date": "2007-09-11",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": 117,
    "verifier_name": "Ralph Droms",
    "update_date": "2019-09-10 09:09:03"
  }
]
