[
  {
    "errata_id": 1940,
    "doc-id": "RFC5586",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": 10,
    "orig_text": "In order to support this\r\nrequirement, IANA has changed the code point allocation scheme for\r\nthe PW Associated Channel Type be changed as follows:\r\n\r\n   0 - 32751 : IETF Review\r\n   32760 - 32767 : Experimental\r\n\r\n",
    "correct_text": "In order to support this\r\nrequirement, IANA has changed the code point allocation scheme for\r\nthe PW Associated Channel Type be changed as follows:\r\n\r\n   0 - 32759 : IETF Review\r\n   32760 - 32767 : Experimental\r\n   32768 - 65535 : IETF Review\r\n\r\n",
    "notes": "There are some gaps in the specified allocation policy for some parts of the ACH channel type range (32752 to 32759 and 32768 to 65535). The channel type is a 16-bit value, and the IANA considerations section of RFC5586 should be updated to reflect this.\r\n\r\nThe correction should be to clarify that the allocation policy for the code points that have been left out of RFC5586 is IETF review (which reflects the WG consensus at the time of publication), and to leave the Experimental range where it is to avoid impacting current implementations.\r\n\r\nThis also requires an update by IANA to the PW ACH Channel Type registry.",
    "submit_date": "2009-11-03",
    "submitter_name": "Matthew Bocci",
    "verifier_id": 119,
    "verifier_name": "Adrian Farrel",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 4364,
    "doc-id": "RFC5586",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "4.2.1",
    "orig_text": "   The Time-To-Live (TTL) field of the LSE that contains the GAL follows\r\n   the definition and processing rules specified in [RFC3443].",
    "correct_text": "The value of the  Time-To-Live (TTL) field of the LSE that contains the \r\nGAL follows is irrelevant as long as it exceeds 1. (Setting this value \r\nto 0 or 1 SHOULD be avoided because it could result in trapping the OAM \r\npackets in with wrong reason: \"TTL expiration\" instead of \"GAL  \r\nencountered\").  ",
    "notes": "The processing rules specific in RFC 3443 deal with handling TTL in the LSE of a labeled packets that are forwarded based on this LSE, or with setting the TTL value by a LER pushing a label stack on an unlabeled packet.\r\nAs per the last para in Section 4.2, LSRs and LERs MUST NOT forward packets based on the LSE that contains GAL, hence these rules are mainly not applicable.\n --VERIFIER NOTES-- \nThis proposes a change to the RFC which needs to be agreed via working group consensus.   ",
    "submit_date": "2015-05-12",
    "submitter_name": "Alexander (\"Sasha\") Vainshtein",
    "verifier_id": 149,
    "verifier_name": "Deborah Brungard",
    "update_date": "2019-09-10 09:09:03"
  }
]
