[
  {
    "errata_id": 5085,
    "doc-id": "RFC5884",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": 6,
    "orig_text": "   On receipt of the LSP Ping Echo request message, the egress LSR MUST\r\n   send a BFD Control packet to the ingress LSR, if the validation of\r\n   the FEC in the LSP Ping Echo request message succeeds.  This BFD\r\n   Control packet MUST set the Your Discriminator field to the\r\n   discriminator received from the ingress LSR in the LSP Ping Echo\r\n   request message.  The egress LSR MAY respond with an LSP Ping Echo\r\n   reply message that carries the local discriminator assigned by it for\r\n   the BFD session.  The local discriminator assigned by the egress LSR\r\n   MUST be used as the My Discriminator field in the BFD session packets\r\n   sent by the egress LSR.\r\n\r\n   The ingress LSR follows the procedures in [BFD] to send BFD Control\r\n   packets to the egress LSR in response to the BFD Control packets\r\n   received from the egress LSR.  The BFD Control packets from the\r\n   ingress to the egress LSR MUST set the local discriminator of the\r\n   egress LSR, in the Your Discriminator field.  The egress LSR\r\n   demultiplexes the BFD session based on the received Your\r\n   Discriminator field.  As mentioned above, the egress LSR MUST send\r\n   Control packets to the ingress LSR with the Your Discriminator field\r\n   set to the local discriminator of the ingress LSR.  The ingress LSR\r\n   uses this to demultiplex the BFD session.",
    "correct_text": "On receipt of the LSP Ping Echo request message, the egress LSR\r\nMUST send a BFD Control packet to the ingress LSR, if the\r\nvalidation of the FEC in the LSP Ping Echo request message\r\nsucceeds.  This BFD Control packet MUST set the Your Discriminator\r\nfield to the discriminator received from the ingress LSR in the LSP\r\nPing Echo request message. The local discriminator assigned by the\r\negress LSR MUST be used as the My Discriminator field in the BFD\r\nsession packets sent by the egress LSR.\r\n\r\nThe ingress LSR follows the procedures in [BFD] to send BFD Control\r\npackets to the egress LSR in response to the BFD Control packets\r\nreceived from the egress LSR.  The BFD Control packets from the\r\ningress to the egress LSR MUST set the local discriminator of the\r\negress LSR in the Your Discriminator field. The egress LSR\r\ndemultiplexes the BFD session based on the received Your\r\nDiscriminator field. As mentioned above, the egress LSR MUST send\r\nControl packets to the ingress LSR with the Your Discriminator field\r\nset to the local discriminator of the ingress LSR.The ingress LSR\r\nuses this to demultiplex the BFD session.\r\n\r\nThe egress LSR processes the LSP Ping Echo request message in\r\naccordance with the procedures defined in [RFC 8029]. The LSP Ping\r\nEcho reply message generated by the egress LSR MAY carry the local\r\ndiscriminator assigned by it for the BFD session, as specified in\r\nsection 6.1.",
    "notes": "Submitter:\r\nIt is not clear from the original text which of the following is optional:\r\n  -  The egress MUST send a reply, but the discriminator in the reply is optional\r\n  -  The reply itself is optional\r\n \r\nTechnically, the reply cannot be optional, because the egress needs to report LSP-Ping verification status to the ingress.\r\n\r\nThe proposed text recommends to include BFD discriminator in the reply. This was the intent of the original text.\r\n\r\nVerifier:\r\nThe original Errata proposed correcting the last sentences of the second paragraph of Section 6. After discussion in the working group, it was agreed both the second and third paragraphs shown above of Section 6 needed to be revised to the three paragraphs of the corrected text shown above.",
    "submit_date": "2017-08-11",
    "submitter_name": "Balaji Rajagopalan",
    "verifier_id": 149,
    "verifier_name": "Deborah Brungard",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5087,
    "doc-id": "RFC5884",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": 7,
    "orig_text": "7.  Encapsulation\r\n\r\n[...]\r\n\r\n   The BFD Control packet sent by the ingress LSR MUST be a UDP packet\r\n   with a well-known destination port 3784 [BFD-IP] and a source port\r\n   assigned by the sender as per the procedures in [BFD-IP].  The source\r\n   IP address is a routable address of the sender.  The destination IP\r\n   address MUST be randomly chosen from the 127/8 range for IPv4 and\r\n   from the 0:0:0:0:0:FFFF:7F00/104 range for IPv6 with the following\r\n   exception.  If the FEC is an LDP IP FEC, the ingress LSR may discover\r\n   multiple alternate paths to the egress LSR for this FEC using LSP\r\n   Ping traceroute.  In this case, the destination IP address, used in a\r\n   BFD session established for one such alternate path, is the address\r\n   in the 127/8 range for IPv4 or 0:0:0:0:0:FFFF:7F00/104 range for IPv6\r\n   discovered by LSP Ping traceroute [RFC4379] to exercise that\r\n   particular alternate path.\r\n\r\n[...]\r\n\r\n   Or the BFD Control packet sent by the egress LSR to the ingress LSR\r\n   MAY be encapsulated in an MPLS label stack.  In this case, the\r\n   presence of the fault detection message is indicated as described\r\n   above.  This may be the case if the FEC for which the fault detection\r\n   is being performed corresponds to a bidirectional LSP or an MPLS PW.\r\n   This may also be the case when there is a return LSP from the egress\r\n   LSR to the ingress LSR.  In this case, the destination IP address\r\n   MUST be randomly chosen from the 127/8 range for IPv4 and from the\r\n   0:0:0:0:0:FFFF:7F00/104 range for IPv6.",
    "correct_text": "7.  Encapsulation\r\n\r\n[...]\r\n\r\n   The BFD Control packet sent by the ingress LSR MUST be a UDP packet\r\n   with a well-known destination port 3784 [BFD-IP] and a source port\r\n   assigned by the sender as per the procedures in [BFD-IP].  The source\r\n   IP address is a routable address of the sender.  The destination IP\r\n   address MUST be randomly chosen from the 127/8 range for IPv4 and\r\n   from the 0:0:0:0:0:FFFF:7F00:0/104 range for IPv6 with the following\r\n   exception.  If the FEC is an LDP IP FEC, the ingress LSR may discover\r\n   multiple alternate paths to the egress LSR for this FEC using LSP\r\n   Ping traceroute.  In this case, the destination IP address, used in a\r\n   BFD session established for one such alternate path, is the address\r\n   in the 127/8 range for IPv4 or 0:0:0:0:0:FFFF:7F00:0/104 range for \r\n   IPv6 discovered by LSP Ping traceroute [RFC4379] to exercise that\r\n   particular alternate path.\r\n\r\n[...]\r\n\r\n   Or the BFD Control packet sent by the egress LSR to the ingress LSR\r\n   MAY be encapsulated in an MPLS label stack.  In this case, the\r\n   presence of the fault detection message is indicated as described\r\n   above.  This may be the case if the FEC for which the fault detection\r\n   is being performed corresponds to a bidirectional LSP or an MPLS PW.\r\n   This may also be the case when there is a return LSP from the egress\r\n   LSR to the ingress LSR.  In this case, the destination IP address\r\n   MUST be randomly chosen from the 127/8 range for IPv4 and from the\r\n   0:0:0:0:0:FFFF:7F00:0/104 range for IPv6.",
    "notes": "There are three instances of the IPv4-mapped IPv6 prefix for the IPv4 loopback range 127.0.0.0/8 written as 0:0:0:0:0:FFFF:7F00/104, and it should instead be written as 0:0:0:0:0:FFFF:7F00:0/104.\r\n\r\ns/0:0:0:0:0:FFFF:7F00/0:0:0:0:0:FFFF:7F00:0/g (3 replacements)\r\n\r\nSame rationale as https://mailarchive.ietf.org/arch/msg/rtg-bfd/DqH_LFCEyUqCLQhffEb7_jU24uQ",
    "submit_date": "2017-08-16",
    "submitter_name": "Carlos Pignataro",
    "verifier_id": 148,
    "verifier_name": "Alvaro Retana",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5088,
    "doc-id": "RFC5884",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "3.1,4,7,11.2",
    "orig_text": "[5085]",
    "correct_text": "[5885]",
    "notes": "RFC 5884 refers to RFC 5085, when in fact it should refer to RFC 5885 (or at the very least to both RFCs 5085 and 5885 consecutively).\r\n\r\nHistorically, RFC 5085 and RFC 5885 come from the same Internet-Draft, which was Referenced from RFC 5884. It included general VCCV as well as BFD for VCCV. Subsequently, that document was split into two I-Ds that resulted in RFCs 5085 and 5885. BFD for Pseudowires is actually covered by RFC 5885 (not 5085).\r\n\r\nIn Section 3.1.  BFD for MPLS LSPs: Motivation\r\n\r\n      e) Pseudowires based on PWid FEC and Generalized PWid FEC\r\n         [RFC4447]\r\n\r\ne) is covered by RFC 5885 as BFD single-hop for PWs. And not as per the more complex RFC 5884.\r\n\r\nA better technical normalization of BFD for PWs versus BFD for other MPLS LSPs is needed to adequately cover the subject matter of RFC 5884.\r\n\r\nNote, RFC 5884 and 5885 were part of the same RFC-Editor cluster.",
    "submit_date": "2017-08-17",
    "submitter_name": "Carlos Pignataro",
    "verifier_id": 148,
    "verifier_name": "Alvaro Retana",
    "update_date": "2019-09-10 09:09:03"
  }
]
