[
  {
    "errata_id": "1811",
    "doc-id": "RFC5570",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "5.1.8",
    "orig_text": "This contains a variable number of 64-bit words.",
    "correct_text": "This contains a variable number of 32-bit words.",
    "notes": "Sections 5.1.3 and 5.2 closely relate to the text in Section 5.1.8.  Those 2 other sections provide further explanation why the text in Section 5.1.8 should refer to \"32-bit words\" rather than \"64-bit words\".",
    "submit_date": "2009-07-17",
    "submitter_name": "R. Atkinson",
    "verifier_id": "124",
    "verifier_name": "Sean Turner",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "4545",
    "doc-id": "RFC5570",
    "errata_status_code": "Reported",
    "errata_type_code": "Editorial",
    "section": "5.1.7",
    "orig_text": null,
    "correct_text": "Add the following clarifying text:\r\n\r\nWhile the code listed in RFC 1662 Appendix C reportedly does not \r\nnatively use IETF Network Byte Order, the CRC generated using the \r\nalgorithm from RFC 1662, Appendix C, MUST be stored on-the-wire \r\nin Network Byte Order in the \"16-bit Checksum Field\" defined by \r\nRFC 5570, Section 5.1.7, in order to remain consistent with all \r\nother fields in the RFC 5570 CALIPSO option.  \r\n\r\nNetwork Byte Order is defined in RFC 791, Appendix B.\r\n\r\nAs an implementation note, at least one implementer has found \r\nthat in his implementation it is easiest to use the RFC 1662,\r\nAppendix C code as-is for the purposes of generating and calculating \r\nthe checksum.  That implementation reportedly has code that on \r\npacket creation writes the generated checksum into this field --in \r\nNetwork Byte Order-- prior to packet transmission.  The same \r\nimplementation reportedly has code that on packet reception reads\r\nthe transmitted checksum in Network Byte Order and then locally \r\ntransforms the value into RFC 1662, Appendix C, byte order \r\n(i.e. for the purpose of checksum verification upon packet reception\r\nas per RFC 5570, Section 5.1, paragraph 2).",
    "notes": "An implementer was confused about whether Network Byte Order applied \r\nto all fields in the CALIPSO option defined in RFC 5570.  This erratum clarifies \r\nthat Network Byte Order does apply to all fields in the RFC 5570 CALIPSO \r\noption.",
    "submit_date": "2015-11-24",
    "submitter_name": "R. Atkinson",
    "verifier_id": "2",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  }
]
