[
  {
    "errata_id": "1437",
    "doc-id": "RFC5185",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "2.1",
    "orig_text": "  Multi-area adjacencies are configured between two routers having a\r\n   common interface. ",
    "correct_text": "  Multi-area adjacencies are configured between two routers having an\r\n   interface to the same network.\r\n",
    "notes": "Unless \"interface\" is used in an unusual meaning?",
    "submit_date": "2008-06-12",
    "submitter_name": "Stéphane Bortzmeyer",
    "verifier_id": "2",
    "verifier_name": "Stewart Bryant",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "3595",
    "doc-id": "RFC5185",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "4",
    "orig_text": "   A link-LSA SHOULD NOT be advertised for a multi-area adjacency.  The\r\n   neighbor's IPv6 link local address can be learned in other ways,\r\n   e.g., it can be extracted from the IPv6 header of Hello packets\r\n   received over the multi-area adjacency.  The neighbor IPv6 link local\r\n   address is required for the OSPFv3 route next-hop calculation on\r\n   multi-access networks (refer to Section 3.8.1.1 of [OSPFV3]).\r\n",
    "correct_text": "OSPFv3 supports two Address Families (AF), AF IPv6 and AF IPv4, using\r\nseparate instances [RFC 5338]. The route calculation differs for the\r\nIPv4 and IPv6 address families with respect to the next-hop\r\ndetermination. OSPFv3 instances supporting an IPv6 AF SHOULD learn the\r\nIPv6 next-hop address from the IPv6 Header source address and SHOULD\r\nNOT advertise a Link-LSA for a multi-area adjacency. However, for\r\nOSPFv3 instances supporting an IPv4 AF, the next-hop address cannot be\r\nlearned from the OSPFv3 hellos and require advertisement of the\r\nLink-LSA. Hence, OSPFv3 instances supporting an IPv4 AF SHOULD\r\nadvertise a Link-LSA for the a multi-area adjacency (refer to section\r\n2.5 of [RFC 5838]). If the Link-LSA is not advertised, the OSPFv3\r\ninstance MAY learn the IPv4 next-hop address from the Link-LSA\r\nadvertised on the primary adjacency.",
    "notes": "RFC5185 describes next-hop calculation which is not applicable to OSPFv3 process supporting AF IPv4 as defined in RFC5838. Errata defines how RFC5838 OSPFv3 process supporting AF IPv4 calculates next-hop address on multi-area interface.\n --VERIFIER NOTES-- \n   This is a technical change and is thus cannot be addressed through the errata process. The correct process for addressing this concern is by writing a draft that updates RFC5158 and testing whether there is OSPF WG and IETF consensus for publication of the proposed update.",
    "submit_date": "2013-04-17",
    "submitter_name": "Marek Karasek",
    "verifier_id": "122",
    "verifier_name": "Stewart Bryant",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "6506",
    "doc-id": "RFC5185",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "2.7",
    "orig_text": "   Multi-area adjacencies are announced as point-to-point links.  Once\r\n   the router's multi-area adjacency reaches the FULL state, it will be\r\n   added as a link type 1 to the Router Link State Advertisement (LSA)\r\n   with:\r\n\r\n      Link ID = Remote's Router ID\r\n\r\n      Link Data = Neighbor's IP Address or IfIndex (if the underlying\r\n      interface is unnumbered).\r\n\r\n   Unlike numbered point-to-point links, no type 3 link is advertised\r\n   for multi-area adjacencies.\r\n",
    "correct_text": "   Multi-area adjacencies are announced as point-to-point links.  Once\r\n   the router's multi-area adjacency reaches the FULL state, it will be\r\n   added as a link type 1 to the Router Link State Advertisement (LSA)\r\n   with:\r\n\r\n      Link ID = Remote's Router ID\r\n\r\n      Link Data = Router interface's IP Address or IfIndex (if the underlying\r\n      interface is unnumbered).\r\n\r\n   Unlike numbered point-to-point links, no type 3 link is advertised\r\n   for multi-area adjacencies.\r\n",
    "notes": "The encoding of Link Data as specified in RFC5185 is not consistent with the base OSPF specification in RFC2328. This has resulted in different behaviors in deployed implementations where some follow RFC2328 (i.e. the corrected text) while others follow the Original text of RFC5185 leading to interop issues.\r\n\r\nMore importantly, for implementations of RFC5185, it is not possible to determine the Neighbor's interface IfIndex unless some additional mechanisms (that have not been specified or referenced by RFC5185) are implemented - viz. RFC8510.\r\n\r\nThis topic has been discussed in the LSR WG recently and this errata is being raised to track this issue : https://mailarchive.ietf.org/arch/msg/lsr/iL85WkrqhI17wUrxd-WozMQvKtE/\n --VERIFIER NOTES-- \nAs discussed here (https://mailarchive.ietf.org/arch/msg/lsr/9IAkRCbZN39loWcwKjtNWfUW_qA/) this would be a technical change vs. the WG consensus when the document was progressed, and should be rejected (see https://www.ietf.org/about/groups/iesg/statements/processing-rfc-errata/ #7). The appropriate way to pursue this looks to be an update or bis.\r\n",
    "submit_date": "2021-04-02",
    "submitter_name": "Ketan Talaulikar",
    "verifier_id": "171",
    "verifier_name": "John Scudder",
    "update_date": "2021-05-17 15:08:18"
  }
]
