[
  {
    "errata_id": 5114,
    "doc-id": "RFC5378",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "1(j)",
    "orig_text": "\"Legend Instructions\": the standardized text that is maintained by the\r\nIETF Trust and is included in IETF Documents and the instructions and\r\nrequirements for including that standardized text in IETF Documents.\r\nThe text and instructions are posted from time to time at\r\nhttp://trustee.ietf.org/license-info.",
    "correct_text": "Beats me.  See below.  It is probably better to fix this problem by\r\nmaking the link point to what the RFC says it points to than to\r\ncreate a final erratum for the RFC, but even the latter would require \r\nsome effort for the erratum to describe a stable reference.",
    "notes": "When this link is used, it redirects to http://trustee.ietf.org/license-info, but that link redirects to the Trust Legal Provisions main page  (https://trustee.ietf.org/trust-legal-provisions.html ) which not only does not contain the promised text and instructions, but doesn't even contain the word \"Legend\".    One might figure out that one is supposed to go to the actual TLP page (currently https://trustee.ietf.org/documents/IETF-TLP-5_001.html), but, while that page mentions \"legend(s)\" several times, one of those places is not in Section 6, which is described as \"Text To Be Included...\" and not \"Legends\" as this RFC implies.\n --VERIFIER NOTES-- \n   The web page at http://trustee.ietf.org/license-info still redirects to https://trustee.ietf.org/documents/trust-legal-provisions/, but that page was recently updated to point the reader to the IETF Trust FAQ for RFC5378 instructions. ",
    "submit_date": "2017-09-14",
    "submitter_name": "John Klensin",
    "verifier_id": 169,
    "verifier_name": "Lars Eggert",
    "update_date": "2021-03-29 01:28:17"
  },
  {
    "errata_id": 6673,
    "doc-id": "RFC5378",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "GLOBAL",
    "orig_text": "RFC 5378                   RFC 3978-incoming               November 2008",
    "correct_text": "RFC 5378             Rights Provided to IETF Trust         November 2008",
    "notes": "This appears at the top of every page. It looks like a placeholder title from a draft of this document made it into the final version.",
    "submit_date": "2021-09-01",
    "submitter_name": "Jason Yundt",
    "verifier_id": 2,
    "verifier_name": "RFC Editor",
    "update_date": "2022-01-27 15:13:47"
  }
]
