[
  {
    "errata_id": 5415,
    "doc-id": "RFC6052",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": 2.2,
    "orig_text": "   Bits 64 to 71 of the address are reserved for compatibility with the\r\n   host identifier format defined in the IPv6 addressing architecture\r\n   [RFC4291].  These bits MUST be set to zero.  When using a /96\r\n   Network-Specific Prefix, the administrators MUST ensure that the bits\r\n   64 to 71 are set to zero.  A simple way to achieve that is to\r\n   construct the /96 Network-Specific Prefix by picking a /64 prefix,\r\n   and then adding 4 octets set to zero.\r\n\r\n[and other parts of the text]\r\n",
    "correct_text": "[This paragraph should be removed and corresponding changes made to\r\nthe rest of section 2.2.]",
    "notes": "Section 2.2 says that bits 64 to 71 of the Ipv6 address MUST be set to zero and references RFC 4291 as the authority.  However, RFC 7136 says:\r\n\r\n   In particular, RFC 4291 defines a method by which the\r\n   Universal and Group bits of an IEEE link-layer address are mapped\r\n   into an IPv6 unicast interface identifier.  This document clarifies\r\n   that those two bits are significant only in the process of deriving\r\n   interface identifiers from an IEEE link-layer address, and it updates\r\n   RFC 4291 accordingly.\r\n\r\nThus, the text I've referenced in RFC 6052 is to enforce a requirement that was not correctly applied, and RFC 6052's statement about bits 64 to 71 should be removed.  In addition, there are consequent changes in other parts of RFC 6052, including Figure 1, where the \"u\" field should be removed from the address formats.\n --VERIFIER NOTES-- \n   AD (Magnus Westerlund): A clarification by a later RFC that impacts this RFC is not an errata. The change appears to require a consensus decision on how to handle it. Thus rejected on formal grounds, should be considered if document is revised in the future. ",
    "submit_date": "2018-07-01",
    "submitter_name": "Dale R. Worley",
    "verifier_id": 114,
    "verifier_name": "Magnus Westerlund",
    "update_date": "2020-01-16 02:40:11"
  },
  {
    "errata_id": 5547,
    "doc-id": "RFC6052",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": 3.1,
    "orig_text": "   The Well-Known Prefix MUST NOT be used to represent non-global IPv4\r\n   addresses, such as those defined in [RFC1918] or listed in Section 3\r\n   of [RFC5735].  Address translators MUST NOT translate packets in\r\n   which an address is composed of the Well-Known Prefix and a non-\r\n   global IPv4 address; they MUST drop these packets.",
    "correct_text": "The paragraph should be removed.",
    "notes": "IPv4 packets with private addresses are routinely translated to IPv4 packets with global addresses in NAT44. If a 464XLAT CLAT (stateless NAT64) cannot translate a private address to an IPv6 /96 prefix with that address as an IID (or whatever it's called), then the packet may not be translated to an IPv4 packet with a global address by the 464XLAT PLAT (stateful NAT64). This changes the intent of the sender, and in so doing violates the end to end principle. Practically speaking, it means that a network that uses 464XLAT or MAP-T with IPv4 in the subscriber and translating to IPv4 via NAT64 into the IPv4 Internet, it forces the network or the subscriber to purchase global address space. That's just silly. Let the user use private address space in the home or whatever.\n --VERIFIER NOTES-- \nThe orginial text was intended at time of publication. If this is not current anymore, the RFC needs to be updated by an IETF consensus doc.",
    "submit_date": "2018-11-06",
    "submitter_name": "Fred Baker",
    "verifier_id": 153,
    "verifier_name": "Mirja Kühlewind",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5984,
    "doc-id": "RFC6052",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": 3.3,
    "orig_text": "Organizations deploying stateless IPv4/IPv6 translation SHOULD assign a Network-Specific Prefix to their IPv4/IPv6 translation service.",
    "correct_text": "Organizations deploying stateless IPv4/IPv6 translation SHOULD assign a Network-Specific Prefix for the exclusive use of their IPv4/IPv6 translation service.",
    "notes": "This seems obvious but is not. The NSP must only be used for the translation service. If the NSP is used only, for example in an enterprise network, in the LANs, and the translator allows it, it may create conflicts, as the resulting IPv6 address (NSP+IPv4 address) may be the same as a host inside the LAN has been configured with (either manually, or with SLAAC, DHCPv6), etc.\r\n\r\nIt has been confirmed that at least one vendor already realized this and the implementation doesn't work if the prefix is used both for the translator service and one of the LANs, but there is no explicit documentation on that. So if configured, the box doesn't work, but doesn't report is an an \"invalid\" config.\n --VERIFIER NOTES-- \nThis Errata requests requires WG consensus decision and thus outside of the Errata process. The specification does not prevent what is propsed as the appropriate way of assigning a NSP. The RFC does not restrict the usage, and as commented on the mailing list, there are ways to make even using the same prefix for both clients and the NAT64 device. ",
    "submit_date": "2020-02-16",
    "submitter_name": "Jordi Palet Martinez",
    "verifier_id": 114,
    "verifier_name": "Magnus Westerlund",
    "update_date": "2020-02-17 01:26:25"
  }
]
