[
  {
    "errata_id": "3267",
    "doc-id": "RFC6546",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "3",
    "orig_text": "In paragraph 4 of section 3, fourth sentence:\r\n\r\n   As RID messages MUST be\r\n   sent using the POST method, the GET and HEAD methods have no\r\n   particular meaning on a RID system; a RID system SHOULD answer\r\n   'GET /' or 'HEAD /' with 204 No Content.",
    "correct_text": "Consistent with RFC 2616 section 10.4.6, a RID system MUST answer \r\nany HTTP request to Request-URI of '/' which uses an HTTP method \r\nother than 'POST' by producing an HTTP response with a status code \r\nof 405 Method Not Allowed.  The RID system HTTP response MUST also \r\ninclude an Allow header indicating that only the 'POST' method is \r\nsupported.\r\n",
    "notes": "There has been a brief discussion of this errata on the MILE list, with the first message in the thread having been posted on June 5, 2012.  \r\n\r\nThe corrected text that I have suggested above has been written as narrowly as possible, and remains consistent with the original functionality described in 6546.  \r\n\r\nLacking support for 'GET' means that there is no way to verify if a RID endpoint is active, other than by doing a real request, i.e. a Report, or Query, etc.   Thus, one might also consider supporting HEAD, e.g. for RID testing purposes, though that option has not been discussed yet.  Note, however, that supporting HEAD potentially raises further issues since according to RFC 2616 the response headers to a HEAD request SHOULD be consistent with a GET, which is specifically not supported.",
    "submit_date": "2012-06-26",
    "submitter_name": "John Field",
    "verifier_id": "124",
    "verifier_name": "Sean Turner",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "3277",
    "doc-id": "RFC6546",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": "3",
    "orig_text": "Table 1 lists the allowable RID message types in an HTTP Response for a given RID message type in the Request.  A RID system MUST be prepared to handle an HTTP Response of the given type(s) when sending the corresponding HTTP Request.  A RID system MUST NOT send an HTTP Response containing any RID message other than the one corresponding to the one sent in the HTTP Request.\r\n\r\n(table 1 appears here)\r\n\r\nThe use of stable DNS names to address RID systems is RECOMMENDED; in addition to facilitating connection to RID systems within a consortium, these are to be used as reference identifiers for a RID system's peers.  For security purposes, RID systems SHOULD NOT return 3xx Redirection response codes, and SHOULD NOT follow any 3xx Redirection.  The protocol provides no in-band method for handling a change of address of a RID system.\r\n",
    "correct_text": "Insert new text just before table 1:\r\n\r\n\"An X appearing in the Callback column of Table 1 means that the exchange itself IS a callback.  In these cases the HTTP request contains a RID message that is intended to conclude an earlier RID exchange which initially returned 202.   Note that RID Acknowledgment and RID Result messages can only ever appear in an HTTP request when the message is being generated as a Callback.  However, a RID Report message that appears in an HTTP request may represent either a unsolicited Report, or a delayed Callback.  It is important to note that any RID message that is sent as a Callback must be answered with a 200, and so cannot itself generate yet another Callback.\"",
    "notes": "This is a request to insert some additional text to help clarify the meaning of the \"X\" that appears in the Callback column of table 1.   I believe this will be of benefit to implementers who must understand the message exchange patterns described in table 1 in order to properly implement the RID protocol.",
    "submit_date": "2012-07-03",
    "submitter_name": "John Field",
    "verifier_id": "124",
    "verifier_name": "Sean Turner",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "3455",
    "doc-id": "RFC6546",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "3",
    "orig_text": "If a RID system receives an improper RID message in an HTTP Request,\r\nit MUST return an appropriate 4xx Client Error result code to the \r\nrequesting RID system.\r\n",
    "correct_text": "If a RID system receives an improper HTTP Request, it MUST return \r\nan appropriate 4xx Client Error result code to the requesting RID \r\nsystem.\r\n",
    "notes": "There has been some discussion of this issue on the MILE mailing list.  Another possible option for the corrected text is to say nothing at all.  That is, by changing the specification to focus on an improper HTTP request, rather than an improper RID message, the corrected text is simply a restatement of existing HTTP behavior.  (Either way, this still does constitute a technical change since we would no longer be requiring the 400 status code when the error is with the *RID* content).  On this technical point, we had consensus on the MILE mailing list:  we SHOULD NOT require an HTTP 4xx status code when there is an error with the RID content itself (as opposed to the HTTP layer).  HTTP 4xx status is reserved for errors occurring in the HTTP protocol layer.  Errors in the RID content will be reported via the RID Acknowledgement message type, with appropriate choices for the RequestStatus element, and Justification attribute.",
    "submit_date": "2013-01-14",
    "submitter_name": "John Field",
    "verifier_id": "124",
    "verifier_name": "Sean Turner",
    "update_date": "2019-09-10 09:09:03"
  }
]
