[
  {
    "errata_id": "4756",
    "doc-id": "RFC6146",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": "3.5.3",
    "orig_text": "If the NAT64 filters on its IPv4 interface, then the NAT64 checks\r\nto see if the incoming packet is allowed according to the Address-\r\nDependent Filtering rule.  To do this, it searches for a Session\r\nTable Entry with an STE source IPv4 address equal to X, an STE\r\nICMPv4 Identifier equal to i2, and a STE destination IPv4 address\r\nequal to Y.  If such an entry is found (there may be more than\r\none), packet processing continues.  Otherwise, the packet is\r\ndiscarded.  If the packet is discarded, then an ICMP error message\r\nMAY be sent to the original sender of the packet.  The ICMP error\r\nmessage, if sent, has Type 3 (Destination Unreachable) and Code 13\r\n(Communication Administratively Prohibited).\r\n\r\nIn case the packet is not discarded in the previous processing\r\nsteps (either because the NAT64 is not filtering or because the\r\npacket is compliant with the Address-Dependent Filtering rule),\r\nthen the NAT64 searches for a Session Table Entry (...)",
    "correct_text": "The NAT64 then searches for a Session Table Entry (...)",
    "notes": "The statement \"there may be more than one\" is incorrect; the triplet (X,i2,Y) constitutes the whole ICMP session's v4 identifier. Considering that, the whole paragraph tends to fall apart.\r\n\r\nThe point of Address-Dependent Filtering (ADF) is to provide a means to allow or disallow IPv4-started \"sibling\" connections. If there is an ongoing connection whose binding state is\r\n\r\n\tBIB entry: (*,*)       <--> (T,t)\r\n\tSession: (*,*),(*,*) <--> (T,t),(Z,z)\r\n\r\n(Left side is v6, right side is v4. This is the same notation as the RFC; see for example https://tools.ietf.org/html/rfc6146#section-3.5.1; '*' is anything/irrelevant)\r\n\r\nThen ADF dictates whether the v4 endpoint is allowed to create the following new session (using the same BIB entry):\r\n\r\n\tSession: (*,*),(*,*) <--> (T,t),(Z,m)\r\n\r\n(where 'z' is not equal to 'm')\r\n\r\nADF works in UDP/TCP because t and z/m are separate variables. This is not the case in ICMP:\r\n\r\n\tBIB entry: (*,*)       <--> (T,t)\r\n\tSession: (*,*,*)     <--> (T,t,Z)\r\n\r\nIf only one ICMP triplet can match, there is no room for \"sibling\" ICMP \"connections\" that share a \"source\" IPv4 identifier but not a \"destination\" IPv4 identifier like TCP and UDP do. The two pings will share both BIB entry and v4 endpoint address and therefore also share the session. The NAT64 is incapable of telling the two pings apart, and therefore cannot filter one of them.\r\n\r\nThere is no such thing as \"Address-Dependent Filtering\" on ICMP.",
    "submit_date": "2016-08-02",
    "submitter_name": "Alberto Leiva Popper",
    "verifier_id": "114",
    "verifier_name": "Magnus Westerlund",
    "update_date": "2021-01-13 06:41:50"
  },
  {
    "errata_id": "8416",
    "doc-id": "RFC6146",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "3.5.1.1",
    "orig_text": "In all cases, the allocated IPv4 transport address (T,t) MUST NOT be in use in another entry in the same BIB, but can be in use in other BIBs (e.g., the UDP and TCP BIBs).",
    "correct_text": "In all cases, the allocated IPv4 transport address (T,t) MUST NOT be in use in another entry in the same BIB, but can be in use in other BIBs (e.g., the TCP and ICMP BIBs).",
    "notes": "The confusing wording appears in section 3.5.1.1 (regarding UDP BIB) and 3.5.2.3 (regarding TCP BIB).\r\n\r\nIt's possible and reasonable to interpret section 3.5.1.1's text\r\n\r\n    \"but can be in use in other BIBs (e.g., the UDP and TCP BIBs)\"\r\n\r\nas if the text were:\r\n\r\n    \"but can be in use in other BIBs (i.e., can be in use in the other BIBs, which in this case are the UDP and TCP BIBs).\"\r\n\r\nThis looks like an error, because when *this* BIB is the UDP BIB, the *other* BIBs are the TCP and ICMP BIBs, not the UDP and TCP BIBs.\r\n\r\nThis interpretation is reasonable because use of the Latin \"e.g.\" (\"for example\") makes it seem like the given BIBs are examples of \"other BIBs.\"\r\n\r\nSimilarly, in section 3.5.2.3, *this* BIB is the TCP BIB, the *other* BIBs are the UDP and ICMP BIBs, but the text mentions UDP and TCP BIBs in the parenthetical example, and again looks like an error.\r\n\r\nIf this is the correct interpretation, then each section simply requires the correct *other* example BIBs in the parenthetical. [Section 3.5.1.1 corrected text given above; section 3.5.2.3 would be corrected in a similar manner.]\r\n\r\nHowever, there is another possible interpretation, in which the given BIBs are correctly stated, but the wording is unclear as to what is denoted by the parenthetical example. In this interpretation, section 3.5.1.1 is intended as if the text were:\r\n\r\n    \"but can be in use in other BIBs (i.e., the same address can be used in entries in both the UDP and TCP BIBs),\"\r\n\r\nor\r\n\r\n    \"\"but can be in use in other BIBs (i.e., the UDP and TCP BIBs can have an entry using the same address).\"\r\n\r\nIf this interpretation is intended, then it should be made clearer, and probably should use the Latin \"i.e.\" (\"that is\") for the clarifying situation. [Again, in sections 3.5.1.1 and 3.5.2.3.]\r\n\r\nEither way, because interpretation of the text is ambiguous in a way that affects its normative meaning, it should be clarified.",
    "submit_date": "2025-05-15",
    "submitter_name": "Marc Lepage",
    "verifier_id": "2",
    "verifier_name": null,
    "update_date": "2025-05-28 07:17:37"
  }
]
