[
  {
    "errata_id": 3372,
    "doc-id": "RFC6519",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": 3,
    "orig_text": "   In the scenario depicted in Figure 2, the Access-Request packet\r\n   contains a Service-Type attribute with the value Authorize Only (17);\r\n   thus, according to [RFC5080], the Access-Request packet MUST contain\r\n   a State attribute.",
    "correct_text": "    In the scenario depicted in Figure 2, the Access-Request packet\r\n   contains a Service-Type attribute with the value Call-Check (10).",
    "notes": "The document references RFC 5080.  However, the use of the State attribute in this document is wrong.  The text in RFC 5080 clearly says that State is used to tie an \"Authorize Only\" request to a previous authentication.  The text requiring State in \"Authorize Only\" is surrounded by explanations describing *why* it's required.\r\n\r\nThe original text in RFC 6519 appears to say that adding State magically satisfies the requirements of 5080.  But it ignores all of the surrounding text.\r\n\r\nThe NAS can't simply invent a State attribute, to satisfy the requirement of 5080.  It MUST get the State from a previous Access-Accept.  Since there's no previous Access-Accept here, the use of Authorize-Only and State is wrong.\r\n\r\nRFC 2865 suggests the use of \"Service-Type = Call Check\" for this kind of authorization checking:\r\n\r\n      Call Check \r\n\r\n         Used by the NAS in an Access-Request packet to\r\n                          indicate that a call is being received and\r\n                          that the RADIUS server should send back an\r\n                          Access-Accept to answer the call, or an\r\n                          Access-Reject to not accept the call,\r\n                          typically based on the Called-Station-Id or\r\n                          Calling-Station-Id attributes.  It is\r\n                          recommended that such Access-Requests use the\r\n                          value of Calling-Station-Id as the value of\r\n                          the User-Name",
    "submit_date": "2012-10-08",
    "submitter_name": "Alan DeKok",
    "verifier_id": 117,
    "verifier_name": "Ralph Droms",
    "update_date": "2019-09-10 09:09:03"
  }
]
