[
  {
    "errata_id": "3095",
    "doc-id": "RFC6410",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "2.2",
    "orig_text": "   After review and consideration of significant errata, the IESG will\r\n   perform an IETF-wide Last Call of at least four weeks on the\r\n   requested reclassification.  If there is consensus for\r\n   reclassification, the RFC will be reclassified without publication of\r\n   a new RFC.\r\n",
    "correct_text": "   After review and consideration of significant errata, the IESG will\r\n   perform an IETF-wide Last Call of at least four weeks on the\r\n   requested reclassification.  If there is consensus for\r\n   reclassification, the RFC will be reclassified with or without\r\n   publication of a new RFC.",
    "notes": "Some people seem to have interpreted this text in a more restrictive manner than intended by the authors.  Advancement from Proposed Standard to Internet Standard does not require the publication of a new RFC.  Reclassification of an existing RFC is allowed, but reclassification in conjunction with publication of a new RFC is also allowed.",
    "submit_date": "2012-01-23",
    "submitter_name": "Russ Housley",
    "verifier_id": "130",
    "verifier_name": "Barry Leiba",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "8083",
    "doc-id": "RFC6410",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "GLOBAL",
    "orig_text": "Updates: 2026",
    "correct_text": "Updates: 2026, 5657",
    "notes": "RFC 5657 was addressed to the requirement for an implementation report for specifications progressing to Draft Standard.  RFC  6410 not only eliminates Draft Standards but quite explicitly eliminates the requirement for implementation reports.  It even goes on to say, in Section 3.2, that the advice in RFC 5657 \"can be helpful to conduct interoperability testing\".    In spite of there being no other discussion of 5657 in 6410, that constitutes an update to 5657 that changes its status and the interpretation of every normative statement in it\r\n\r\nCf errata report 8082.",
    "submit_date": "2024-08-17",
    "submitter_name": "John Klensin",
    "verifier_id": "2",
    "verifier_name": null,
    "update_date": "2024-09-17 12:31:44"
  }
]
