[
  {
    "errata_id": "2622",
    "doc-id": "RFC6011",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "2.3.1.2",
    "orig_text": "   If the DNS request to resolve the Configuration Service Domain name\r\n   to a request URL does not receive any response, the UA should follow\r\n   standard DNS retry procedures.\r\n\r\n   If the DNS request to resolve the Configuration Service Domain name\r\n|  to a host name returns a response that indicates that no matching\r\n|  result is available (NXDOMAIN), the UA SHOULD attempt to obtain\r\n   another Configuration Service Domain name using the procedures in\r\n   Section 2.2, \"Obtaining the Configuration Service Domain\".\r\n",
    "correct_text": "   If the DNS request to resolve the Configuration Service Domain name\r\n   to a request URL does not receive any response, the UA should follow\r\n   standard DNS retry procedures.\r\n\r\n   If the DNS request to resolve the Configuration Service Domain name\r\n|  to a request URL returns a response that indicates that the queried\r\n|  domain does not exist (NXDomain), that no matching result is\r\n|  available at that domain (NoError response with an empty NAPTR RRset\r\n|  in the Answer section), or that a permanent error condition exists\r\n|  (other non-zero RCODE value, e.g., ServFail), the UA SHOULD attempt\r\n   to obtain another Configuration Service Domain name using the\r\n   procedures in Section 2.2, \"Obtaining the Configuration Service\r\n   Domain\".\r\n\r\n",
    "notes": "Rationale:\r\na) This section discusses the U-NAPTR usage; therefore, as in the first\r\n   paragraph, the second paragraph should not erroneously indicate\r\n   a \"host name\" return, it also should precisely indicate that it\r\n   talks about U-NAPTR lookup; hence   s/host name/request URL/ .\r\n\r\nb) It is an unfortunately widespread misconception that a DNS query\r\n   for a RR type that does not exists at a particular domain name\r\n   returns a NXDomain response.  This is not the case.  An empty RRset\r\n   is a valid response returned with RCODE=0 (NoError).  Further, the\r\n   RFC text omits the important error cases that also need to be dealt\r\n   with by the SIP UA configuration procedure.\r\n   The replacement text tries to clarify the different situations\r\n   where no NAPTR record can be obtained.\r\n\r\nc) Use the standard version spelling of DNS RCODE names as registered\r\n   in the \"DNS RCODEs\" sub-registry -- part of\r\n   http://www.IANA.ORG/assignments/dns-parameters.",
    "submit_date": "2010-11-11",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": "123",
    "verifier_name": "Gonzalo Camarillo",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "2623",
    "doc-id": "RFC6011",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "2.4.2",
    "orig_text": "[[ first bullet on page 14: ]]\r\n \r\n  o  If a DNS request to resolve the host name in the request URL\r\n      returns a response that indicates that no matching result is\r\n|     available (NXDOMAIN), the UA MUST remove that request URL from the\r\n      list of alternatives for the Configuration Service Domain.\r\n",
    "correct_text": "   o  If a DNS request to resolve the host name in the request URL\r\n      returns a response that indicates that no matching result is\r\n|     available, the UA MUST remove that request URL from the list of\r\n      alternatives for the Configuration Service Domain.\r\n",
    "notes": "Rationale:\r\n  See the related Errata Note for Section 2.3.1.2 (EID=2622) for\r\n  background and details. Dropping the parenthetical \"NXDOMAIN\"\r\n  here seems to be the most simple way to remove the misleading\r\n  allusion that \"no matching data available\" be equivalent to a\r\n  NXDomain response.",
    "submit_date": "2010-11-11",
    "submitter_name": "Alfred Hoenes",
    "verifier_id": "123",
    "verifier_name": "Gonzalo Camarillo",
    "update_date": "2019-09-10 09:09:03"
  }
]
