[
  {
    "errata_id": "7747",
    "doc-id": "RFC6174",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "4.2.10",
    "orig_text": "An I-D in this state may be under review by the IESG, it may have been approved and be in the RFC Editor's queue, or it may have been published as an RFC.  Other possibilities exist too.  The document may be \"Dead\" (in the IESG state machine) or in a \"Do Not Publish\" state.",
    "correct_text": "An I-D in this state may be under review by the IESG, it may be awaiting or in IETF Last Call,  may have been approved and be in the RFC Editor's queue, or it may have been published as an RFC.  Other possibilities, most of which show less progress, exist too.  For example, the document may be \"Dead\" (in the IESG state machine) or in a \"Do Not Publish\" state.",
    "notes": "I think this is actually an editorial problem in the traditional sense of the term, but it is not \"a spelling, grammar, punctuation, or syntax error\" and hence is probably \"Technical\" as defined above.\r\n\r\nSection 4.2.10 of this document, and hence the description of the corresponding \"WG Status\" entry in the datatracker (<https://datatracker.ietf.org/doc/help/state/draft-stream-ietf/>) leave out the all-important \"In Last Call\" and the states leading up to it.  That is a potential source of confusion for newcomers and even experienced participants who have concentrated more on getting work done than on the intricacies of IETF processes and process-related terminology.    While, because of Appendix A and references to it, the change is less important for this document than for the datatracker excerpt, a change like the above could considerably reduce those opportunities for confusion.\r\n\r\nAt the same time, while I think a fix to the datatracker is fairly important, I believe this change should be relatively low priority unless someone insists that the datatracker material cannot be changed without updating this document.",
    "submit_date": "2024-01-01",
    "submitter_name": "John Klensin",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  }
]
