[
  {
    "errata_id": 4703,
    "doc-id": "RFC7841",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": 3.2,
    "orig_text": null,
    "correct_text": null,
    "notes": "Sections 3.3 through 3.6 should have been subsections of 3.2, as they describe parts of \"status of this memo\". See also RFC 5741 which has this right.",
    "submit_date": "2016-05-30",
    "submitter_name": "Julian Reschke",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5248,
    "doc-id": "RFC7841",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": "A.2.2",
    "orig_text": "Documents approved for publication\r\nby the [stream approver -- currently, one of: \"IAB\",\r\n\"IRSG\", or \"RFC Editor\"] are not a candidate for any level of\r\nInternet Standard; ...",
    "correct_text": "Documents approved for publication by the [stream approver\r\n-- currently, one of: \"IAB\", \"IRSG\", or \"RFC Editor\"] are\r\nnot candidates for any level of Internet Standard; ...",
    "notes": "--- Verifier Notes : The originally submitted \"Corrected Text\" is below. The Corrected Text was edited to make it clear which option was chosen. ---\r\n\r\nDocuments approved for publication by the [stream approver\r\n-- currently, one of: \"IAB\", \"IRSG\", or \"RFC Editor\"] are\r\nnot candidates for any level of Internet Standard; ...\r\n\r\n--or--\r\n\r\nA document approved for publication by the [stream approver\r\n-- currently, one of: \"IAB\", \"IRSG\", or \"RFC Editor\"] is \r\nnot a candidate for any level of Internet Standard; ...\r\n\r\n--- End Verifier Notes ---\r\nThe present sentence is egregiously bad English, at roughly the \"every fourth-grader is English-speaking countries is expected to know better\" level.  Having it in this document and, because of what it specifies, in every non-IETF-stream RFC, reflects badly on the IAB, the RFC Editor, and the RFC Series.  In addition, because we do not explicitly differentiate between boilerplate text and text supplied and approved by authors, it may reflect badly on individual document  authors.   \r\n\r\nIf it is not possible for this erratum to be quickly reviewed and approved, with the RFC Editor allowed to make this (and if necessary other) clearly editorial change to boilerplate text for documents published after today, I suggest that explicit notes be added to \"Status of this Memo\" sections going forward that identify the boilerplate text  and its sources.  For example, a new first sentence should be added immediately after \"Status of this Memo\"  that says \"This section and the one on Copyright that follows, are as specified by the Internet Architecture Board [RFC7841] and the Trustees of the IETF Trust.\"\r\n\r\nThe problem identified here may suggest that, when 7841 and similar documents are revised, it may be better to establish principles and leave specific text to agreements between the relevant bodies and the RFC  Editor rather than building exact text to be used into archival and hard-to-revise documents.",
    "submit_date": "2018-01-31",
    "submitter_name": "John Klensin",
    "verifier_id": 118,
    "verifier_name": "Robert Sparks",
    "update_date": "2019-09-10 09:09:03"
  }
]
