[
  {
    "errata_id": "7237",
    "doc-id": "RFC7141",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "2",
    "orig_text": "2.2.  Recommendation on Encoding Congestion Notification\r\n\r\n   When encoding congestion notification (e.g., by drop, ECN, or PCN),\r\n   the probability that network equipment drops or marks a particular\r\n   packet to notify congestion SHOULD NOT depend on the size of the\r\n   packet in question.\r\n[...]\r\n2.3.  Recommendation on Responding to Congestion\r\n\r\n   When a transport detects that a packet has been lost or congestion\r\n   marked, it SHOULD consider the strength of the congestion indication\r\n   as proportionate to the size in octets (bytes) of the missing or\r\n   marked packet.\r\n\r\n   In other words, when a packet indicates congestion (by being lost or\r\n   marked), it can be considered conceptually as if there is a\r\n   congestion indication on every octet of the packet, not just one\r\n   indication per packet.\r\n\r\n   To be clear, the above recommendation solely describes how a\r\n   transport should interpret the meaning of a congestion indication, as\r\n   a long term goal.  It makes no recommendation on whether a transport\r\n   should act differently based on this interpretation.  It merely aids\r\n   interoperability between transports, if they choose to make their\r\n   actions depend on the strength of congestion indications.",
    "correct_text": "I am not sure the text is actually salvageable, as it appears ti be a logic disconnect at the core of the recommendations.",
    "notes": "The recommendations seem not self consistent:\r\nA) Section 2.2.  recommends that CE marking should be made independent of packet size, so a CE-mark carries no information about packet size.\r\n\r\nB) Section 2.3 then recommends to use the size of marked packets as direct indicators of congestion strength.\r\n\r\nC) Section 2.3 then later clarifies that transports should interpret the size of CE-marked packets as correlate for congestion strength but are in no way required to take this interpretation into account when acting based on the congestion signal.\r\n\r\n\r\nThis has several problems:\r\n1) A) and B) are in direct contradiction to each other. If we ask marking nodes to ignore packet size while marking, but end nodes to take it into account we basically create random congestion strength \"information\" by the pure chance of a specific packet of a specific size \"catching\" a CE mark. At which point we might as well simply draw a random number at the end-point to interpret congestion strength (except that packet sizes are not distributed randomly).\r\n\r\n2) Asking endpoints to interpret CE_marks in this way but not act on it, is hardly actionable advice for potential implementers. If we can not recommend a specific way, we should refrain from offering recommendations at all to keep things as simple as reasonably possible.",
    "submit_date": "2022-11-03",
    "submitter_name": "Sebastian Moeller",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  }
]
