[
  {
    "errata_id": 4822,
    "doc-id": "RFC7931",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": 5.8,
    "orig_text": "Note that the NFSv4.0 specification requires the server to make \r\nsure that such verifiers are very unlikely to be regenerated.\r\nGiven that it is already highly unlikely that the clientid4 XC is \r\nduplicated by distinct servers, the probability that SCn is \r\nduplicated as well has to be considered vanishingly small.  Note \r\nalso that the callback update procedure can be repeated multiple \r\ntimes to reduce the probability of further spurious matches.",
    "correct_text": "Although the NFSv4.0 specification requires the server to make \r\nsure that such verifiers are very unlikely to be regenerated, \r\ndifferent servers may use the same approach to the construction \r\nof such verifiers, raising the probability that two distinct \r\nservers might inadvertently assign the same verifier value. The \r\nfact that the servers in question have assigned the same \r\nclientid4 may raise this probability.  In order to guard \r\nagainst the possibility that such assignments might cause two \r\ndistinct servers to be incorrectly considered the same, \r\nthe SETCLIENTID procedure mentioned above needs to be repeated.  \r\nRepeating the procedure once  is sufficient to ensure that the \r\nsuccessive confirm values SCn, SCn'  generated by these repeated \r\nSETCLIENTID operations cannot all collide with a verifier \r\npreviously received by the client when communicating with IPn.",
    "notes": "It appears that the original text underestimated the probability inadvertant of duplication of clientid4's and verifiers.  Existing servers while conforming to to RFC7530, may generate the same sequence of clientid4's when they all happen to be rebooted at the same time.  The new text deals with this possibility and ensures that two different servers cannot be considered the same.",
    "submit_date": "2016-10-06",
    "submitter_name": "David Noveck",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  }
]
