[
  {
    "errata_id": 5621,
    "doc-id": "RFC7482",
    "errata_status_code": "Verified",
    "errata_type_code": "Editorial",
    "section": 2.1,
    "orig_text": "IDN: Internationalized Domain Name\r\n\r\nIDNA: Internationalized Domain Names in Applications, a protocol\r\n      for the handling of IDNs.",
    "correct_text": "IDN: Internationalized Domain Name, a [fully-qualified] domain name\r\ncontaining one or more labels that are intended to include one or more\r\nUnicode code points outside the ASCII range (cf. \"domain name\",\r\n\"fully-qualified domain name\" and \"internationalized domain name\" in\r\nRFC 8499).\r\n\r\nIDNA: Internationalized Domain Names in Applications, a protocol for\r\nthe handling of IDNs.  In this document, \"IDNA\" refers specifically to\r\nthe version of those specifications known as \"IDNA2008\" [RFC5980].\r\n",
    "notes": "While the proposed new text above borders on the painfully pedantic, failure to be specific about these things undermines the technical validity and consistency of the text (making this a technical issue rather than exclusively an editorial one like a missing reference).  IDNA2008 [RFC5890 Section 2.3.2.3] is very precise about what an \"IDN\" is (a definition incorporated by reference in RFC 6365 and consistent with the definition in RFC 8499) , but there are other things around that, e.g., assume either that \"IDN\" refers to a label, not an FQDN; that an ASCII label, even one in ACE form, does not make the FQDN in which it is imbedded an IDN; that all of the label components of an IDN must be U-labels or A-labels, etc.  Without the definition being clear, some of the statements in the document make no sense.\r\n\r\nA reference to 8499 is suggested above because it is the most recent authoritative definition (and because I didn't write it), but 5980 would be equally legitimate if the authors prefer.\r\n\r\nPinning down the IDNA definition is even more important.  While there are IDNA2008 references further on in the document, if the question of what the generic term \"IDNA\" means is left to the imagination of the reader, then the specification is missing language about what to do if, e.g., a query is inconsistent with the U-label form of what is stored in the registry database without mapping.   The opportunity for that sort of problem is clearly created by the \"performs any local case mapping deemed necessary\" statement in Section 6.1 of the document, at least unless that case mapping is constrained to not be applied to domain name labels (which the text definitely does not say).",
    "submit_date": "2019-02-01",
    "submitter_name": "John Klensin",
    "verifier_id": 154,
    "verifier_name": "Adam Roach",
    "update_date": "2019-09-10 09:09:03"
  }
]
