[
  {
    "errata_id": "5181",
    "doc-id": "RFC7725",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "3",
    "orig_text": "   Link: <https://spqr.example.org/legislatione>; rel=\"blocked-by\"\r\n",
    "correct_text": "   Link: <https://search.example.net/legal>; rel=\"blocked-by\"\r\n",
    "notes": "Of course, it is hard to say from just an URL but it seems that the original \"blocked-by\" mentioned the authority requesting the blocking (spqr = Roman Senate and People) while the text in section 4 says \"The intent is that the header be used to identify the entity actually implementing blockage, not any other entity mandating it.\"\r\n\r\nExperience with the 451 crawler during the IETF 99 hackathon showed that several implementors got this wrong and used a \"blocked-by\" indicating the authority.\r\n\r\n[It could be a good idea to have two links, one for the authority and one for the implementor, but this is outside the scope of this errata.]",
    "submit_date": "2017-11-11",
    "submitter_name": "Stéphane Bortzmeyer",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "5512",
    "doc-id": "RFC7725",
    "errata_status_code": "Reported",
    "errata_type_code": "Editorial",
    "section": "3",
    "orig_text": "Note that in many cases clients can still access the denied resource\r\nby using technical countermeasures such as a VPN or the Tor network.",
    "correct_text": "(remove the sentence)",
    "notes": "I understand that the status code itself is kind of a joke (Fahrenheit 451), but the sentence above seems to have no place in a technical document. It provides no insight into use cases for either a client or implementing software.",
    "submit_date": "2018-10-02",
    "submitter_name": "Curt Self",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": "5969",
    "doc-id": "RFC7725",
    "errata_status_code": "Rejected",
    "errata_type_code": "Editorial",
    "section": "3",
    "orig_text": "This status code indicates that the server is denying access to the\r\nresource as a consequence of a legal demand.",
    "correct_text": "This status code indicates that the server is denying access to the\r\nresource as a consequence of a legal demand or contractual restrictions to content.",
    "notes": "There are many cases where documents are not available in a part of the world because of contractual obligations, rather than legal ones.\r\n\r\nFor example, a television network may only have the rights to stream a video in a specific country. This is a legal requirement to comply with a contract. Visitors from other countries should receive an HTTP 451.\n --VERIFIER NOTES-- \nThis is not an erratum: the document says what it was intended to say at the time it was written.",
    "submit_date": "2020-01-29",
    "submitter_name": "Robert Rothenberg",
    "verifier_id": "130",
    "verifier_name": "Barry Leiba",
    "update_date": "2020-01-29 09:20:14"
  }
]
