[
  {
    "errata_id": 6631,
    "doc-id": "RFC8920",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": 5,
    "orig_text": "OLD\r\n\r\nIf link attributes are advertised with zero-length Application\r\nIdentifier Bit Masks for both standard applications and user-defined\r\napplications, then any standard application and/or any user-defined\r\napplication is permitted to use that set of link attributes. If\r\nsupport for a new application is introduced on any node in a network\r\nin the presence of such advertisements, these advertisements are\r\npermitted to be used by the new application. If this is not what is\r\nintended, then existing advertisements MUST be readvertised with an\r\nexplicit set of applications specified before a new application is\r\nintroduced.\r\n\r\nAn application-specific advertisement (Application Identifier Bit Mask\r\nwith a matching Application Identifier Bit set) for an attribute MUST\r\nalways be preferred over the advertisement of the same attribute with\r\nthe zero-length Application Identifier Bit Masks for both standard\r\napplications and user-defined applications on the same link.",
    "correct_text": "NEW\r\n\r\nLink attributes MAY be advertised associated with zero-length\r\nApplication Identifier Bit Masks for both standard applications\r\nand user-defined applications. Such link attribute advertisements\r\nMUST be used by standard applications and/or user defined applications\r\nwhen no link attribute advertisements with a non-zero-length\r\nApplication Identifier Bit Mask and a matching Application Identifier\r\nBit set are present for a given link. Otherwise, such link attribute\r\nadvertisements MUST NOT be used.",
    "notes": "RFC 8920 defines advertising link attributes with zero\r\nlength Standard Application Bit Mask (SABM) and zero length User\r\nDefined ApplicationBit Mask (UDABM) as a means of advertising link\r\nattributes that can be used by any application. However, the text uses\r\nthe word \"permitted\", suggesting that the use of such advertisements\r\nis \"optional\". Such an interpretation could lead to interoperability\r\nissues and is not what was intended.\r\n\r\nThe replacement text below makes explicit the specific conditions when\r\nsuch advertisements MUST be used and the specific conditions under\r\nwhich they MUST NOT be used.",
    "submit_date": "2021-07-05",
    "submitter_name": "Les Ginsberg",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": null
  }
]
