[
  {
    "errata_id": 6528,
    "doc-id": "RFC8166",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "4.2.4",
    "orig_text": "A Requester MUST NOT send an RPC-over-RDMA header with the RDMA_ERROR\r\nprocedure.  A Responder MUST silently discard RDMA_ERROR procedures",
    "correct_text": "An RDMA_ERROR header cannot be sent without an assurance that, the receiver \r\nhas posted a receive operation which its sending will satisfy.  In most cases, \r\nthis means that a Requester (i.e. one sending RPC Calls) MUST NOT send an \r\nRPC-over-RDMA header with the RDMA_ERROR procedure.  Similarly, a Responder \r\n(i.e. one sending RPC Replies) MUST silently discard RDMA_ERROR procedures.\r\n\r\nHowever, in the case of providing an RDMA_ERROR headers containing an error \r\ncode of ERR_VERS, such a schema is not realizable, since there is no way for\r\na receiver who does not support a particular version, to determine whether \r\nan RPC Call or Reply is being sent, leaving the receiver uncertain as to whether \r\nit is being Addressed as a Requester or a Responder, leaving it unable to\r\nparticipate in version negotiation.  In the case of version errors, the\r\nimplementation is to rely on the assumption that  forward direction requests \r\nare being done and reserve direction requests only done once the version is\r\nproperly negotiated.   As a result, such messages MUST NOT be sent by the \r\nclient and MUST be silently discarded by servers.",
    "notes": "Even if one feels that this is not an appropriate correction, the existing text must be fixed somehow.   In assuming that the terms Requester and Responder can be used this way in this context is likely to result in some implementers concluding that version errors can never be sent while other might be unabble to coonclude that given the effort expended in the spec to make such errors be interpretable by anf rpc-over-rdma version.",
    "submit_date": "2021-04-12",
    "submitter_name": "David Noveck",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": null
  }
]
