[
  {
    "errata_id": "8165",
    "doc-id": "RFC8129",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "GLOBAL",
    "orig_text": "\r\n\r\n\r\n\r\n\r\n\r\nInternet Engineering Task Force (IETF)                        S. Bradner\r\nRequest for Comments: 8179                            Harvard University\r\nBCP: 79                                                     J. Contreras\r\nObsoletes: 3979, 4879                                 University of Utah\r\nUpdates: 2026                                                   May 2017\r\nCategory: Best Current Practice\r\nISSN: 2070-1721\r\n\r\n\r\n            Intellectual Property Rights in IETF Technology\r\n\r\nAbstract\r\n\r\n   The IETF policies about Intellectual Property Rights (IPR), such as\r\n   patent rights, relative to technologies developed in the IETF are\r\n   designed to ensure that IETF working groups and participants have as\r\n   much information as possible about any IPR constraints on a technical\r\n   proposal as early as possible in the development process.  The\r\n   policies are intended to benefit the Internet community and the\r\n   public at large, while respecting the legitimate rights of IPR\r\n   holders.  This document sets out the IETF policies concerning IPR\r\n   related to technology worked on within the IETF.  It also describes\r\n   the objectives that the policies are designed to meet.  This document\r\n   updates RFC 2026 and, with RFC 5378, replaces Section 10 of RFC 2026.\r\n   This document also obsoletes RFCs 3979 and 4879.\r\n\r\nStatus of This Memo\r\n\r\n   This memo documents an Internet Best Current Practice.\r\n\r\n   This document is a product of the Internet Engineering Task Force\r\n   (IETF).  It represents the consensus of the IETF community.  It has\r\n   received public review and has been approved for publication by the\r\n   Internet Engineering Steering Group (IESG).  Further information on\r\n   BCPs is available in Section 2 of RFC 7841.\r\n\r\n   Information about the current status of this document, any errata,\r\n   and how to provide feedback on it may be obtained at\r\n   http://www.rfc-editor.org/info/rfc8179.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 1]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\nCopyright Notice\r\n\r\n   Copyright (c) 2017 IETF Trust and the persons identified as the\r\n   document authors.  All rights reserved.\r\n\r\n   This document is subject to BCP 78 and the IETF Trust's Legal\r\n   Provisions Relating to IETF Documents\r\n   (http://trustee.ietf.org/license-info) in effect on the date of\r\n   publication of this document.  Please review these documents\r\n   carefully, as they describe your rights and restrictions with respect\r\n   to this document.  Code Components extracted from this document must\r\n   include Simplified BSD License text as described in Section 4.e of\r\n   the Trust Legal Provisions and are provided without warranty as\r\n   described in the Simplified BSD License.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 2]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\nTable of Contents\r\n\r\n   1. Definitions  . . . . . . . . . . . . . . . . . . . . . . . . .  4\r\n   2. Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  6\r\n   3. Participation in the IETF  . . . . . . . . . . . . . . . . . .  8\r\n   3.1. General Policy   . . . . . . . . . . . . . . . . . . . . . .  8\r\n   3.2. Rights and Permissions in Contributions. . . . . . . . . . .  8\r\n   3.3. Obligations on Participants  . . . . . . . . . . . . . . . .  8\r\n   4.  Actions for Documents for Which IPR Disclosure(s)\r\n       Have Been Received  . . . . . . . . . . . . . . . . . . . . .  8\r\n   5. IPR Disclosures  . . . . . . . . . . . . . . . . . . . . . . . 10\r\n   5.1. Who Must Make an IPR Disclosure? . . . . . . . . . . . . . . 10\r\n   5.1.1.  A Contributor's IPR in His or Her Contribution  . . . . . 10\r\n   5.1.2. An IETF Participant's IPR in Contributions by Others   . . 10\r\n   5.1.3. IPR of Others  . . . . . . . . . . . . . . . . . . . . . . 10\r\n   5.2. The Timing of Providing Disclosure . . . . . . . . . . . . . 11\r\n   5.2.1. Timing of Disclosure under Section 5.1.1 . . . . . . . . . 11\r\n   5.2.2. Timing of Disclosure under Section 5.1.2 . . . . . . . . . 11\r\n   5.2.3. Timing of Disclosure by ADs and Others . . . . . . . . . . 12\r\n   5.3. How Must an IPR Disclosure be Made?  . . . . . . . . . . . . 12\r\n   5.4. What Must be in an IPR Disclosure? . . . . . . . . . . . . . 12\r\n   5.4.1. Content of IPR Disclosures . . . . . . . . . . . . . . . . 12\r\n   5.4.2. Updating IPR Disclosures . . . . . . . . . . . . . . . . . 12\r\n   5.4.3. Blanket IPR Statements . . . . . . . . . . . . . . . . . . 13\r\n   5.5. Licensing Information in an IPR Disclosure . . . . . . . . . 14\r\n   5.6. Level of Control over IPR Requiring Disclosure . . . . . . . 15\r\n   5.7. Disclosures for Oral Contributions . . . . . . . . . . . . . 15\r\n   5.8.  General Disclosures . . . . . . . . . . . . . . . . . . . . 15\r\n   6. Failure to Disclose  . . . . . . . . . . . . . . . . . . . . . 16\r\n   7. Evaluating Alternative Technologies in IETF Working Groups . . 17\r\n   8. Change Control for Technologies  . . . . . . . . . . . . . . . 19\r\n   9. Licensing Requirements to Advance Standards Track\r\n      IETF Documents . . . . . . . . . . . . . . . . . . . . . . . . 19\r\n   10. No IPR Disclosures in IETF Documents  . . . . . . . . . . . . 19\r\n   11. Application to Non-IETF Stream Documents  . . . . . . . . . . 19\r\n   12. Security Considerations   . . . . . . . . . . . . . . . . . . 20\r\n   13. Changes since RFCs 3979 and 4879  . . . . . . . . . . . . . . 20\r\n   14. References  . . . . . . . . . . . . . . . . . . . . . . . . . 25\r\n   14.1. Normative References  . . . . . . . . . . . . . . . . . . . 25\r\n   14.2. Informative References  . . . . . . . . . . . . . . . . . . 26\r\n   Editors' Addresses  . . . . . . . . . . . . . . . . . . . . . . . 26\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 3]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n1.  Definitions\r\n\r\n   The following definitions are for terms used in the context of this\r\n   document.  Other terms, including \"IESG,\" \"ISOC,\" \"IAB,\" and \"RFC\r\n   Editor,\" are defined in [RFC2028].\r\n\r\n   a. \"Alternate Stream\":  the IAB Document Stream, the IRTF Document\r\n      Stream, and the Independent Submission Stream, each as defined in\r\n      Section 5.1 of [RFC4844], along with any future non-IETF streams\r\n      that might be defined.\r\n\r\n   b. \"Blanket IPR Statement\" or \"Blanket Disclosure\": see Section\r\n      5.4.3.\r\n\r\n   c. \"Contribution\": any submission to the IETF intended by the\r\n      Contributor for publication as all or part of an Internet-Draft or\r\n      RFC and any statement made within the context of an IETF activity,\r\n      in each case that is intended to affect the IETF Standards Process\r\n      or that is related to the activity of an Alternate Stream that has\r\n      adopted this policy.\r\n\r\n      Such statements include oral statements, as well as written and\r\n      electronic communications, which are addressed to:\r\n\r\n      o  any IETF plenary session,\r\n\r\n      o  any IETF working group (WG; see BCP 25) or portion thereof or\r\n         any WG chair on behalf of the relevant WG,\r\n\r\n      o  any IETF \"birds of a feather\" (BOF) session or portion thereof,\r\n\r\n      o  WG design teams (see BCP 25) and other design teams that intend\r\n         to deliver an output to IETF, or portions thereof,\r\n\r\n      o  the IESG, or any member thereof on behalf of the IESG,\r\n\r\n      o  the IAB, or any member thereof on behalf of the IAB,\r\n\r\n      o  any IETF mailing list, web site, chat room, or discussion board\r\n         operated by or under the auspices of the IETF, including the\r\n         IETF list itself,\r\n\r\n      o  the RFC Editor or the Internet-Drafts function.\r\n\r\n      Statements made outside of an IETF session, mailing list, or other\r\n      function, or that are clearly not intended to be input to an IETF\r\n      activity, group, or function, are not Contributions in the context\r\n      of this document.  And while the IETF's IPR rules apply in all\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 4]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      cases, not all presentations represent a Contribution.  For\r\n      example, many invited plenary, area-meeting, or research group\r\n      presentations will cover useful background material, such as\r\n      general discussions of existing Internet technology and products,\r\n      and will not be a Contribution.  (Some such presentations can\r\n      represent a Contribution as well, of course).  Throughout this\r\n      document, the term \"written Contribution\" is used.  For purposes\r\n      of this document, \"written\" means reduced to a written or visual\r\n      form in any language and any media, permanent or temporary,\r\n      including but not limited to traditional documents, email\r\n      messages, discussion board postings, slide presentations, text\r\n      messages, instant messages, and transcriptions of oral statements.\r\n\r\n   d. \"Contributor\": an individual submitting a Contribution\r\n\r\n   e. \"Covers\" or \"Covered\": a valid claim of a patent or a patent\r\n      application (including a provisional patent application) in any\r\n      jurisdiction, or any other Intellectual Property Right, would\r\n      necessarily be infringed by the exercise of a right (e.g., making,\r\n      using, selling, importing, distribution, copying, etc.) with\r\n      respect to an Implementing Technology.  For purposes of this\r\n      definition, \"valid claim\" means a claim of any unexpired patent or\r\n      patent application which shall not have been withdrawn, cancelled,\r\n      or disclaimed, nor held invalid by a court of competent\r\n      jurisdiction in an unappealed or unappealable decision.\r\n\r\n   f. \"General Disclosure\": see Section 5.8.\r\n\r\n   g. \"IETF\": In the context of this document, the IETF includes all\r\n      individuals who participate in meetings, working groups, mailing\r\n      lists, functions, and other activities that are organized or\r\n      initiated by ISOC, the IESG, or the IAB under the general\r\n      designation of the Internet Engineering Task Force, or IETF, but\r\n      solely to the extent of such participation.\r\n\r\n   h. \"IETF Documents\": RFCs and Internet-Drafts that are published as\r\n      part of the IETF Standards Process.  These are also referred to as\r\n      \"IETF Stream Documents\" as defined in Section 5.1.1 of [RFC4844].\r\n\r\n   i. \"IETF Standards Process\": the activities undertaken by the IETF in\r\n      any of the settings described in the above definition of\r\n      Contribution.  The IETF Standards Process may include\r\n      participation in activities and publication of documents that are\r\n      not directed toward the development of IETF standards or\r\n      specifications, such as the development and publication of\r\n      Informational and Experimental documents (see Section 4 of\r\n      [RFC2026]).\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 5]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   j. \"IPR\" or \"Intellectual Property Rights\": means a patent, utility\r\n      model, or similar right that may Cover an Implementing Technology,\r\n      whether such rights arise from a registration or renewal thereof,\r\n      or an application therefore, in each case anywhere in the world.\r\n      See [RFC5378] for a discussion of trademarks.\r\n\r\n   k. \"Implementing Technology\": a technology that implements an IETF\r\n      specification or standard.\r\n\r\n   l. \"Internet-Draft\": a document used in the IETF and RFC Editor\r\n      processes, as described in Section 2.2 of [RFC2026].\r\n\r\n   m. \"Participating in an IETF discussion or activity\": making a\r\n      Contribution, as described above, or in any other way acting in\r\n      order to influence the outcome of a discussion relating to the\r\n      IETF Standards Process.  Without limiting the generality of the\r\n      foregoing, acting as a Working Group Chair or Area Director\r\n      constitutes \"Participating\" in all activities of the relevant\r\n      working group(s) he or she is responsible for in an area.\r\n      \"Participant\" and \"IETF Participant\" mean any individual\r\n      Participating in an IETF discussion or activity.\r\n\r\n   m. \"Reasonably and personally known\": something an individual knows\r\n      personally or, because of the job the individual holds, would\r\n      reasonably be expected to know.  This wording is used to indicate\r\n      that an organization cannot purposely keep an individual in the\r\n      dark about patents or patent applications just to avoid the\r\n      disclosure requirement.  But this requirement should not be\r\n      interpreted as requiring the IETF Contributor or Participant (or\r\n      his or her represented organization, if any) to perform a patent\r\n      search to find applicable IPR.\r\n\r\n   o. \"RFC\": the basic publication series for the IETF.  RFCs are\r\n      published by the RFC Editor.  (See Section 2.1 of [RFC2026].)\r\n\r\n2.  Introduction\r\n\r\n   The IETF policies about Intellectual Property Rights (IPR), such as\r\n   patent rights, relative to technologies developed in the IETF are\r\n   designed to ensure that IETF working groups and Participants have as\r\n   much information as possible about any IPR constraints on a technical\r\n   proposal as early as possible in the development process.  The\r\n   policies are intended to benefit the Internet community and the\r\n   public at large, while respecting the legitimate rights of IPR\r\n   holders.  This document details the IETF policies concerning IPR\r\n   related to technology worked on within the IETF.  It also describes\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 6]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   the objectives that the policies are designed to meet.  This document\r\n   updates RFC 2026 and, with RFC 5378, replaces Section 10 of RFC 2026.\r\n   This document also obsoletes RFC 3979 and RFC 4879.\r\n\r\n   There are three basic principles regarding how the IETF deals with\r\n   claims of Intellectual Property Rights (originally outlined in\r\n   Section 10 of [RFC2026]):\r\n\r\n   (a) The IETF will make no determination about the validity of any\r\n       particular IPR claim.\r\n\r\n   (b) The IETF, following normal processes, can decide to use\r\n       technology for which IPR disclosures have been made if it decides\r\n       that such a use is warranted.\r\n\r\n   (c) In order for a working group and the rest of the IETF to have the\r\n       information needed to make an informed decision about the use of\r\n       a particular technology, all those contributing to the working\r\n       group's discussions must disclose the existence of any IPR the\r\n       Contributor or any other IETF Participant believes Covers or may\r\n       ultimately Cover the technology under discussion.  This applies\r\n       to both Contributors and other Participants, and applies whether\r\n       they contribute in person, via email, or by other means.  The\r\n       requirement applies to all IPR of the Participant, the\r\n       Participant's employer, sponsor, or others represented by the\r\n       Participant that are reasonably and personally known to the\r\n       Participant.  No patent search is required.\r\n\r\n   Section 1 defines the terms used in this document.  Sections 3\r\n   through 11 set forth the IETF's policies and procedures relating to\r\n   IPR.  Section 13 lists the changes between this document and RFCs\r\n   3979 and 4879.  A separate document [RFC5378] deals with rights (such\r\n   as copyrights and trademarks) in Contributions, including the right\r\n   of the IETF and IETF Participants to publish and create derivative\r\n   works of those Contributions.  This document is not intended to\r\n   address those issues.  See RFC 6702 [RFC6702] for a discussion of\r\n   \"Promoting Compliance with Intellectual Property Rights (IPR)\r\n   Disclosure Rules\".\r\n\r\n   This document is not intended as legal advice.  Readers are advised\r\n   to consult their own legal advisors if they would like a legal\r\n   interpretation of their rights or the rights of the IETF in any\r\n   Contributions they make.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 7]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n3.  Participation in the IETF\r\n\r\n3.1.  General Policy\r\n\r\n   In all matters relating to Intellectual Property Rights, the intent\r\n   is to benefit the Internet community and the public at large, while\r\n   respecting the legitimate rights of others.  The disclosures required\r\n   by this policy are intended to help IETF working groups define\r\n   superior technical solutions with the benefit of as much information\r\n   as reasonably possible about potential IPR claims relating to\r\n   technologies under consideration.\r\n\r\n3.2.  Rights and Permissions in Contributions\r\n\r\n   By submission of a Contribution, each person actually submitting the\r\n   Contribution, and each named co-Contributor, is deemed to agree to\r\n   the following terms and conditions on his or her own behalf and on\r\n   behalf of the organizations the Contributor represents or is\r\n   sponsored by (if any) when submitting the Contribution.\r\n\r\n3.3.  Obligations on Participants\r\n\r\n   By Participating in the IETF, each Participant is deemed to agree to\r\n   comply with all requirements of this RFC that relate to Participation\r\n   in IETF activities.  Without limiting the foregoing, each Participant\r\n   that is a Contributor makes the following representations to the\r\n   IETF:\r\n\r\n   A. Such Contributor represents that he or she has made or will\r\n      promptly make all disclosures required by Section 5.1.1 of this\r\n      document.\r\n\r\n   B. Such Contributor represents that there are no limits to the\r\n      Contributor's ability to make the grants, acknowledgments, and\r\n      agreements herein that are reasonably and personally known to the\r\n      Contributor.\r\n\r\n4.  Actions for Documents for Which IPR Disclosure(s) Have Been Received\r\n\r\n   A. The IESG, IAB, ISOC, and IETF Trust disclaim any responsibility\r\n      for identifying the existence of or for evaluating the\r\n      applicability of any IPR, disclosed or otherwise, to any IETF\r\n      technology, specification, or standard, and will take no position\r\n      on the validity or scope of any such IPR.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 8]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   B. When the IETF Secretariat has received a notification under\r\n      Section 5.1.3 of the existence of non-participant IPR that\r\n      potentially Covers a technology under discussion at IETF or which\r\n      is the subject of an IETF Document, the IETF Secretariat shall\r\n      promptly publish such notification and will request that the\r\n      identified third party make an IPR disclosure in accordance with\r\n      the provisions of Section 5.\r\n\r\n   C. When an IPR disclosure has been made as provided in Section 5 of\r\n      this document, the IETF Secretariat may request from the purported\r\n      holder of such IPR a written assurance that upon approval by the\r\n      IESG for publication of the relevant IETF specification(s) as one\r\n      or more RFCs, all persons will be able to obtain the right to\r\n      implement, use, distribute, and exercise other rights with respect\r\n      to Implementing Technology under one of the licensing options\r\n      specified in Section 5.5.A below unless a statement identifying\r\n      one of the licensing options described in Section 5.5.A has\r\n      already been received by the IETF Secretariat.  The working group\r\n      proposing the use of the technology with respect to which the\r\n      Intellectual Property Rights are disclosed may assist the IETF\r\n      Secretariat in this effort.\r\n\r\n      The results of this procedure shall not, in themselves, block\r\n      publication of an IETF Document or advancement of an IETF Document\r\n      along the Standards Track.  A working group may take into\r\n      consideration the results of this procedure in evaluating the\r\n      technology, and the IESG may defer approval when a delay may\r\n      facilitate obtaining such assurances.  The results will, however,\r\n      be recorded by the IETF Secretariat and be made available online.\r\n\r\n   D. The IESG will not make any determination that any terms for the\r\n      use of an Implementing Technology (e.g., the assurance of\r\n      reasonable and non-discriminatory terms) have been fulfilled in\r\n      practice.  It will instead apply the normal requirements for the\r\n      advancement of Internet Standards (see RFC 6410).  If the two\r\n      unrelated implementations of the specification that are required\r\n      to advance from Proposed Standard to Internet Standard have been\r\n      produced by different organizations or individuals, or if the\r\n      \"significant implementation and successful operational experience\"\r\n      required to advance from Proposed Standard to Internet Standard\r\n      has been achieved, the IESG will presume that the terms are\r\n      reasonable and to some degree non-discriminatory.  Note that this\r\n      also applies to the case where multiple implementers have\r\n      concluded that no licensing is required.\r\n\r\n      This presumption may be challenged at any time, including during\r\n      the Last Call period by sending email to the IESG.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 9]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n5.  IPR Disclosures\r\n\r\n   This document refers to the IETF Participant making disclosures,\r\n   consistent with the general IETF philosophy that Participants in the\r\n   IETF act as individuals.  A Participant's obligation to make a\r\n   disclosure is also considered satisfied if the IPR owner, which may\r\n   be the Participant's employer or sponsor, makes an appropriate\r\n   disclosure in place of the Participant doing so.\r\n\r\n5.1.  Who Must Make an IPR Disclosure?\r\n\r\n5.1.1.  A Contributor's IPR in His or Her Contribution\r\n\r\n   Any Contributor who reasonably and personally knows of IPR meeting\r\n   the conditions of Section 5.6 which the Contributor believes Covers\r\n   or may ultimately Cover his or her written Contribution that is\r\n   intended to be used as an input into the IETF Standards Process, or\r\n   which the Contributor reasonably and personally knows his or her\r\n   employer or sponsor may assert against Implementing Technologies\r\n   based on such written Contribution, must make a disclosure in\r\n   accordance with Section 5.\r\n\r\n5.1.2.  An IETF Participant's IPR in Contributions by Others\r\n\r\n   If an individual's Participation relates to a written Contribution\r\n   made by somebody else that is intended to be used as an input into\r\n   the IETF Standards Process, and such Participant reasonably and\r\n   personally knows of IPR meeting the conditions of Section 5.6 which\r\n   the Participant believes Covers or may ultimately Cover that\r\n   Contribution, or which the Participant reasonably and personally\r\n   knows his or her employer or sponsor may assert against Implementing\r\n   Technologies based on such written Contribution, then such\r\n   Participant must make a disclosure in accordance with Section 5.\r\n\r\n5.1.3.  Voluntary IPR Disclosures\r\n\r\n   If any person has information about IPR that may Cover a technology\r\n   relevant to the IETF Standards Process, but such person is not\r\n   required to disclose such IPR under Sections 5.1.1 or 5.1.2 above,\r\n   such person is nevertheless encouraged to file an IPR disclosure as\r\n   described in Section 5.3 below.  Such an IPR disclosure should be\r\n   filed as soon as reasonably possible after the person realizes that\r\n   such IPR may Cover a Contribution.  Situations in which such\r\n   voluntary IPR disclosures may be made include when (a) IPR does not\r\n   meet the criteria in Section 5.6 because it is not owned or\r\n   controlled by an IETF Participant or his or her sponsor or employer\r\n   (referred to as third party IPR), (b) an individual is not required\r\n   to disclose IPR meeting the requirements of Section 5.6 because that\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 10]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   individual is not Participating in the relevant IETF activity, or (c)\r\n   the IPR Covers technology that does not yet meet the criteria for a\r\n   Contribution hereunder (e.g., it is disclosed in an informal or other\r\n   non-IETF setting).\r\n\r\n5.2.  The Timing of Disclosure\r\n\r\n   Timely IPR disclosure is important because working groups need to\r\n   have as much information as they can while they are evaluating\r\n   alternative solutions.\r\n\r\n5.2.1.  Timing of Disclosure under Section 5.1.1\r\n\r\n   A. The IPR disclosure required pursuant to Section 5.1.1 must be made\r\n      as soon as reasonably possible after the Contribution is submitted\r\n      or made unless the required disclosure is already on file.  See\r\n      Section 5.4.2 for a discussion of when updates need to be made for\r\n      an existing disclosure.\r\n\r\n   B. If a Contributor first learns of IPR in its Contribution that\r\n      meets the conditions of Section 5.6, for example a new patent\r\n      application or the discovery of a relevant patent in a patent\r\n      portfolio, after the Contribution is published in an Internet-\r\n      Draft, a disclosure must be made as soon as reasonably possible\r\n      after the IPR becomes reasonably and personally known to the\r\n      Contributor.\r\n\r\n5.2.2.  Timing of Disclosure under Section 5.1.2\r\n\r\n   The IPR disclosure required pursuant to Section 5.1.2 must be made as\r\n   soon as reasonably possible after the Contribution is made, unless\r\n   the required disclosure is already on file.\r\n\r\n   Participants who realize that IPR meeting the conditions of Section\r\n   5.6 may Cover technology that will be or has been incorporated into a\r\n   Contribution, or is seriously being discussed in a working group, are\r\n   strongly encouraged to make a preliminary IPR disclosure.  That IPR\r\n   disclosure should be made as soon after coming to the realization as\r\n   reasonably possible, not waiting until the Contribution is actually\r\n   made.\r\n\r\n   If an IETF Participant first learns of IPR that meets the conditions\r\n   of Section 5.6 that may Cover a Contribution by another party, for\r\n   example a new patent application or the discovery of a relevant\r\n   patent in a patent portfolio, after the Contribution is made, an IPR\r\n   disclosure must be made as soon as reasonably possible after the\r\n   Contribution or IPR becomes reasonably and personally known to the\r\n   Participant.\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 11]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n5.2.3.  Timing of Disclosure by ADs and Others\r\n\r\n   By the nature of their office, IETF Area Directors or persons\r\n   assisting them may become aware of Contributions late in the process\r\n   (for example at IETF Last Call or during IESG review) and, therefore\r\n   in such cases, cannot reasonably be expected to disclose IPR Covering\r\n   those Contributions until they become aware of them.\r\n\r\n5.3.  How Must an IPR Disclosure be Made?\r\n\r\n   IPR disclosures must be made by following the instructions at\r\n   <https://www.ietf.org/ipr-instructions>.  IPR disclosures and other\r\n   IPR-related information, including licensing information, must not be\r\n   included in RFCs or other IETF Contributions.  The RFC Editor will\r\n   remove any IPR-related information from Contributions prior to\r\n   publication as an RFC.\r\n\r\n5.4.  What Must Be in an IPR Disclosure?\r\n\r\n5.4.1.  Content of IPR Disclosures\r\n\r\n   An IPR disclosure must include the following information to the\r\n   extent reasonably available to the discloser: (a) the numbers of any\r\n   issued patents or published patent applications (or indicate that the\r\n   disclosure is based on unpublished patent applications), (b) the\r\n   name(s) of the inventor(s) (with respect to issued patents and\r\n   published patent applications), (c) the specific IETF Document(s) or\r\n   activity affected, and (d) if the IETF Document is an Internet-Draft,\r\n   its specific version number.  In addition, if it is not reasonably\r\n   apparent which part of an IETF Document is allegedly Covered by\r\n   disclosed IPR, then it is helpful if the discloser identifies the\r\n   sections of the IETF Document that are allegedly Covered by such\r\n   disclosed IPR.\r\n\r\n5.4.2.  Updating IPR Disclosures\r\n\r\n   Those who disclose IPR should be aware that as Internet-Drafts\r\n   evolve, text may be added or removed, and it is recommended that they\r\n   keep this in mind when composing text for disclosures.\r\n\r\n   A. Unless sufficient information to identify the issued patent was\r\n      disclosed when the patent application was disclosed, an IPR\r\n      disclosure must be updated or a new disclosure made promptly after\r\n      any of the following has occurred: (1) the publication of a\r\n      previously unpublished patent application, (2) the abandonment of\r\n      a patent application, (3) the issuance of a patent on a previously\r\n      disclosed patent application, or (4) a material change to the IETF\r\n      Document covered by the Disclosure that causes the Disclosure to\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 12]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      be covered by additional IPR.  If the patent application was\r\n      abandoned, then the new IPR disclosure must explicitly withdraw\r\n      any earlier IPR disclosures based on the application.  IPR\r\n      disclosures against a particular Contribution are assumed to be\r\n      inherited by revisions of the Contribution and by any RFCs that\r\n      are published from the Contribution unless the disclosure has been\r\n      updated or withdrawn.\r\n\r\n   B. If an IPR holder files patent applications in additional countries\r\n      which refer to, and the claims of which are substantially\r\n      identical to, the claims of a patent or patent application\r\n      previously disclosed in an IPR disclosure, the IPR holder is not\r\n      required to make a new or updated IPR disclosure as a result of\r\n      filing such applications or the issuance of patents on such\r\n      applications.\r\n\r\n   C. New or revised IPR disclosures may be made voluntarily at any\r\n      other time, provided that licensing information may only be\r\n      updated in accordance with Section 5.5.C.\r\n\r\n   D. Any person may submit an update to an existing IPR disclosure.  If\r\n      such update is submitted by a person other than the submitter of\r\n      the original IPR disclosure (as identified by name and email\r\n      address), then the IETF Secretariat shall attempt to contact the\r\n      original submitter to verify the update.  If the original\r\n      submitter responds that the proposed update is valid, the\r\n      Secretariat will update the IPR disclosure accordingly.  If the\r\n      original submitter responds that the proposed update is not valid,\r\n      the IETF Secretariat will not update the IPR disclosure.  If the\r\n      original submitter fails to respond after the IETF Secretariat has\r\n      made three separate inquiries and at least 30 days have elapsed\r\n      since the initial inquiry was made, then the IETF Secretariat will\r\n      inform the submitter of the proposed update that the update was\r\n      not validated and that the updater must produce legally sufficient\r\n      evidence that the submitter (or his/her employer) owns or has the\r\n      legal right to exercise control over the IPR subject to the IPR\r\n      disclosure.  If such evidence is satisfactory to the IETF\r\n      Secretariat, after consultation with the IETF legal counsel, then\r\n      the IETF Secretariat will make the requested update.  If such\r\n      evidence is not satisfactory, then the IETF Secretariat will not\r\n      make the requested update.\r\n\r\n5.4.3.  Blanket IPR Statements\r\n\r\n   The requirement to make an IPR disclosure is not satisfied by the\r\n   submission of a blanket statement that IPR may exist on every\r\n   Contribution or a general category of Contributions.  This is the\r\n   case because the aim of the disclosure requirement is to provide\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 13]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   information about specific IPR against specific technology under\r\n   discussion in the IETF.  The requirement is also not satisfied by a\r\n   blanket statement of willingness or commitment to license all\r\n   potential IPR Covering such technology under fair, reasonable, and\r\n   non-discriminatory terms for the same reason.  However, the\r\n   requirement for an IPR disclosure is satisfied by a blanket statement\r\n   of the IPR discloser's commitment to license all of its IPR meeting\r\n   the requirements of Section 5.6 (and either Section 5.1.1 or 5.1.2)\r\n   to implementers of an IETF specification on a royalty-free (and\r\n   otherwise reasonable and non-discriminatory) basis as long as any\r\n   other terms and conditions are disclosed in the IPR disclosure.\r\n\r\n5.5.  Licensing Information in an IPR Disclosure\r\n\r\n   A. Since IPR disclosures will be used by IETF working groups during\r\n      their evaluation of alternative technical solutions, it is helpful\r\n      if an IPR disclosure includes information about licensing of the\r\n      IPR in case Implementing Technologies require a license.\r\n      Specifically, it is helpful to indicate whether, upon approval by\r\n      the IESG for publication as an RFC of the relevant IETF\r\n      specification(s), all persons will be able to obtain the right to\r\n      implement, use, distribute, and exercise other rights with respect\r\n      to an Implementing Technology a) under a royalty-free and\r\n      otherwise reasonable and non-discriminatory license, or b) under a\r\n      license that contains reasonable and non-discriminatory terms and\r\n      conditions, including a reasonable royalty or other payment, or c)\r\n      without the need to obtain a license from the IPR holder (e.g., a\r\n      covenant not to sue with or without defensive suspension, as\r\n      described in Section 7).\r\n\r\n   B. The inclusion of a licensing declaration is not mandatory, but it\r\n      is encouraged so that the working groups will have as much\r\n      information as they can during their deliberations.  If the\r\n      inclusion of a licensing declaration in an IPR disclosure would\r\n      significantly delay its submission, then the discloser may submit\r\n      an IPR disclosure without a licensing declaration and then submit\r\n      a new IPR disclosure when the licensing declaration becomes\r\n      available.  IPR disclosures that voluntarily provide text that\r\n      includes licensing information, comments, notes, or URLs for other\r\n      information may also voluntarily include details regarding\r\n      specific licensing terms that the IPR holder intends to offer to\r\n      implementers of Implementing Technologies, including maximum\r\n      royalties.\r\n\r\n   C. It is likely that IETF will rely on licensing declarations and\r\n      other information that may be contained in an IPR disclosure and\r\n      that implementers will make technical, legal, and commercial\r\n      decisions on the basis of such commitments and information.  Thus,\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 14]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      when licensing declarations and other information, comments,\r\n      notes, or URLs for further information are contained in an IPR\r\n      disclosure, the persons making such disclosure agree and\r\n      acknowledge that the commitments and information contained in such\r\n      disclosure shall be irrevocable and will attach, to the extent\r\n      permissible by law, to the associated IPR, and all implementers of\r\n      Implementing Technologies will be justified and entitled to rely\r\n      on such materials in relating to such IPR, whether or not such IPR\r\n      is subsequently transferred to a third party by the IPR holder\r\n      making the commitment or providing the information.  IPR holders\r\n      making IPR disclosures that contain licensing declarations or\r\n      providing such information, comments, notes, or URLs for further\r\n      information must ensure that such commitments are binding on any\r\n      transferee of the relevant IPR, and that such transferee will use\r\n      reasonable efforts to ensure that such commitments are binding on\r\n      a subsequent transferee of the relevant IPR, and so on.\r\n\r\n   D. Licensing declarations must be made by people who are authorized\r\n      to make such declarations as discussed in Section 5.6 of this\r\n      document.\r\n\r\n5.6.  Level of Control over IPR Requiring Disclosure\r\n\r\n   IPR disclosures under Sections 5.1.1 and 5.1.2 are required with\r\n   respect to IPR (a) that is owned, directly or indirectly, by the\r\n   individual Contributor or his/her employer or sponsor (if any), or\r\n   (b) that such persons otherwise have the right to license or assert,\r\n   or (c) from which such persons derive a direct or indirect pecuniary\r\n   benefit, or (d) as to which an individual Contributor is listed as an\r\n   inventor on the relevant patent or patent application.\r\n\r\n5.7.  Disclosures for Oral Contributions\r\n\r\n   If a Contribution is oral and is not followed promptly by a written\r\n   disclosure of the same material, and if such oral Contribution would\r\n   be subject to a requirement that an IPR Disclosure be made (had such\r\n   oral Contribution been written), then the Contributor must accompany\r\n   such oral Contribution with an oral declaration that he/she is aware\r\n   of relevant IPR in as much detail as reasonably possible or file an\r\n   IPR Declaration with respect to such oral Contribution that otherwise\r\n   complies with the provisions of Sections 5.1 to 5.6 above.\r\n\r\n5.8.  General Disclosures\r\n\r\n   As described in Section 5.3, the IETF will make available a public\r\n   facility (e.g., a web page and associated database) for the posting\r\n   of IPR disclosures conforming with the disclosure requirements of\r\n   this policy.  In addition, the IETF may make available a public\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 15]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   facility for the posting of other IPR-related information and\r\n   disclosures that do not satisfy the requirements of this policy but\r\n   which may otherwise be informative and relevant to the IETF (\"General\r\n   Disclosures\").  Such General Disclosures may include, among other\r\n   things, \"blanket disclosures\" that do not contain a royalty-free\r\n   licensing commitment as described in Section 5.4.3, disclosures of\r\n   IPR that do not identify the specific IETF Documents Covered by the\r\n   disclosed IPR, and licensing statements or commitments that are\r\n   applicable generally and not to specific IPR disclosures.  All of\r\n   this information may be helpful to the IETF community, and its\r\n   disclosure is encouraged.  However, General Disclosures do not\r\n   satisfy an IETF Participant's obligation to make IPR disclosures as\r\n   required by this policy.\r\n\r\n   In some cases, if an IPR disclosure submitted by an IETF Participant\r\n   does not meet the requirements of this policy, the IETF may elect to\r\n   post the non-conforming IPR disclosure as a General Disclosure in\r\n   order to provide the greatest amount of information to the IETF\r\n   community.  This action does not excuse the IETF Participant from\r\n   submitting a new IPR disclosure that conforms with the requirements\r\n   of Sections 5.1 to 5.6.  The IETF reserves the right to decline to\r\n   publish General Disclosures that are not relevant to IETF activities,\r\n   that are, or are suspected of being, defamatory, false, misleading,\r\n   in violation of privacy or other applicable laws or regulations, or\r\n   that are in a format that is not suitable for posting on the IETF\r\n   facility that has been designated for General Disclosures.\r\n\r\n6.  Failure to Disclose\r\n\r\n   There may be cases in which individuals are not permitted by their\r\n   employers or by other factors to disclose the existence or substance\r\n   of patent applications or other IPR.  Since disclosure is required\r\n   for anyone making a Contribution or Participating in IETF activities,\r\n   a person who is not willing or able to disclose IPR for this reason,\r\n   or any other reason, must not contribute to or participate in IETF\r\n   activities with respect to technologies that he or she reasonably and\r\n   personally knows may be Covered by IPR which he or she will not\r\n   disclose, unless that person knows that his or her employer or\r\n   sponsor will make the required disclosures on his or her behalf.\r\n\r\n   Contributing to or Participating in IETF activities about a\r\n   technology without making required IPR disclosures is a violation of\r\n   IETF policy.\r\n\r\n   In addition to any remedies or defenses that may be available to\r\n   implementers and others under the law with respect to such a\r\n   violation (e.g., rendering the relevant IPR unenforceable), sanctions\r\n   are available through the normal IETF processes for handling\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 16]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   disruptions to IETF work.  See [RFC6701] for details regarding the\r\n   sanctions defined in various existing Best Current Practice\r\n   documents.\r\n\r\n7.  Evaluating Alternative Technologies in IETF Working Groups\r\n\r\n   In general, IETF working groups prefer technologies with no known IPR\r\n   claims or, for technologies with claims against them, an offer of\r\n   royalty-free licensing.  However, to solve a given technical problem,\r\n   IETF working groups have the discretion to adopt a technology as to\r\n   which IPR claims have been made if they feel that this technology is\r\n   superior enough to alternatives with fewer IPR claims or free\r\n   licensing to outweigh the potential cost of the licenses.  To assist\r\n   these working groups, it is helpful for the IPR claimants to declare,\r\n   in their IPR Declarations, the terms, if any, on which they are\r\n   willing to license their IPR Covering the relevant IETF Documents.\r\n\r\n   A. When adopting new technologies, the participants in an IETF\r\n      working group are expected to evaluate all the relevant tradeoffs\r\n      from their perspective.  Most of the time these considerations are\r\n      based purely on technical excellence, but IPR considerations may\r\n      also affect the evaluation and specific licensing terms may affect\r\n      the participants' opinion on the desirability of adopting a\r\n      particular technology.\r\n\r\n   B. The IETF has no official preference among different licensing\r\n      terms beyond what was stated at the beginning of this section.\r\n      However, for information and to assist participants in\r\n      understanding what license conditions may imply, what follows are\r\n      some general observations about some common types of conditions.\r\n      The following paragraphs are provided for information only:\r\n\r\n   C. When there is no commitment to license patents covering the\r\n      technology, this creates uncertainty that obviously is concerning.\r\n      These concerns do not exist when there is a commitment to license,\r\n      but the license terms can still differ greatly.  Some common\r\n      conditions include 1) terms that are fair, reasonable, and non-\r\n      discriminatory, and which may bear royalties or other financial\r\n      obligations (FRAND or RAND); 2) royalty-free terms that are\r\n      otherwise fair, reasonable, and non-discriminatory (RAND-z); and\r\n      3) commitments not to assert declared IPR, possibly conditional on\r\n      reciprocity.  Open source projects, for instance, often prefer the\r\n      latter two.  Note that licenses often come with complex terms that\r\n      have to be evaluated in detail, and this crude classification may\r\n      not be sufficient to make a proper evaluation.  For instance,\r\n      licenses may also include reciprocity and defensive suspension\r\n      requirements that require careful evaluation.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 17]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   D. The level of use of a technology against which IPR is disclosed is\r\n      also an important factor in weighing IPR encumbrances and\r\n      associated licensing conditions against technical merits.  For\r\n      example, if technologies are being considered for a mandatory-to-\r\n      implement change to a widely deployed protocol, the hurdle should\r\n      be very high for encumbered technologies, whereas a similar hurdle\r\n      for a new protocol could conceivably be lower.\r\n\r\n   E. IETF working groups and IETF areas may, however, adopt stricter\r\n      requirements in specific cases.  For instance, the IETF Security\r\n      Area has adopted stricter requirements for some security\r\n      technologies.  It has become common to have a mandatory-to-\r\n      implement security technology in IETF technology specifications.\r\n      This is to ensure that there will be at least one common security\r\n      technology present in all implementations of such a specification\r\n      that can be used in all cases.  This does not limit the\r\n      specification from including other security technologies, the use\r\n      of which could be negotiated between implementations.  An IETF\r\n      consensus has developed that no mandatory-to-implement security\r\n      technology can be specified in an IETF specification unless it has\r\n      no known IPR claims against it or a royalty-free license is\r\n      available to implementers of the specification.  It is possible to\r\n      specify such a technology in violation of this principle if there\r\n      is a very good reason to do so and if that reason is documented\r\n      and agreed to through IETF consensus.  This limitation does not\r\n      extend to other security technologies in the same specification if\r\n      they are not listed as mandatory to implement.\r\n\r\n   F. It should also be noted that the absence of IPR disclosures at any\r\n      given time is not the same thing as the knowledge that there will\r\n      be no IPR disclosure in the future, or that no IPR Covers the\r\n      relevant technology.  People or organizations not currently\r\n      involved in the IETF or people or organizations that discover IPR\r\n      they feel to be relevant in their patent portfolios can make IPR\r\n      disclosures at any time.\r\n\r\n   G. It should be noted that the validity and enforceability of any IPR\r\n      may be challenged for legitimate reasons outside the IETF.  The\r\n      mere existence of an IPR disclosure should not be taken to mean\r\n      that the disclosed IPR is valid or enforceable or actually Covers\r\n      a particular Contribution.  Although the IETF can make no actual\r\n      determination of validity, enforceability, or applicability of any\r\n      particular IPR, it is reasonable that individuals in a working\r\n      group or the IESG will take into account their own views of the\r\n      validity, enforceability, or applicability of IPR in their\r\n      evaluation of alternative technologies.\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 18]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n8.  Change Control for Technologies\r\n\r\n   The IETF must have change control over the technology described in\r\n   any Standards Track IETF Documents in order to fix problems that may\r\n   be discovered or to produce other derivative works.\r\n\r\n   In some cases, the developer of patented or otherwise controlled\r\n   technology may decide to hand over to the IETF the right to evolve\r\n   the technology (a.k.a., \"change control\").  The implementation of an\r\n   agreement between the IETF and the developer of the technology can be\r\n   complex.  (See [RFC1790] and [RFC2339] for examples.)\r\n\r\n   Note that there is no inherent prohibition against a Standards Track\r\n   IETF Document making a normative reference to proprietary technology.\r\n   For example, a number of IETF standards support proprietary\r\n   cryptographic transforms.\r\n\r\n9.  Licensing Requirements to Advance Standards Track IETF Documents\r\n\r\n   Section 2.2 of RFC 6410 [RFC6410] states:\r\n\r\n      If the technology required to implement the specification requires\r\n      patented or otherwise controlled technology, then the set of\r\n      implementations must demonstrate at least two independent,\r\n      separate and successful uses of the licensing process.\r\n\r\n   A key word in this text is \"requires\".  The mere existence of\r\n   disclosed IPR does not necessarily mean that licenses are actually\r\n   required in order to implement the technology.\r\n\r\n10.  No IPR Disclosures in IETF Documents\r\n\r\n   IETF Documents must not contain any mention of specific IPR.  All\r\n   specific IPR disclosures must be submitted as described in Section 5.\r\n   Readers should always refer to the online web page\r\n   <https://www.ietf.org/ipr/> to get a full list of IPR disclosures\r\n   received by the IETF concerning any Contribution.\r\n\r\n11.  Application to Non-IETF Stream Documents\r\n\r\n   This document has been developed for the benefit and use of the IETF\r\n   community.  As such, the rules set forth herein apply to all\r\n   Contributions and IETF Documents that are in the \"IETF Document\r\n   Stream\" as defined in Section 5.1.1 of [RFC4844] (i.e., those that\r\n   are contributed, developed, edited, and published as part of the IETF\r\n   Standards Process).\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 19]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   The rules that apply to documents in Alternate Streams are\r\n   established by the managers of those Alternate Streams (currently the\r\n   Internet Architecture Board (IAB), Internet Research Steering Group\r\n   (IRSG), and Independent Submission Editor, as specified in\r\n   [RFC4844]).  These managers may elect, through their own internal\r\n   processes, to cause this document to be applied to documents\r\n   contributed to them for development, editing, and publication in\r\n   their respective Alternate Streams.  If an Alternate Stream manager\r\n   elects to adopt this document, they must do so in a manner that is\r\n   public and notifies their respective document Contributors that this\r\n   document applies to their respective Alternate Streams.  In such\r\n   case, each occurrence of the term \"Contribution\" and \"IETF Document\"\r\n   in this document shall be read to mean a contribution or document in\r\n   such Alternate Stream, as the case may be.  It would be advisable for\r\n   such Alternate Stream managers to consider adapting the definitions\r\n   of \"Contribution\" and other provisions in this document to suit their\r\n   particular needs.\r\n\r\n12.  Security Considerations\r\n\r\n   This document relates to the IETF process, not any particular\r\n   technology.  There are security considerations when adopting any\r\n   technology, whether IPR protected or not.  A working group should\r\n   take those security considerations into account as one part of\r\n   evaluating the technology, just as IPR is one part, but there are no\r\n   known issues of security with IPR procedures.\r\n\r\n13.  Changes since RFCs 3979 and 4879\r\n\r\n   The material in RFC 3979 was significantly reorganized to produce\r\n   this document.  This section reviews the actual changes in content\r\n   since RFC 3979 and does not detail the reorganization.  These changes\r\n   are listed from the point of view of this document with reference to\r\n   the RFC 3979 section where useful.  This section is intended only as\r\n   an informational summary of the text contained in Sections 1-12 of\r\n   this document.  This section does not constitute the official policy\r\n   of the IETF and should not be referred to or quoted as such.  Any\r\n   discrepancies or ambiguities shall be resolved in favor of the\r\n   language contained in Sections 1-12 of this document.\r\n\r\n   Boilerplate - Since the document boilerplate formerly in Section 5 of\r\n      RFC 3979 has been moved to the Trust Legal Provisions since 2009,\r\n      the boilerplate requirements have been deleted from this document.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 20]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   1 - Definitions\r\n\r\n      1.a - \"Alternate Stream\" definition (new): Added to enable IRTF,\r\n         IAB, and Independent Submission streams to adopt and use BCP 79\r\n         more easily.\r\n\r\n      1.c - \"Contribution\" (was 1.c)\r\n\r\n            Removed \"IETF\" to more easily enable other Streams to adopt\r\n            this policy.\r\n\r\n            Added \"intended to affect the IETF Standards Process\", which\r\n            is needed to prevent information presentations (e.g.,\r\n            plenary guest speakers) from being considered Contributions.\r\n\r\n            Added BOF, design team, web site, and chat room.\r\n            Contributions can be made in any of these places.\r\n\r\n      1.e - \"Covers\" (was 1.n) - Added \"provisional patent application\"\r\n         - Required to eliminate ambiguity whether provisional\r\n         applications are included.\r\n\r\n      1.h - \"IETF Documents\" (was 1.h) - Limited to IETF (not Alternate\r\n         Stream) documents.\r\n\r\n      1.i - \"IETF Standards Process\" (was 1.b) - Clarify that\r\n         Contributions can be made in contexts other than traditional\r\n         IETF standards development.\r\n\r\n      1.j - \"IPR\" (was 1.o) - Removed reference to copyrights, database\r\n         rights, and data rights.  Copyright in IETF Documents and\r\n         contributions is addressed under RFC 5378 and is treated very\r\n         differently than patents, which are the focus of BCP 79.\r\n         Data/database rights not relevant to IETF standards, and cannot\r\n         be registered or disclosed in the manner of patents.\r\n\r\n      1.l - \"Internet-Draft\" (was 1.g) - Reduced to reference RFC 2026\r\n         without additional description for clarity.\r\n\r\n      1.m - \"Participating in an IETF discussion or activity\" (new) -\r\n         Due to numerous ambiguities over the years, it was necessary to\r\n         add a section describing what it means to \"participate\" in an\r\n         IETF activity.\r\n\r\n      1.o - \"RFC\" (was 1.e) - Added cross-reference to RFC 2026 and\r\n         eliminated textual description of RFC permanence.\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 21]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   2 - Introduction - Added text that offers an overview of why we have\r\n      this policy, cut prior discussion of Section 10 of RFC 2026 as no\r\n      longer necessary, and added references to subsequent RFCs relating\r\n      to IPR, including RFC 5378 and 6702.\r\n\r\n   3 - Participation in the IETF (was \"Contributions to the IETF\") -\r\n      Changed focus to participation rather than making of Contributions\r\n      and explained why we require IPR disclosure.\r\n\r\n   old 3.2.1.C - Deleted because all required legends in IETF Documents\r\n      are now described in RFC 5378 and Trust Legal Provisions.\r\n\r\n   3.3 - Obligations on Participants - Added to make clear that\r\n      participation in IETF obligates the participant to comply with\r\n      IETF rules.\r\n\r\n   old 4.A - Removed because inconsistent with current and historical\r\n      practice.  Also, all legends in IETF Documents are now addressed\r\n      in Trust Legal Provisions.\r\n\r\n   4.A - \"The IESG, IAB...\" - Added IAB, ISOC, and IETF Trust to\r\n      disclaimer.\r\n\r\n   4.B - \"When the IETF Secretariat...\" - Added description of current\r\n      procedure used to publish third party IPR disclosures.\r\n\r\n   4.C - \"When an IPR disclosure...\" - Updated to reflect current\r\n      practice and roles (e.g., Secretariat rather than IETF Exec Dir).\r\n\r\n   4.D - Determination of Provision of Reasonable and Non-discriminatory\r\n      Terms (was Section 4.1) - Various edits made to this paragraph to\r\n      reflect current process for advancement of standards.\r\n\r\n   old 5 - Deleted because it was not needed.\r\n\r\n   5.1.1 - Contributor's IPR in His or Her Contribution (was Section\r\n      6.1.1) - Limits disclosure obligation to written Contributions\r\n      intended to be used as inputs to the IETF Standards Process.  Oral\r\n      disclosures are now covered in Section 5.7.\r\n\r\n   5.1.2 - An IETF Participant's IPR in Contributions by Others (was\r\n      Section 6.1.2) - Revisions made consistent with Section 5.1.1\r\n      above.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 22]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   5.1.3 -  Voluntary IPR Disclosures (was Section 6.1.3) - Fixes\r\n      procedures for making voluntary IPR disclosures and adds examples\r\n      of when voluntary disclosures may be appropriate.  In addition to\r\n      IPR of others, voluntary disclosures are encouraged when an IETF\r\n      Participant is aware of its own IPR that covers IETF work in which\r\n      it is not an active participant and when the technology is\r\n      disclosed in other than an IETF setting.\r\n\r\n   5.2.1 - Timing of Disclosure under Section 5.1.1 (was Section 6.2.1)\r\n      - Trigger for disclosure changed from publication of a\r\n      Contribution in an I-D to \"submitted or made\"; lengthy example\r\n      regarding updates deleted in lieu of cross-reference to Section\r\n      5.4.2 regarding updates.\r\n\r\n   5.2.2 - Timing of Disclosure under Section 5.1.2 (was Section 6.2.2)\r\n      - Corresponding changes made per Section 5.2.1.\r\n\r\n   5.2.3 - Timing of Disclosure by ADs - Added to clarify AD disclosure\r\n      obligations.\r\n\r\n   5.3 - \"IPR disclosures and other...\" - Reflects current practice\r\n      regarding prohibition of including IPR information directly in\r\n      IETF Documents.\r\n\r\n   5.4.1 - Content of IPR Disclosures (was Section 6.4.1) - Added\r\n      requirement to disclose names of inventors - Disclosing the\r\n      name(s) of inventors on a patent will make it more likely that\r\n      IETF Participants will recognize whether the inventor is an IETF\r\n      Participant and what IETF activities that individual participates\r\n      in.  This information is easy for the discloser to provide and\r\n      less convenient for every reader of the IPR disclosure to look up\r\n      in patent office records (if even available).\r\n\r\n   5.4.2 - Updating IPR Disclosures (was Section 6.4.2) - Significant\r\n      revisions and additional detail added regarding updating of IPR\r\n      disclosures upon events such as issuance of patents, amendment of\r\n      claims, employee changing jobs, employer acquires another company,\r\n      etc.\r\n\r\n   5.4.2.D - Clarify that additional IPR disclosures are not needed for\r\n      foreign counterparts.\r\n\r\n   5.4.3 - Blanket IPR Statements (was Section 6.4.3) - wording\r\n      clarifications and changed \"willingness\" to \"commitment\".  A\r\n      blanket IPR disclosure which does not list specific patent numbers\r\n      is not compliant with this policy unless the discloser commits\r\n      (and is not just willing) to license such patents on royalty-free\r\n      and otherwise reasonable terms.\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 23]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   5.5.C - \"It is likely that IETF will rely ...\" (new paragraph) -\r\n      Makes licensing declarations irrevocable so that they may be\r\n      relied upon in the future by implementers.\r\n\r\n   5.5.D - \"Licensing declarations ...\" (new paragraph) - Requires that\r\n      licensing declarations must be made by people authorized to make\r\n      them.\r\n\r\n   5.6 - Level of Control over IPR Requiring Disclosure (was Section\r\n      6.6) - In addition to ownership of IPR, language added to require\r\n      disclosure when Participants derive a pecuniary benefit from the\r\n      IPR, or the individual is a listed inventor - Clarifications to\r\n      address situations not covered in earlier version.\r\n\r\n   5.7 - Disclosures for Oral Contributions (new): Describes procedure\r\n      for oral Contributions.  Previously, statements regarding oral\r\n      statements were contradictory.  Some places said that disclosures\r\n      must be made for oral statements, but others talk about\r\n      disclosures only being required following publication as an I-D.\r\n      Under new text, oral statements don't trigger the normal IPR\r\n      disclosure obligations, as oral statements are inherently\r\n      imprecise and it's hard to know when they describe something\r\n      covered by the technical terms of a patent claim.  However, if an\r\n      oral contribution is made and it is not followed by a written\r\n      contribution, then the oral discloser must either make a\r\n      concurrent oral IPR disclosure or file a formal written\r\n      disclosure.\r\n\r\n   5.8 - General Disclosures (new) - Describes the IETF's public\r\n      disclosure feature, which allows IPR disclosures to be made by\r\n      anyone, whether or not an IETF Participant.  The feature has been\r\n      up and running for years, and this language describes its current\r\n      implementation.\r\n\r\n   6 - Failure to Disclose (was Section 7) - Technical and clarity\r\n      corrections, as well as new language describing potential remedies\r\n      for failures to disclose IPR in accordance with IETF rules,\r\n      including IESG actions described in RFC 6701.\r\n\r\n   7 - Evaluating Alternative Technologies in IETF Working Groups (was\r\n      Section 8).\r\n\r\n      Paragraph 1 - Minor wording changes for clarity.\r\n\r\n      Paragraphs 2-5 (new) - Relate to the considerations made by IETF\r\n          WGs when evaluating patent and licensing disclosures\r\n         concerning IETF standards.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 24]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      Paragraph 6 - security technologies (new) - Makes clear that\r\n         security is only one example of stricter requirements.  Also\r\n         requires that violation of requirements for royalty-free\r\n         licensing in the security area can be made only with IETF\r\n         consensus.\r\n\r\n      Paragraphs 7-8 (were paragraphs 3-4) - Wording changes for\r\n         clarity.\r\n\r\n   9 - Licensing Requirements to Advance Standards Track IETF Documents\r\n      (was Section 10) - Wording updated to reflect RFC 6410.\r\n\r\n   10 - No IPR Disclosures in IETF Documents (was Section 11) - Wording\r\n      simplified to refer to Section 5.\r\n\r\n   11 - Application to Non-IETF Stream Documents (new) - Adds procedures\r\n      to be followed by Alternate Stream (IAB, IRTF, Independent\r\n      Submission) managers to adopt these rules and procedures.\r\n      Borrowed and adapted the copyright language used in the Trust\r\n      Legal Provisions.  Each Alternate Stream (Independent Submission,\r\n      IRTF, and IAB) would need to take some action (preferably issuing\r\n      an RFC) to adopt BCP 79 for its stream.  This was done with\r\n      copyright already, and pretty smoothly.\r\n\r\n14.  References\r\n\r\n14.1.  Normative References\r\n\r\n   [RFC2026] Bradner, S., \"The Internet Standards Process -- Revision\r\n             3\", BCP 9, RFC 2026, DOI 10.17487/RFC2026, October 1996,\r\n             <http://www.rfc-editor.org/info/rfc2026>.\r\n\r\n   [RFC2028] Hovey, R. and S. Bradner, \"The Organizations Involved in\r\n             the IETF Standards Process\", BCP 11, RFC 2028,\r\n             DOI 10.17487/RFC2028, October 1996,\r\n             <http://www.rfc-editor.org/info/rfc2028>.\r\n\r\n   [RFC4844] Daigle, L., Ed., and Internet Architecture Board, \"The RFC\r\n             Series and RFC Editor\", RFC 4844, DOI 10.17487/RFC4844,\r\n             July 2007, <http://www.rfc-editor.org/info/rfc4844>.\r\n\r\n   [RFC6410] Housley, R., Crocker, D., and E. Burger, \"Reducing the\r\n             Standards Track to Two Maturity Levels\", BCP 9, RFC 6410,\r\n             DOI 10.17487/RFC6410, October 2011,\r\n             <http://www.rfc-editor.org/info/rfc6410>.\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 25]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n14.2.  Informative References\r\n\r\n   [RFC1790] Cerf, V., \"An Agreement between the Internet Society and\r\n             Sun Microsystems, Inc. in the Matter of ONC RPC and XDR\r\n             Protocols\", RFC 1790, DOI 10.17487/RFC1790, April 1995,\r\n             <http://www.rfc-editor.org/info/rfc1790>.\r\n\r\n   [RFC2339] The Internet Society and Sun Microsystems, \"An Agreement\r\n             Between the Int",
    "correct_text": "\r\n\r\n\r\n\r\n\r\n\r\nInternet Engineering Task Force (IETF)                        S. Bradner\r\nRequest for Comments: 8179                            Harvard University\r\nBCP: 79                                                     J. Contreras\r\nObsoletes: 3979, 4879                                 University of Utah\r\nUpdates: 2026                                                   May 2017\r\nCategory: Best Current Practice\r\nISSN: 2070-1721\r\n\r\n\r\n            Intellectual Property Rights in IETF Technology\r\n\r\nAbstract\r\n\r\n   The IETF policies about Intellectual Property Rights (IPR), such as\r\n   patent rights, relative to technologies developed in the IETF are\r\n   designed to ensure that IETF working groups and participants have as\r\n   much information as possible about any IPR constraints on a technical\r\n   proposal as early as possible in the development process.  The\r\n   policies are intended to benefit the Internet community and the\r\n   public at large, while respecting the legitimate rights of IPR\r\n   holders.  This document sets out the IETF policies concerning IPR\r\n   related to technology worked on within the IETF.  It also describes\r\n   the objectives that the policies are designed to meet.  This document\r\n   updates RFC 2026 and, with RFC 5378, replaces Section 10 of RFC 2026.\r\n   This document also obsoletes RFCs 3979 and 4879.\r\n\r\nStatus of This Memo\r\n\r\n   This memo documents an Internet Best Current Practice.\r\n\r\n   This document is a product of the Internet Engineering Task Force\r\n   (IETF).  It represents the consensus of the IETF community.  It has\r\n   received public review and has been approved for publication by the\r\n   Internet Engineering Steering Group (IESG).  Further information on\r\n   BCPs is available in Section 2 of RFC 7841.\r\n\r\n   Information about the current status of this document, any errata,\r\n   and how to provide feedback on it may be obtained at\r\n   http://www.rfc-editor.org/info/rfc8179.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 1]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\nCopyright Notice\r\n\r\n   Copyright (c) 2017 IETF Trust and the persons identified as the\r\n   document authors.  All rights reserved.\r\n\r\n   This document is subject to BCP 78 and the IETF Trust's Legal\r\n   Provisions Relating to IETF Documents\r\n   (http://trustee.ietf.org/license-info) in effect on the date of\r\n   publication of this document.  Please review these documents\r\n   carefully, as they describe your rights and restrictions with respect\r\n   to this document.  Code Components extracted from this document must\r\n   include Simplified BSD License text as described in Section 4.e of\r\n   the Trust Legal Provisions and are provided without warranty as\r\n   described in the Simplified BSD License.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 2]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\nTable of Contents\r\n\r\n   1. Definitions  . . . . . . . . . . . . . . . . . . . . . . . . .  4\r\n   2. Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  6\r\n   3. Participation in the IETF  . . . . . . . . . . . . . . . . . .  8\r\n   3.1. General Policy   . . . . . . . . . . . . . . . . . . . . . .  8\r\n   3.2. Rights and Permissions in Contributions. . . . . . . . . . .  8\r\n   3.3. Obligations on Participants  . . . . . . . . . . . . . . . .  8\r\n   4.  Actions for Documents for Which IPR Disclosure(s)\r\n       Have Been Received  . . . . . . . . . . . . . . . . . . . . .  8\r\n   5. IPR Disclosures  . . . . . . . . . . . . . . . . . . . . . . . 10\r\n   5.1. Who Must Make an IPR Disclosure? . . . . . . . . . . . . . . 10\r\n   5.1.1.  A Contributor's IPR in His or Her Contribution  . . . . . 10\r\n   5.1.2. An IETF Participant's IPR in Contributions by Others   . . 10\r\n   5.1.3. IPR of Others  . . . . . . . . . . . . . . . . . . . . . . 10\r\n   5.2. The Timing of Providing Disclosure . . . . . . . . . . . . . 11\r\n   5.2.1. Timing of Disclosure under Section 5.1.1 . . . . . . . . . 11\r\n   5.2.2. Timing of Disclosure under Section 5.1.2 . . . . . . . . . 11\r\n   5.2.3. Timing of Disclosure by ADs and Others . . . . . . . . . . 12\r\n   5.3. How Must an IPR Disclosure be Made?  . . . . . . . . . . . . 12\r\n   5.4. What Must be in an IPR Disclosure? . . . . . . . . . . . . . 12\r\n   5.4.1. Content of IPR Disclosures . . . . . . . . . . . . . . . . 12\r\n   5.4.2. Updating IPR Disclosures . . . . . . . . . . . . . . . . . 12\r\n   5.4.3. Blanket IPR Statements . . . . . . . . . . . . . . . . . . 13\r\n   5.5. Licensing Information in an IPR Disclosure . . . . . . . . . 14\r\n   5.6. Level of Control over IPR Requiring Disclosure . . . . . . . 15\r\n   5.7. Disclosures for Oral Contributions . . . . . . . . . . . . . 15\r\n   5.8.  General Disclosures . . . . . . . . . . . . . . . . . . . . 15\r\n   6. Failure to Disclose  . . . . . . . . . . . . . . . . . . . . . 16\r\n   7. Evaluating Alternative Technologies in IETF Working Groups . . 17\r\n   8. Change Control for Technologies  . . . . . . . . . . . . . . . 19\r\n   9. Licensing Requirements to Advance Standards Track\r\n      IETF Documents . . . . . . . . . . . . . . . . . . . . . . . . 19\r\n   10. No IPR Disclosures in IETF Documents  . . . . . . . . . . . . 19\r\n   11. Application to Non-IETF Stream Documents  . . . . . . . . . . 19\r\n   12. Security Considerations   . . . . . . . . . . . . . . . . . . 20\r\n   13. Changes since RFCs 3979 and 4879  . . . . . . . . . . . . . . 20\r\n   14. References  . . . . . . . . . . . . . . . . . . . . . . . . . 25\r\n   14.1. Normative References  . . . . . . . . . . . . . . . . . . . 25\r\n   14.2. Informative References  . . . . . . . . . . . . . . . . . . 26\r\n   Editors' Addresses  . . . . . . . . . . . . . . . . . . . . . . . 26\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 3]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n1.  Definitions\r\n\r\n   The following definitions are for terms used in the context of this\r\n   document.  Other terms, including \"IESG,\" \"ISOC,\" \"IAB,\" and \"RFC\r\n   Editor,\" are defined in [RFC2028].\r\n\r\n   a. \"Alternate Stream\":  the IAB Document Stream, the IRTF Document\r\n      Stream, and the Independent Submission Stream, each as defined in\r\n      Section 5.1 of [RFC4844], along with any future non-IETF streams\r\n      that might be defined.\r\n\r\n   b. \"Blanket IPR Statement\" or \"Blanket Disclosure\": see Section\r\n      5.4.3.\r\n\r\n   c. \"Contribution\": any submission to the IETF intended by the\r\n      Contributor for publication as all or part of an Internet-Draft or\r\n      RFC and any statement made within the context of an IETF activity,\r\n      in each case that is intended to affect the IETF Standards Process\r\n      or that is related to the activity of an Alternate Stream that has\r\n      adopted this policy.\r\n\r\n      Such statements include oral statements, as well as written and\r\n      electronic communications, which are addressed to:\r\n\r\n      o  any IETF plenary session,\r\n\r\n      o  any IETF working group (WG; see BCP 25) or portion thereof or\r\n         any WG chair on behalf of the relevant WG,\r\n\r\n      o  any IETF \"birds of a feather\" (BOF) session or portion thereof,\r\n\r\n      o  WG design teams (see BCP 25) and other design teams that intend\r\n         to deliver an output to IETF, or portions thereof,\r\n\r\n      o  the IESG, or any member thereof on behalf of the IESG,\r\n\r\n      o  the IAB, or any member thereof on behalf of the IAB,\r\n\r\n      o  any IETF mailing list, web site, chat room, or discussion board\r\n         operated by or under the auspices of the IETF, including the\r\n         IETF list itself,\r\n\r\n      o  the RFC Editor or the Internet-Drafts function.\r\n\r\n      Statements made outside of an IETF session, mailing list, or other\r\n      function, or that are clearly not intended to be input to an IETF\r\n      activity, group, or function, are not Contributions in the context\r\n      of this document.  And while the IETF's IPR rules apply in all\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 4]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      cases, not all presentations represent a Contribution.  For\r\n      example, many invited plenary, area-meeting, or research group\r\n      presentations will cover useful background material, such as\r\n      general discussions of existing Internet technology and products,\r\n      and will not be a Contribution.  (Some such presentations can\r\n      represent a Contribution as well, of course).  Throughout this\r\n      document, the term \"written Contribution\" is used.  For purposes\r\n      of this document, \"written\" means reduced to a written or visual\r\n      form in any language and any media, permanent or temporary,\r\n      including but not limited to traditional documents, email\r\n      messages, discussion board postings, slide presentations, text\r\n      messages, instant messages, and transcriptions of oral statements.\r\n\r\n   d. \"Contributor\": an individual submitting a Contribution\r\n\r\n   e. \"Covers\" or \"Covered\": a valid claim of a patent or a patent\r\n      application (including a provisional patent application) in any\r\n      jurisdiction, or any other Intellectual Property Right, would\r\n      necessarily be infringed by the exercise of a right (e.g., making,\r\n      using, selling, importing, distribution, copying, etc.) with\r\n      respect to an Implementing Technology.  For purposes of this\r\n      definition, \"valid claim\" means a claim of any unexpired patent or\r\n      patent application which shall not have been withdrawn, cancelled,\r\n      or disclaimed, nor held invalid by a court of competent\r\n      jurisdiction in an unappealed or unappealable decision.\r\n\r\n   f. \"General Disclosure\": see Section 5.8.\r\n\r\n   g. \"IETF\": In the context of this document, the IETF includes all\r\n      individuals who participate in meetings, working groups, mailing\r\n      lists, functions, and other activities that are organized or\r\n      initiated by ISOC, the IESG, or the IAB under the general\r\n      designation of the Internet Engineering Task Force, or IETF, but\r\n      solely to the extent of such participation.\r\n\r\n   h. \"IETF Documents\": RFCs and Internet-Drafts that are published as\r\n      part of the IETF Standards Process.  These are also referred to as\r\n      \"IETF Stream Documents\" as defined in Section 5.1.1 of [RFC4844].\r\n\r\n   i. \"IETF Standards Process\": the activities undertaken by the IETF in\r\n      any of the settings described in the above definition of\r\n      Contribution.  The IETF Standards Process may include\r\n      participation in activities and publication of documents that are\r\n      not directed toward the development of IETF standards or\r\n      specifications, such as the development and publication of\r\n      Informational and Experimental documents (see Section 4 of\r\n      [RFC2026]).\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 5]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   j. \"IPR\" or \"Intellectual Property Rights\": means a patent, utility\r\n      model, or similar right that may Cover an Implementing Technology,\r\n      whether such rights arise from a registration or renewal thereof,\r\n      or an application therefore, in each case anywhere in the world.\r\n      See [RFC5378] for a discussion of trademarks.\r\n\r\n   k. \"Implementing Technology\": a technology that implements an IETF\r\n      specification or standard.\r\n\r\n   l. \"Internet-Draft\": a document used in the IETF and RFC Editor\r\n      processes, as described in Section 2.2 of [RFC2026].\r\n\r\n   m. \"Participating in an IETF discussion or activity\": making a\r\n      Contribution, as described above, or in any other way acting in\r\n      order to influence the outcome of a discussion relating to the\r\n      IETF Standards Process.  Without limiting the generality of the\r\n      foregoing, acting as a Working Group Chair or Area Director\r\n      constitutes \"Participating\" in all activities of the relevant\r\n      working group(s) he or she is responsible for in an area.\r\n      \"Participant\" and \"IETF Participant\" mean any individual\r\n      Participating in an IETF discussion or activity.\r\n\r\n   m. \"Reasonably and personally known\": something an individual knows\r\n      personally or, because of the job the individual holds, would\r\n      reasonably be expected to know.  This wording is used to indicate\r\n      that an organization cannot purposely keep an individual in the\r\n      dark about patents or patent applications just to avoid the\r\n      disclosure requirement.  But this requirement should not be\r\n      interpreted as requiring the IETF Contributor or Participant (or\r\n      his or her represented organization, if any) to perform a patent\r\n      search to find applicable IPR.\r\n\r\n   o. \"RFC\": the basic publication series for the IETF.  RFCs are\r\n      published by the RFC Editor.  (See Section 2.1 of [RFC2026].)\r\n\r\n2.  Introduction\r\n\r\n   The IETF policies about Intellectual Property Rights (IPR), such as\r\n   patent rights, relative to technologies developed in the IETF are\r\n   designed to ensure that IETF working groups and Participants have as\r\n   much information as possible about any IPR constraints on a technical\r\n   proposal as early as possible in the development process.  The\r\n   policies are intended to benefit the Internet community and the\r\n   public at large, while respecting the legitimate rights of IPR\r\n   holders.  This document details the IETF policies concerning IPR\r\n   related to technology worked on within the IETF.  It also describes\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 6]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   the objectives that the policies are designed to meet.  This document\r\n   updates RFC 2026 and, with RFC 5378, replaces Section 10 of RFC 2026.\r\n   This document also obsoletes RFC 3979 and RFC 4879.\r\n\r\n   There are three basic principles regarding how the IETF deals with\r\n   claims of Intellectual Property Rights (originally outlined in\r\n   Section 10 of [RFC2026]):\r\n\r\n   (a) The IETF will make no determination about the validity of any\r\n       particular IPR claim.\r\n\r\n   (b) The IETF, following normal processes, can decide to use\r\n       technology for which IPR disclosures have been made if it decides\r\n       that such a use is warranted.\r\n\r\n   (c) In order for a working group and the rest of the IETF to have the\r\n       information needed to make an informed decision about the use of\r\n       a particular technology, all those contributing to the working\r\n       group's discussions must disclose the existence of any IPR the\r\n       Contributor or any other IETF Participant believes Covers or may\r\n       ultimately Cover the technology under discussion.  This applies\r\n       to both Contributors and other Participants, and applies whether\r\n       they contribute in person, via email, or by other means.  The\r\n       requirement applies to all IPR of the Participant, the\r\n       Participant's employer, sponsor, or others represented by the\r\n       Participant that are reasonably and personally known to the\r\n       Participant.  No patent search is required.\r\n\r\n   Section 1 defines the terms used in this document.  Sections 3\r\n   through 11 set forth the IETF's policies and procedures relating to\r\n   IPR.  Section 13 lists the changes between this document and RFCs\r\n   3979 and 4879.  A separate document [RFC5378] deals with rights (such\r\n   as copyrights and trademarks) in Contributions, including the right\r\n   of the IETF and IETF Participants to publish and create derivative\r\n   works of those Contributions.  This document is not intended to\r\n   address those issues.  See RFC 6702 [RFC6702] for a discussion of\r\n   \"Promoting Compliance with Intellectual Property Rights (IPR)\r\n   Disclosure Rules\".\r\n\r\n   This document is not intended as legal advice.  Readers are advised\r\n   to consult their own legal advisors if they would like a legal\r\n   interpretation of their rights or the rights of the IETF in any\r\n   Contributions they make.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 7]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n3.  Participation in the IETF\r\n\r\n3.1.  General Policy\r\n\r\n   In all matters relating to Intellectual Property Rights, the intent\r\n   is to benefit the Internet community and the public at large, while\r\n   respecting the legitimate rights of others.  The disclosures required\r\n   by this policy are intended to help IETF working groups define\r\n   superior technical solutions with the benefit of as much information\r\n   as reasonably possible about potential IPR claims relating to\r\n   technologies under consideration.\r\n\r\n3.2.  Rights and Permissions in Contributions\r\n\r\n   By submission of a Contribution, each person actually submitting the\r\n   Contribution, and each named co-Contributor, is deemed to agree to\r\n   the following terms and conditions on his or her own behalf and on\r\n   behalf of the organizations the Contributor represents or is\r\n   sponsored by (if any) when submitting the Contribution.\r\n\r\n3.3.  Obligations on Participants\r\n\r\n   By Participating in the IETF, each Participant is deemed to agree to\r\n   comply with all requirements of this RFC that relate to Participation\r\n   in IETF activities.  Without limiting the foregoing, each Participant\r\n   that is a Contributor makes the following representations to the\r\n   IETF:\r\n\r\n   A. Such Contributor represents that he or she has made or will\r\n      promptly make all disclosures required by Section 5.1.1 of this\r\n      document.\r\n\r\n   B. Such Contributor represents that there are no limits to the\r\n      Contributor's ability to make the grants, acknowledgments, and\r\n      agreements herein that are reasonably and personally known to the\r\n      Contributor.\r\n\r\n4.  Actions for Documents for Which IPR Disclosure(s) Have Been Received\r\n\r\n   A. The IESG, IAB, ISOC, and IETF Trust disclaim any responsibility\r\n      for identifying the existence of or for evaluating the\r\n      applicability of any IPR, disclosed or otherwise, to any IETF\r\n      technology, specification, or standard, and will take no position\r\n      on the validity or scope of any such IPR.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 8]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   B. When the IETF Secretariat has received a notification under\r\n      Section 5.1.3 of the existence of non-participant IPR that\r\n      potentially Covers a technology under discussion at IETF or which\r\n      is the subject of an IETF Document, the IETF Secretariat shall\r\n      promptly publish such notification and will request that the\r\n      identified third party make an IPR disclosure in accordance with\r\n      the provisions of Section 5.\r\n\r\n   C. When an IPR disclosure has been made as provided in Section 5 of\r\n      this document, the IETF Secretariat may request from the purported\r\n      holder of such IPR a written assurance that upon approval by the\r\n      IESG for publication of the relevant IETF specification(s) as one\r\n      or more RFCs, all persons will be able to obtain the right to\r\n      implement, use, distribute, and exercise other rights with respect\r\n      to Implementing Technology under one of the licensing options\r\n      specified in Section 5.5.A below unless a statement identifying\r\n      one of the licensing options described in Section 5.5.A has\r\n      already been received by the IETF Secretariat.  The working group\r\n      proposing the use of the technology with respect to which the\r\n      Intellectual Property Rights are disclosed may assist the IETF\r\n      Secretariat in this effort.\r\n\r\n      The results of this procedure shall not, in themselves, block\r\n      publication of an IETF Document or advancement of an IETF Document\r\n      along the Standards Track.  A working group may take into\r\n      consideration the results of this procedure in evaluating the\r\n      technology, and the IESG may defer approval when a delay may\r\n      facilitate obtaining such assurances.  The results will, however,\r\n      be recorded by the IETF Secretariat and be made available online.\r\n\r\n   D. The IESG will not make any determination that any terms for the\r\n      use of an Implementing Technology (e.g., the assurance of\r\n      reasonable and non-discriminatory terms) have been fulfilled in\r\n      practice.  It will instead apply the normal requirements for the\r\n      advancement of Internet Standards (see RFC 6410).  If the two\r\n      unrelated implementations of the specification that are required\r\n      to advance from Proposed Standard to Internet Standard have been\r\n      produced by different organizations or individuals, or if the\r\n      \"significant implementation and successful operational experience\"\r\n      required to advance from Proposed Standard to Internet Standard\r\n      has been achieved, the IESG will presume that the terms are\r\n      reasonable and to some degree non-discriminatory.  Note that this\r\n      also applies to the case where multiple implementers have\r\n      concluded that no licensing is required.\r\n\r\n      This presumption may be challenged at any time, including during\r\n      the Last Call period by sending email to the IESG.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 9]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n5.  IPR Disclosures\r\n\r\n   This document refers to the IETF Participant making disclosures,\r\n   consistent with the general IETF philosophy that Participants in the\r\n   IETF act as individuals.  A Participant's obligation to make a\r\n   disclosure is also considered satisfied if the IPR owner, which may\r\n   be the Participant's employer or sponsor, makes an appropriate\r\n   disclosure in place of the Participant doing so.\r\n\r\n5.1.  Who Must Make an IPR Disclosure?\r\n\r\n5.1.1.  A Contributor's IPR in His or Her Contribution\r\n\r\n   Any Contributor who reasonably and personally knows of IPR meeting\r\n   the conditions of Section 5.6 which the Contributor believes Covers\r\n   or may ultimately Cover his or her written Contribution that is\r\n   intended to be used as an input into the IETF Standards Process, or\r\n   which the Contributor reasonably and personally knows his or her\r\n   employer or sponsor may assert against Implementing Technologies\r\n   based on such written Contribution, must make a disclosure in\r\n   accordance with Section 5.\r\n\r\n5.1.2.  An IETF Participant's IPR in Contributions by Others\r\n\r\n   If an individual's Participation relates to a written Contribution\r\n   made by somebody else that is intended to be used as an input into\r\n   the IETF Standards Process, and such Participant reasonably and\r\n   personally knows of IPR meeting the conditions of Section 5.6 which\r\n   the Participant believes Covers or may ultimately Cover that\r\n   Contribution, or which the Participant reasonably and personally\r\n   knows his or her employer or sponsor may assert against Implementing\r\n   Technologies based on such written Contribution, then such\r\n   Participant must make a disclosure in accordance with Section 5.\r\n\r\n5.1.3.  Voluntary IPR Disclosures\r\n\r\n   If any person has information about IPR that may Cover a technology\r\n   relevant to the IETF Standards Process, but such person is not\r\n   required to disclose such IPR under Sections 5.1.1 or 5.1.2 above,\r\n   such person is nevertheless encouraged to file an IPR disclosure as\r\n   described in Section 5.3 below.  Such an IPR disclosure should be\r\n   filed as soon as reasonably possible after the person realizes that\r\n   such IPR may Cover a Contribution.  Situations in which such\r\n   voluntary IPR disclosures may be made include when (a) IPR does not\r\n   meet the criteria in Section 5.6 because it is not owned or\r\n   controlled by an IETF Participant or his or her sponsor or employer\r\n   (referred to as third party IPR), (b) an individual is not required\r\n   to disclose IPR meeting the requirements of Section 5.6 because that\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 10]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   individual is not Participating in the relevant IETF activity, or (c)\r\n   the IPR Covers technology that does not yet meet the criteria for a\r\n   Contribution hereunder (e.g., it is disclosed in an informal or other\r\n   non-IETF setting).\r\n\r\n5.2.  The Timing of Disclosure\r\n\r\n   Timely IPR disclosure is important because working groups need to\r\n   have as much information as they can while they are evaluating\r\n   alternative solutions.\r\n\r\n5.2.1.  Timing of Disclosure under Section 5.1.1\r\n\r\n   A. The IPR disclosure required pursuant to Section 5.1.1 must be made\r\n      as soon as reasonably possible after the Contribution is submitted\r\n      or made unless the required disclosure is already on file.  See\r\n      Section 5.4.2 for a discussion of when updates need to be made for\r\n      an existing disclosure.\r\n\r\n   B. If a Contributor first learns of IPR in its Contribution that\r\n      meets the conditions of Section 5.6, for example a new patent\r\n      application or the discovery of a relevant patent in a patent\r\n      portfolio, after the Contribution is published in an Internet-\r\n      Draft, a disclosure must be made as soon as reasonably possible\r\n      after the IPR becomes reasonably and personally known to the\r\n      Contributor.\r\n\r\n5.2.2.  Timing of Disclosure under Section 5.1.2\r\n\r\n   The IPR disclosure required pursuant to Section 5.1.2 must be made as\r\n   soon as reasonably possible after the Contribution is made, unless\r\n   the required disclosure is already on file.\r\n\r\n   Participants who realize that IPR meeting the conditions of Section\r\n   5.6 may Cover technology that will be or has been incorporated into a\r\n   Contribution, or is seriously being discussed in a working group, are\r\n   strongly encouraged to make a preliminary IPR disclosure.  That IPR\r\n   disclosure should be made as soon after coming to the realization as\r\n   reasonably possible, not waiting until the Contribution is actually\r\n   made.\r\n\r\n   If an IETF Participant first learns of IPR that meets the conditions\r\n   of Section 5.6 that may Cover a Contribution by another party, for\r\n   example a new patent application or the discovery of a relevant\r\n   patent in a patent portfolio, after the Contribution is made, an IPR\r\n   disclosure must be made as soon as reasonably possible after the\r\n   Contribution or IPR becomes reasonably and personally known to the\r\n   Participant.\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 11]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n5.2.3.  Timing of Disclosure by ADs and Others\r\n\r\n   By the nature of their office, IETF Area Directors or persons\r\n   assisting them may become aware of Contributions late in the process\r\n   (for example at IETF Last Call or during IESG review) and, therefore\r\n   in such cases, cannot reasonably be expected to disclose IPR Covering\r\n   those Contributions until they become aware of them.\r\n\r\n5.3.  How Must an IPR Disclosure be Made?\r\n\r\n   IPR disclosures must be made by following the instructions at\r\n   <https://www.ietf.org/ipr-instructions>.  IPR disclosures and other\r\n   IPR-related information, including licensing information, must not be\r\n   included in RFCs or other IETF Contributions.  The RFC Editor will\r\n   remove any IPR-related information from Contributions prior to\r\n   publication as an RFC.\r\n\r\n5.4.  What Must Be in an IPR Disclosure?\r\n\r\n5.4.1.  Content of IPR Disclosures\r\n\r\n   An IPR disclosure must include the following information to the\r\n   extent reasonably available to the discloser: (a) the numbers of any\r\n   issued patents or published patent applications (or indicate that the\r\n   disclosure is based on unpublished patent applications), (b) the\r\n   name(s) of the inventor(s) (with respect to issued patents and\r\n   published patent applications), (c) the specific IETF Document(s) or\r\n   activity affected, and (d) if the IETF Document is an Internet-Draft,\r\n   its specific version number.  In addition, if it is not reasonably\r\n   apparent which part of an IETF Document is allegedly Covered by\r\n   disclosed IPR, then it is helpful if the discloser identifies the\r\n   sections of the IETF Document that are allegedly Covered by such\r\n   disclosed IPR.\r\n\r\n5.4.2.  Updating IPR Disclosures\r\n\r\n   Those who disclose IPR should be aware that as Internet-Drafts\r\n   evolve, text may be added or removed, and it is recommended that they\r\n   keep this in mind when composing text for disclosures.\r\n\r\n   A. Unless sufficient information to identify the issued patent was\r\n      disclosed when the patent application was disclosed, an IPR\r\n      disclosure must be updated or a new disclosure made promptly after\r\n      any of the following has occurred: (1) the publication of a\r\n      previously unpublished patent application, (2) the abandonment of\r\n      a patent application, (3) the issuance of a patent on a previously\r\n      disclosed patent application, or (4) a material change to the IETF\r\n      Document covered by the Disclosure that causes the Disclosure to\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 12]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      be covered by additional IPR.  If the patent application was\r\n      abandoned, then the new IPR disclosure must explicitly withdraw\r\n      any earlier IPR disclosures based on the application.  IPR\r\n      disclosures against a particular Contribution are assumed to be\r\n      inherited by revisions of the Contribution and by any RFCs that\r\n      are published from the Contribution unless the disclosure has been\r\n      updated or withdrawn.\r\n\r\n   B. If an IPR holder files patent applications in additional countries\r\n      which refer to, and the claims of which are substantially\r\n      identical to, the claims of a patent or patent application\r\n      previously disclosed in an IPR disclosure, the IPR holder is not\r\n      required to make a new or updated IPR disclosure as a result of\r\n      filing such applications or the issuance of patents on such\r\n      applications.\r\n\r\n   C. New or revised IPR disclosures may be made voluntarily at any\r\n      other time, provided that licensing information may only be\r\n      updated in accordance with Section 5.5.C.\r\n\r\n   D. Any person may submit an update to an existing IPR disclosure.  If\r\n      such update is submitted by a person other than the submitter of\r\n      the original IPR disclosure (as identified by name and email\r\n      address), then the IETF Secretariat shall attempt to contact the\r\n      original submitter to verify the update.  If the original\r\n      submitter responds that the proposed update is valid, the\r\n      Secretariat will update the IPR disclosure accordingly.  If the\r\n      original submitter responds that the proposed update is not valid,\r\n      the IETF Secretariat will not update the IPR disclosure.  If the\r\n      original submitter fails to respond after the IETF Secretariat has\r\n      made three separate inquiries and at least 30 days have elapsed\r\n      since the initial inquiry was made, then the IETF Secretariat will\r\n      inform the submitter of the proposed update that the update was\r\n      not validated and that the updater must produce legally sufficient\r\n      evidence that the submitter (or his/her employer) owns or has the\r\n      legal right to exercise control over the IPR subject to the IPR\r\n      disclosure.  If such evidence is satisfactory to the IETF\r\n      Secretariat, after consultation with the IETF legal counsel, then\r\n      the IETF Secretariat will make the requested update.  If such\r\n      evidence is not satisfactory, then the IETF Secretariat will not\r\n      make the requested update.\r\n\r\n5.4.3.  Blanket IPR Statements\r\n\r\n   The requirement to make an IPR disclosure is not satisfied by the\r\n   submission of a blanket statement that IPR may exist on every\r\n   Contribution or a general category of Contributions.  This is the\r\n   case because the aim of the disclosure requirement is to provide\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 13]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   information about specific IPR against specific technology under\r\n   discussion in the IETF.  The requirement is also not satisfied by a\r\n   blanket statement of willingness or commitment to license all\r\n   potential IPR Covering such technology under fair, reasonable, and\r\n   non-discriminatory terms for the same reason.  However, the\r\n   requirement for an IPR disclosure is satisfied by a blanket statement\r\n   of the IPR discloser's commitment to license all of its IPR meeting\r\n   the requirements of Section 5.6 (and either Section 5.1.1 or 5.1.2)\r\n   to implementers of an IETF specification on a royalty-free (and\r\n   otherwise reasonable and non-discriminatory) basis as long as any\r\n   other terms and conditions are disclosed in the IPR disclosure.\r\n\r\n5.5.  Licensing Information in an IPR Disclosure\r\n\r\n   A. Since IPR disclosures will be used by IETF working groups during\r\n      their evaluation of alternative technical solutions, it is helpful\r\n      if an IPR disclosure includes information about licensing of the\r\n      IPR in case Implementing Technologies require a license.\r\n      Specifically, it is helpful to indicate whether, upon approval by\r\n      the IESG for publication as an RFC of the relevant IETF\r\n      specification(s), all persons will be able to obtain the right to\r\n      implement, use, distribute, and exercise other rights with respect\r\n      to an Implementing Technology a) under a royalty-free and\r\n      otherwise reasonable and non-discriminatory license, or b) under a\r\n      license that contains reasonable and non-discriminatory terms and\r\n      conditions, including a reasonable royalty or other payment, or c)\r\n      without the need to obtain a license from the IPR holder (e.g., a\r\n      covenant not to sue with or without defensive suspension, as\r\n      described in Section 7).\r\n\r\n   B. The inclusion of a licensing declaration is not mandatory, but it\r\n      is encouraged so that the working groups will have as much\r\n      information as they can during their deliberations.  If the\r\n      inclusion of a licensing declaration in an IPR disclosure would\r\n      significantly delay its submission, then the discloser may submit\r\n      an IPR disclosure without a licensing declaration and then submit\r\n      a new IPR disclosure when the licensing declaration becomes\r\n      available.  IPR disclosures that voluntarily provide text that\r\n      includes licensing information, comments, notes, or URLs for other\r\n      information may also voluntarily include details regarding\r\n      specific licensing terms that the IPR holder intends to offer to\r\n      implementers of Implementing Technologies, including maximum\r\n      royalties.\r\n\r\n   C. It is likely that IETF will rely on licensing declarations and\r\n      other information that may be contained in an IPR disclosure and\r\n      that implementers will make technical, legal, and commercial\r\n      decisions on the basis of such commitments and information.  Thus,\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 14]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      when licensing declarations and other information, comments,\r\n      notes, or URLs for further information are contained in an IPR\r\n      disclosure, the persons making such disclosure agree and\r\n      acknowledge that the commitments and information contained in such\r\n      disclosure shall be irrevocable and will attach, to the extent\r\n      permissible by law, to the associated IPR, and all implementers of\r\n      Implementing Technologies will be justified and entitled to rely\r\n      on such materials in relating to such IPR, whether or not such IPR\r\n      is subsequently transferred to a third party by the IPR holder\r\n      making the commitment or providing the information.  IPR holders\r\n      making IPR disclosures that contain licensing declarations or\r\n      providing such information, comments, notes, or URLs for further\r\n      information must ensure that such commitments are binding on any\r\n      transferee of the relevant IPR, and that such transferee will use\r\n      reasonable efforts to ensure that such commitments are binding on\r\n      a subsequent transferee of the relevant IPR, and so on.\r\n\r\n   D. Licensing declarations must be made by people who are authorized\r\n      to make such declarations as discussed in Section 5.6 of this\r\n      document.\r\n\r\n5.6.  Level of Control over IPR Requiring Disclosure\r\n\r\n   IPR disclosures under Sections 5.1.1 and 5.1.2 are required with\r\n   respect to IPR (a) that is owned, directly or indirectly, by the\r\n   individual Contributor or his/her employer or sponsor (if any), or\r\n   (b) that such persons otherwise have the right to license or assert,\r\n   or (c) from which such persons derive a direct or indirect pecuniary\r\n   benefit, or (d) as to which an individual Contributor is listed as an\r\n   inventor on the relevant patent or patent application.\r\n\r\n5.7.  Disclosures for Oral Contributions\r\n\r\n   If a Contribution is oral and is not followed promptly by a written\r\n   disclosure of the same material, and if such oral Contribution would\r\n   be subject to a requirement that an IPR Disclosure be made (had such\r\n   oral Contribution been written), then the Contributor must accompany\r\n   such oral Contribution with an oral declaration that he/she is aware\r\n   of relevant IPR in as much detail as reasonably possible or file an\r\n   IPR Declaration with respect to such oral Contribution that otherwise\r\n   complies with the provisions of Sections 5.1 to 5.6 above.\r\n\r\n5.8.  General Disclosures\r\n\r\n   As described in Section 5.3, the IETF will make available a public\r\n   facility (e.g., a web page and associated database) for the posting\r\n   of IPR disclosures conforming with the disclosure requirements of\r\n   this policy.  In addition, the IETF may make available a public\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 15]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   facility for the posting of other IPR-related information and\r\n   disclosures that do not satisfy the requirements of this policy but\r\n   which may otherwise be informative and relevant to the IETF (\"General\r\n   Disclosures\").  Such General Disclosures may include, among other\r\n   things, \"blanket disclosures\" that do not contain a royalty-free\r\n   licensing commitment as described in Section 5.4.3, disclosures of\r\n   IPR that do not identify the specific IETF Documents Covered by the\r\n   disclosed IPR, and licensing statements or commitments that are\r\n   applicable generally and not to specific IPR disclosures.  All of\r\n   this information may be helpful to the IETF community, and its\r\n   disclosure is encouraged.  However, General Disclosures do not\r\n   satisfy an IETF Participant's obligation to make IPR disclosures as\r\n   required by this policy.\r\n\r\n   In some cases, if an IPR disclosure submitted by an IETF Participant\r\n   does not meet the requirements of this policy, the IETF may elect to\r\n   post the non-conforming IPR disclosure as a General Disclosure in\r\n   order to provide the greatest amount of information to the IETF\r\n   community.  This action does not excuse the IETF Participant from\r\n   submitting a new IPR disclosure that conforms with the requirements\r\n   of Sections 5.1 to 5.6.  The IETF reserves the right to decline to\r\n   publish General Disclosures that are not relevant to IETF activities,\r\n   that are, or are suspected of being, defamatory, false, misleading,\r\n   in violation of privacy or other applicable laws or regulations, or\r\n   that are in a format that is not suitable for posting on the IETF\r\n   facility that has been designated for General Disclosures.\r\n\r\n6.  Failure to Disclose\r\n\r\n   There may be cases in which individuals are not permitted by their\r\n   employers or by other factors to disclose the existence or substance\r\n   of patent applications or other IPR.  Since disclosure is required\r\n   for anyone making a Contribution or Participating in IETF activities,\r\n   a person who is not willing or able to disclose IPR for this reason,\r\n   or any other reason, must not contribute to or participate in IETF\r\n   activities with respect to technologies that he or she reasonably and\r\n   personally knows may be Covered by IPR which he or she will not\r\n   disclose, unless that person knows that his or her employer or\r\n   sponsor will make the required disclosures on his or her behalf.\r\n\r\n   Contributing to or Participating in IETF activities about a\r\n   technology without making required IPR disclosures is a violation of\r\n   IETF policy.\r\n\r\n   In addition to any remedies or defenses that may be available to\r\n   implementers and others under the law with respect to such a\r\n   violation (e.g., rendering the relevant IPR unenforceable), sanctions\r\n   are available through the normal IETF processes for handling\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 16]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   disruptions to IETF work.  See [RFC6701] for details regarding the\r\n   sanctions defined in various existing Best Current Practice\r\n   documents.\r\n\r\n7.  Evaluating Alternative Technologies in IETF Working Groups\r\n\r\n   In general, IETF working groups prefer technologies with no known IPR\r\n   claims or, for technologies with claims against them, an offer of\r\n   royalty-free licensing.  However, to solve a given technical problem,\r\n   IETF working groups have the discretion to adopt a technology as to\r\n   which IPR claims have been made if they feel that this technology is\r\n   superior enough to alternatives with fewer IPR claims or free\r\n   licensing to outweigh the potential cost of the licenses.  To assist\r\n   these working groups, it is helpful for the IPR claimants to declare,\r\n   in their IPR Declarations, the terms, if any, on which they are\r\n   willing to license their IPR Covering the relevant IETF Documents.\r\n\r\n   A. When adopting new technologies, the participants in an IETF\r\n      working group are expected to evaluate all the relevant tradeoffs\r\n      from their perspective.  Most of the time these considerations are\r\n      based purely on technical excellence, but IPR considerations may\r\n      also affect the evaluation and specific licensing terms may affect\r\n      the participants' opinion on the desirability of adopting a\r\n      particular technology.\r\n\r\n   B. The IETF has no official preference among different licensing\r\n      terms beyond what was stated at the beginning of this section.\r\n      However, for information and to assist participants in\r\n      understanding what license conditions may imply, what follows are\r\n      some general observations about some common types of conditions.\r\n      The following paragraphs are provided for information only:\r\n\r\n   C. When there is no commitment to license patents covering the\r\n      technology, this creates uncertainty that obviously is concerning.\r\n      These concerns do not exist when there is a commitment to license,\r\n      but the license terms can still differ greatly.  Some common\r\n      conditions include 1) terms that are fair, reasonable, and non-\r\n      discriminatory, and which may bear royalties or other financial\r\n      obligations (FRAND or RAND); 2) royalty-free terms that are\r\n      otherwise fair, reasonable, and non-discriminatory (RAND-z); and\r\n      3) commitments not to assert declared IPR, possibly conditional on\r\n      reciprocity.  Open source projects, for instance, often prefer the\r\n      latter two.  Note that licenses often come with complex terms that\r\n      have to be evaluated in detail, and this crude classification may\r\n      not be sufficient to make a proper evaluation.  For instance,\r\n      licenses may also include reciprocity and defensive suspension\r\n      requirements that require careful evaluation.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 17]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   D. The level of use of a technology against which IPR is disclosed is\r\n      also an important factor in weighing IPR encumbrances and\r\n      associated licensing conditions against technical merits.  For\r\n      example, if technologies are being considered for a mandatory-to-\r\n      implement change to a widely deployed protocol, the hurdle should\r\n      be very high for encumbered technologies, whereas a similar hurdle\r\n      for a new protocol could conceivably be lower.\r\n\r\n   E. IETF working groups and IETF areas may, however, adopt stricter\r\n      requirements in specific cases.  For instance, the IETF Security\r\n      Area has adopted stricter requirements for some security\r\n      technologies.  It has become common to have a mandatory-to-\r\n      implement security technology in IETF technology specifications.\r\n      This is to ensure that there will be at least one common security\r\n      technology present in all implementations of such a specification\r\n      that can be used in all cases.  This does not limit the\r\n      specification from including other security technologies, the use\r\n      of which could be negotiated between implementations.  An IETF\r\n      consensus has developed that no mandatory-to-implement security\r\n      technology can be specified in an IETF specification unless it has\r\n      no known IPR claims against it or a royalty-free license is\r\n      available to implementers of the specification.  It is possible to\r\n      specify such a technology in violation of this principle if there\r\n      is a very good reason to do so and if that reason is documented\r\n      and agreed to through IETF consensus.  This limitation does not\r\n      extend to other security technologies in the same specification if\r\n      they are not listed as mandatory to implement.\r\n\r\n   F. It should also be noted that the absence of IPR disclosures at any\r\n      given time is not the same thing as the knowledge that there will\r\n      be no IPR disclosure in the future, or that no IPR Covers the\r\n      relevant technology.  People or organizations not currently\r\n      involved in the IETF or people or organizations that discover IPR\r\n      they feel to be relevant in their patent portfolios can make IPR\r\n      disclosures at any time.\r\n\r\n   G. It should be noted that the validity and enforceability of any IPR\r\n      may be challenged for legitimate reasons outside the IETF.  The\r\n      mere existence of an IPR disclosure should not be taken to mean\r\n      that the disclosed IPR is valid or enforceable or actually Covers\r\n      a particular Contribution.  Although the IETF can make no actual\r\n      determination of validity, enforceability, or applicability of any\r\n      particular IPR, it is reasonable that individuals in a working\r\n      group or the IESG will take into account their own views of the\r\n      validity, enforceability, or applicability of IPR in their\r\n      evaluation of alternative technologies.\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 18]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n8.  Change Control for Technologies\r\n\r\n   The IETF must have change control over the technology described in\r\n   any Standards Track IETF Documents in order to fix problems that may\r\n   be discovered or to produce other derivative works.\r\n\r\n   In some cases, the developer of patented or otherwise controlled\r\n   technology may decide to hand over to the IETF the right to evolve\r\n   the technology (a.k.a., \"change control\").  The implementation of an\r\n   agreement between the IETF and the developer of the technology can be\r\n   complex.  (See [RFC1790] and [RFC2339] for examples.)\r\n\r\n   Note that there is no inherent prohibition against a Standards Track\r\n   IETF Document making a normative reference to proprietary technology.\r\n   For example, a number of IETF standards support proprietary\r\n   cryptographic transforms.\r\n\r\n9.  Licensing Requirements to Advance Standards Track IETF Documents\r\n\r\n   Section 2.2 of RFC 6410 [RFC6410] states:\r\n\r\n      If the technology required to implement the specification requires\r\n      patented or otherwise controlled technology, then the set of\r\n      implementations must demonstrate at least two independent,\r\n      separate and successful uses of the licensing process.\r\n\r\n   A key word in this text is \"requires\".  The mere existence of\r\n   disclosed IPR does not necessarily mean that licenses are actually\r\n   required in order to implement the technology.\r\n\r\n10.  No IPR Disclosures in IETF Documents\r\n\r\n   IETF Documents must not contain any mention of specific IPR.  All\r\n   specific IPR disclosures must be submitted as described in Section 5.\r\n   Readers should always refer to the online web page\r\n   <https://www.ietf.org/ipr/> to get a full list of IPR disclosures\r\n   received by the IETF concerning any Contribution.\r\n\r\n11.  Application to Non-IETF Stream Documents\r\n\r\n   This document has been developed for the benefit and use of the IETF\r\n   community.  As such, the rules set forth herein apply to all\r\n   Contributions and IETF Documents that are in the \"IETF Document\r\n   Stream\" as defined in Section 5.1.1 of [RFC4844] (i.e., those that\r\n   are contributed, developed, edited, and published as part of the IETF\r\n   Standards Process).\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 19]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   The rules that apply to documents in Alternate Streams are\r\n   established by the managers of those Alternate Streams (currently the\r\n   Internet Architecture Board (IAB), Internet Research Steering Group\r\n   (IRSG), and Independent Submission Editor, as specified in\r\n   [RFC4844]).  These managers may elect, through their own internal\r\n   processes, to cause this document to be applied to documents\r\n   contributed to them for development, editing, and publication in\r\n   their respective Alternate Streams.  If an Alternate Stream manager\r\n   elects to adopt this document, they must do so in a manner that is\r\n   public and notifies their respective document Contributors that this\r\n   document applies to their respective Alternate Streams.  In such\r\n   case, each occurrence of the term \"Contribution\" and \"IETF Document\"\r\n   in this document shall be read to mean a contribution or document in\r\n   such Alternate Stream, as the case may be.  It would be advisable for\r\n   such Alternate Stream managers to consider adapting the definitions\r\n   of \"Contribution\" and other provisions in this document to suit their\r\n   particular needs.\r\n\r\n12.  Security Considerations\r\n\r\n   This document relates to the IETF process, not any particular\r\n   technology.  There are security considerations when adopting any\r\n   technology, whether IPR protected or not.  A working group should\r\n   take those security considerations into account as one part of\r\n   evaluating the technology, just as IPR is one part, but there are no\r\n   known issues of security with IPR procedures.\r\n\r\n13.  Changes since RFCs 3979 and 4879\r\n\r\n   The material in RFC 3979 was significantly reorganized to produce\r\n   this document.  This section reviews the actual changes in content\r\n   since RFC 3979 and does not detail the reorganization.  These changes\r\n   are listed from the point of view of this document with reference to\r\n   the RFC 3979 section where useful.  This section is intended only as\r\n   an informational summary of the text contained in Sections 1-12 of\r\n   this document.  This section does not constitute the official policy\r\n   of the IETF and should not be referred to or quoted as such.  Any\r\n   discrepancies or ambiguities shall be resolved in favor of the\r\n   language contained in Sections 1-12 of this document.\r\n\r\n   Boilerplate - Since the document boilerplate formerly in Section 5 of\r\n      RFC 3979 has been moved to the Trust Legal Provisions since 2009,\r\n      the boilerplate requirements have been deleted from this document.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 20]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   1 - Definitions\r\n\r\n      1.a - \"Alternate Stream\" definition (new): Added to enable IRTF,\r\n         IAB, and Independent Submission streams to adopt and use BCP 79\r\n         more easily.\r\n\r\n      1.c - \"Contribution\" (was 1.c)\r\n\r\n            Removed \"IETF\" to more easily enable other Streams to adopt\r\n            this policy.\r\n\r\n            Added \"intended to affect the IETF Standards Process\", which\r\n            is needed to prevent information presentations (e.g.,\r\n            plenary guest speakers) from being considered Contributions.\r\n\r\n            Added BOF, design team, web site, and chat room.\r\n            Contributions can be made in any of these places.\r\n\r\n      1.e - \"Covers\" (was 1.n) - Added \"provisional patent application\"\r\n         - Required to eliminate ambiguity whether provisional\r\n         applications are included.\r\n\r\n      1.h - \"IETF Documents\" (was 1.h) - Limited to IETF (not Alternate\r\n         Stream) documents.\r\n\r\n      1.i - \"IETF Standards Process\" (was 1.b) - Clarify that\r\n         Contributions can be made in contexts other than traditional\r\n         IETF standards development.\r\n\r\n      1.j - \"IPR\" (was 1.o) - Removed reference to copyrights, database\r\n         rights, and data rights.  Copyright in IETF Documents and\r\n         contributions is addressed under RFC 5378 and is treated very\r\n         differently than patents, which are the focus of BCP 79.\r\n         Data/database rights not relevant to IETF standards, and cannot\r\n         be registered or disclosed in the manner of patents.\r\n\r\n      1.l - \"Internet-Draft\" (was 1.g) - Reduced to reference RFC 2026\r\n         without additional description for clarity.\r\n\r\n      1.m - \"Participating in an IETF discussion or activity\" (new) -\r\n         Due to numerous ambiguities over the years, it was necessary to\r\n         add a section describing what it means to \"participate\" in an\r\n         IETF activity.\r\n\r\n      1.o - \"RFC\" (was 1.e) - Added cross-reference to RFC 2026 and\r\n         eliminated textual description of RFC permanence.\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 21]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   2 - Introduction - Added text that offers an overview of why we have\r\n      this policy, cut prior discussion of Section 10 of RFC 2026 as no\r\n      longer necessary, and added references to subsequent RFCs relating\r\n      to IPR, including RFC 5378 and 6702.\r\n\r\n   3 - Participation in the IETF (was \"Contributions to the IETF\") -\r\n      Changed focus to participation rather than making of Contributions\r\n      and explained why we require IPR disclosure.\r\n\r\n   old 3.2.1.C - Deleted because all required legends in IETF Documents\r\n      are now described in RFC 5378 and Trust Legal Provisions.\r\n\r\n   3.3 - Obligations on Participants - Added to make clear that\r\n      participation in IETF obligates the participant to comply with\r\n      IETF rules.\r\n\r\n   old 4.A - Removed because inconsistent with current and historical\r\n      practice.  Also, all legends in IETF Documents are now addressed\r\n      in Trust Legal Provisions.\r\n\r\n   4.A - \"The IESG, IAB...\" - Added IAB, ISOC, and IETF Trust to\r\n      disclaimer.\r\n\r\n   4.B - \"When the IETF Secretariat...\" - Added description of current\r\n      procedure used to publish third party IPR disclosures.\r\n\r\n   4.C - \"When an IPR disclosure...\" - Updated to reflect current\r\n      practice and roles (e.g., Secretariat rather than IETF Exec Dir).\r\n\r\n   4.D - Determination of Provision of Reasonable and Non-discriminatory\r\n      Terms (was Section 4.1) - Various edits made to this paragraph to\r\n      reflect current process for advancement of standards.\r\n\r\n   old 5 - Deleted because it was not needed.\r\n\r\n   5.1.1 - Contributor's IPR in His or Her Contribution (was Section\r\n      6.1.1) - Limits disclosure obligation to written Contributions\r\n      intended to be used as inputs to the IETF Standards Process.  Oral\r\n      disclosures are now covered in Section 5.7.\r\n\r\n   5.1.2 - An IETF Participant's IPR in Contributions by Others (was\r\n      Section 6.1.2) - Revisions made consistent with Section 5.1.1\r\n      above.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 22]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   5.1.3 -  Voluntary IPR Disclosures (was Section 6.1.3) - Fixes\r\n      procedures for making voluntary IPR disclosures and adds examples\r\n      of when voluntary disclosures may be appropriate.  In addition to\r\n      IPR of others, voluntary disclosures are encouraged when an IETF\r\n      Participant is aware of its own IPR that covers IETF work in which\r\n      it is not an active participant and when the technology is\r\n      disclosed in other than an IETF setting.\r\n\r\n   5.2.1 - Timing of Disclosure under Section 5.1.1 (was Section 6.2.1)\r\n      - Trigger for disclosure changed from publication of a\r\n      Contribution in an I-D to \"submitted or made\"; lengthy example\r\n      regarding updates deleted in lieu of cross-reference to Section\r\n      5.4.2 regarding updates.\r\n\r\n   5.2.2 - Timing of Disclosure under Section 5.1.2 (was Section 6.2.2)\r\n      - Corresponding changes made per Section 5.2.1.\r\n\r\n   5.2.3 - Timing of Disclosure by ADs - Added to clarify AD disclosure\r\n      obligations.\r\n\r\n   5.3 - \"IPR disclosures and other...\" - Reflects current practice\r\n      regarding prohibition of including IPR information directly in\r\n      IETF Documents.\r\n\r\n   5.4.1 - Content of IPR Disclosures (was Section 6.4.1) - Added\r\n      requirement to disclose names of inventors - Disclosing the\r\n      name(s) of inventors on a patent will make it more likely that\r\n      IETF Participants will recognize whether the inventor is an IETF\r\n      Participant and what IETF activities that individual participates\r\n      in.  This information is easy for the discloser to provide and\r\n      less convenient for every reader of the IPR disclosure to look up\r\n      in patent office records (if even available).\r\n\r\n   5.4.2 - Updating IPR Disclosures (was Section 6.4.2) - Significant\r\n      revisions and additional detail added regarding updating of IPR\r\n      disclosures upon events such as issuance of patents, amendment of\r\n      claims, employee changing jobs, employer acquires another company,\r\n      etc.\r\n\r\n   5.4.2.D - Clarify that additional IPR disclosures are not needed for\r\n      foreign counterparts.\r\n\r\n   5.4.3 - Blanket IPR Statements (was Section 6.4.3) - wording\r\n      clarifications and changed \"willingness\" to \"commitment\".  A\r\n      blanket IPR disclosure which does not list specific patent numbers\r\n      is not compliant with this policy unless the discloser commits\r\n      (and is not just willing) to license such patents on royalty-free\r\n      and otherwise reasonable terms.\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 23]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   5.5.C - \"It is likely that IETF will rely ...\" (new paragraph) -\r\n      Makes licensing declarations irrevocable so that they may be\r\n      relied upon in the future by implementers.\r\n\r\n   5.5.D - \"Licensing declarations ...\" (new paragraph) - Requires that\r\n      licensing declarations must be made by people authorized to make\r\n      them.\r\n\r\n   5.6 - Level of Control over IPR Requiring Disclosure (was Section\r\n      6.6) - In addition to ownership of IPR, language added to require\r\n      disclosure when Participants derive a pecuniary benefit from the\r\n      IPR, or the individual is a listed inventor - Clarifications to\r\n      address situations not covered in earlier version.\r\n\r\n   5.7 - Disclosures for Oral Contributions (new): Describes procedure\r\n      for oral Contributions.  Previously, statements regarding oral\r\n      statements were contradictory.  Some places said that disclosures\r\n      must be made for oral statements, but others talk about\r\n      disclosures only being required following publication as an I-D.\r\n      Under new text, oral statements don't trigger the normal IPR\r\n      disclosure obligations, as oral statements are inherently\r\n      imprecise and it's hard to know when they describe something\r\n      covered by the technical terms of a patent claim.  However, if an\r\n      oral contribution is made and it is not followed by a written\r\n      contribution, then the oral discloser must either make a\r\n      concurrent oral IPR disclosure or file a formal written\r\n      disclosure.\r\n\r\n   5.8 - General Disclosures (new) - Describes the IETF's public\r\n      disclosure feature, which allows IPR disclosures to be made by\r\n      anyone, whether or not an IETF Participant.  The feature has been\r\n      up and running for years, and this language describes its current\r\n      implementation.\r\n\r\n   6 - Failure to Disclose (was Section 7) - Technical and clarity\r\n      corrections, as well as new language describing potential remedies\r\n      for failures to disclose IPR in accordance with IETF rules,\r\n      including IESG actions described in RFC 6701.\r\n\r\n   7 - Evaluating Alternative Technologies in IETF Working Groups (was\r\n      Section 8).\r\n\r\n      Paragraph 1 - Minor wording changes for clarity.\r\n\r\n      Paragraphs 2-5 (new) - Relate to the considerations made by IETF\r\n          WGs when evaluating patent and licensing disclosures\r\n         concerning IETF standards.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 24]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      Paragraph 6 - security technologies (new) - Makes clear that\r\n         security is only one example of stricter requirements.  Also\r\n         requires that violation of requirements for royalty-free\r\n         licensing in the security area can be made only with IETF\r\n         consensus.\r\n\r\n      Paragraphs 7-8 (were paragraphs 3-4) - Wording changes for\r\n         clarity.\r\n\r\n   9 - Licensing Requirements to Advance Standards Track IETF Documents\r\n      (was Section 10) - Wording updated to reflect RFC 6410.\r\n\r\n   10 - No IPR Disclosures in IETF Documents (was Section 11) - Wording\r\n      simplified to refer to Section 5.\r\n\r\n   11 - Application to Non-IETF Stream Documents (new) - Adds procedures\r\n      to be followed by Alternate Stream (IAB, IRTF, Independent\r\n      Submission) managers to adopt these rules and procedures.\r\n      Borrowed and adapted the copyright language used in the Trust\r\n      Legal Provisions.  Each Alternate Stream (Independent Submission,\r\n      IRTF, and IAB) would need to take some action (preferably issuing\r\n      an RFC) to adopt BCP 79 for its stream.  This was done with\r\n      copyright already, and pretty smoothly.\r\n\r\n14.  References\r\n\r\n14.1.  Normative References\r\n\r\n   [RFC2026] Bradner, S., \"The Internet Standards Process -- Revision\r\n             3\", BCP 9, RFC 2026, DOI 10.17487/RFC2026, October 1996,\r\n             <http://www.rfc-editor.org/info/rfc2026>.\r\n\r\n   [RFC2028] Hovey, R. and S. Bradner, \"The Organizations Involved in\r\n             the IETF Standards Process\", BCP 11, RFC 2028,\r\n             DOI 10.17487/RFC2028, October 1996,\r\n             <http://www.rfc-editor.org/info/rfc2028>.\r\n\r\n   [RFC4844] Daigle, L., Ed., and Internet Architecture Board, \"The RFC\r\n             Series and RFC Editor\", RFC 4844, DOI 10.17487/RFC4844,\r\n             July 2007, <http://www.rfc-editor.org/info/rfc4844>.\r\n\r\n   [RFC6410] Housley, R., Crocker, D., and E. Burger, \"Reducing the\r\n             Standards Track to Two Maturity Levels\", BCP 9, RFC 6410,\r\n             DOI 10.17487/RFC6410, October 2011,\r\n             <http://www.rfc-editor.org/info/rfc6410>.\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 25]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n14.2.  Informative References\r\n\r\n   [RFC1790] Cerf, V., \"An Agreement between the Internet Society and\r\n             Sun Microsystems, Inc. in the Matter of ONC RPC and XDR\r\n             Protocols\", RFC 1790, DOI 10.17487/RFC1790, April 1995,\r\n             <http://www.rfc-editor.org/info/rfc1790>.\r\n\r\n   [RFC2339] The Internet Society and Sun Microsystems, \"An Agreement\r\n             Between the Int",
    "notes": "Internet Engineering Task Force (IETF)                        S. Bradner\r\nRequest for Comments: 8179                            Harvard University\r\nBCP: 79                                                     J. Contreras\r\nObsoletes: 3979, 4879                                 University of Utah\r\nUpdates: 2026                                                   May 2017\r\nCategory: Best Current Practice\r\nISSN: 2070-1721\r\n\r\n\r\n            Intellectual Property Rights in IETF Technology\r\n\r\nAbstract\r\n\r\n   The IETF policies about Intellectual Property Rights (IPR), such as\r\n   patent rights, relative to technologies developed in the IETF are\r\n   designed to ensure that IETF working groups and participants have as\r\n   much information as possible about any IPR constraints on a technical\r\n   proposal as early as possible in the development process.  The\r\n   policies are intended to benefit the Internet community and the\r\n   public at large, while respecting the legitimate rights of IPR\r\n   holders.  This document sets out the IETF policies concerning IPR\r\n   related to technology worked on within the IETF.  It also describes\r\n   the objectives that the policies are designed to meet.  This document\r\n   updates RFC 2026 and, with RFC 5378, replaces Section 10 of RFC 2026.\r\n   This document also obsoletes RFCs 3979 and 4879.\r\n\r\nStatus of This Memo\r\n\r\n   This memo documents an Internet Best Current Practice.\r\n\r\n   This document is a product of the Internet Engineering Task Force\r\n   (IETF).  It represents the consensus of the IETF community.  It has\r\n   received public review and has been approved for publication by the\r\n   Internet Engineering Steering Group (IESG).  Further information on\r\n   BCPs is available in Section 2 of RFC 7841.\r\n\r\n   Information about the current status of this document, any errata,\r\n   and how to provide feedback on it may be obtained at\r\n   http://www.rfc-editor.org/info/rfc8179.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 1]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\nCopyright Notice\r\n\r\n   Copyright (c) 2017 IETF Trust and the persons identified as the\r\n   document authors.  All rights reserved.\r\n\r\n   This document is subject to BCP 78 and the IETF Trust's Legal\r\n   Provisions Relating to IETF Documents\r\n   (http://trustee.ietf.org/license-info) in effect on the date of\r\n   publication of this document.  Please review these documents\r\n   carefully, as they describe your rights and restrictions with respect\r\n   to this document.  Code Components extracted from this document must\r\n   include Simplified BSD License text as described in Section 4.e of\r\n   the Trust Legal Provisions and are provided without warranty as\r\n   described in the Simplified BSD License.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 2]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\nTable of Contents\r\n\r\n   1. Definitions  . . . . . . . . . . . . . . . . . . . . . . . . .  4\r\n   2. Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  6\r\n   3. Participation in the IETF  . . . . . . . . . . . . . . . . . .  8\r\n   3.1. General Policy   . . . . . . . . . . . . . . . . . . . . . .  8\r\n   3.2. Rights and Permissions in Contributions. . . . . . . . . . .  8\r\n   3.3. Obligations on Participants  . . . . . . . . . . . . . . . .  8\r\n   4.  Actions for Documents for Which IPR Disclosure(s)\r\n       Have Been Received  . . . . . . . . . . . . . . . . . . . . .  8\r\n   5. IPR Disclosures  . . . . . . . . . . . . . . . . . . . . . . . 10\r\n   5.1. Who Must Make an IPR Disclosure? . . . . . . . . . . . . . . 10\r\n   5.1.1.  A Contributor's IPR in His or Her Contribution  . . . . . 10\r\n   5.1.2. An IETF Participant's IPR in Contributions by Others   . . 10\r\n   5.1.3. IPR of Others  . . . . . . . . . . . . . . . . . . . . . . 10\r\n   5.2. The Timing of Providing Disclosure . . . . . . . . . . . . . 11\r\n   5.2.1. Timing of Disclosure under Section 5.1.1 . . . . . . . . . 11\r\n   5.2.2. Timing of Disclosure under Section 5.1.2 . . . . . . . . . 11\r\n   5.2.3. Timing of Disclosure by ADs and Others . . . . . . . . . . 12\r\n   5.3. How Must an IPR Disclosure be Made?  . . . . . . . . . . . . 12\r\n   5.4. What Must be in an IPR Disclosure? . . . . . . . . . . . . . 12\r\n   5.4.1. Content of IPR Disclosures . . . . . . . . . . . . . . . . 12\r\n   5.4.2. Updating IPR Disclosures . . . . . . . . . . . . . . . . . 12\r\n   5.4.3. Blanket IPR Statements . . . . . . . . . . . . . . . . . . 13\r\n   5.5. Licensing Information in an IPR Disclosure . . . . . . . . . 14\r\n   5.6. Level of Control over IPR Requiring Disclosure . . . . . . . 15\r\n   5.7. Disclosures for Oral Contributions . . . . . . . . . . . . . 15\r\n   5.8.  General Disclosures . . . . . . . . . . . . . . . . . . . . 15\r\n   6. Failure to Disclose  . . . . . . . . . . . . . . . . . . . . . 16\r\n   7. Evaluating Alternative Technologies in IETF Working Groups . . 17\r\n   8. Change Control for Technologies  . . . . . . . . . . . . . . . 19\r\n   9. Licensing Requirements to Advance Standards Track\r\n      IETF Documents . . . . . . . . . . . . . . . . . . . . . . . . 19\r\n   10. No IPR Disclosures in IETF Documents  . . . . . . . . . . . . 19\r\n   11. Application to Non-IETF Stream Documents  . . . . . . . . . . 19\r\n   12. Security Considerations   . . . . . . . . . . . . . . . . . . 20\r\n   13. Changes since RFCs 3979 and 4879  . . . . . . . . . . . . . . 20\r\n   14. References  . . . . . . . . . . . . . . . . . . . . . . . . . 25\r\n   14.1. Normative References  . . . . . . . . . . . . . . . . . . . 25\r\n   14.2. Informative References  . . . . . . . . . . . . . . . . . . 26\r\n   Editors' Addresses  . . . . . . . . . . . . . . . . . . . . . . . 26\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 3]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n1.  Definitions\r\n\r\n   The following definitions are for terms used in the context of this\r\n   document.  Other terms, including \"IESG,\" \"ISOC,\" \"IAB,\" and \"RFC\r\n   Editor,\" are defined in [RFC2028].\r\n\r\n   a. \"Alternate Stream\":  the IAB Document Stream, the IRTF Document\r\n      Stream, and the Independent Submission Stream, each as defined in\r\n      Section 5.1 of [RFC4844], along with any future non-IETF streams\r\n      that might be defined.\r\n\r\n   b. \"Blanket IPR Statement\" or \"Blanket Disclosure\": see Section\r\n      5.4.3.\r\n\r\n   c. \"Contribution\": any submission to the IETF intended by the\r\n      Contributor for publication as all or part of an Internet-Draft or\r\n      RFC and any statement made within the context of an IETF activity,\r\n      in each case that is intended to affect the IETF Standards Process\r\n      or that is related to the activity of an Alternate Stream that has\r\n      adopted this policy.\r\n\r\n      Such statements include oral statements, as well as written and\r\n      electronic communications, which are addressed to:\r\n\r\n      o  any IETF plenary session,\r\n\r\n      o  any IETF working group (WG; see BCP 25) or portion thereof or\r\n         any WG chair on behalf of the relevant WG,\r\n\r\n      o  any IETF \"birds of a feather\" (BOF) session or portion thereof,\r\n\r\n      o  WG design teams (see BCP 25) and other design teams that intend\r\n         to deliver an output to IETF, or portions thereof,\r\n\r\n      o  the IESG, or any member thereof on behalf of the IESG,\r\n\r\n      o  the IAB, or any member thereof on behalf of the IAB,\r\n\r\n      o  any IETF mailing list, web site, chat room, or discussion board\r\n         operated by or under the auspices of the IETF, including the\r\n         IETF list itself,\r\n\r\n      o  the RFC Editor or the Internet-Drafts function.\r\n\r\n      Statements made outside of an IETF session, mailing list, or other\r\n      function, or that are clearly not intended to be input to an IETF\r\n      activity, group, or function, are not Contributions in the context\r\n      of this document.  And while the IETF's IPR rules apply in all\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 4]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      cases, not all presentations represent a Contribution.  For\r\n      example, many invited plenary, area-meeting, or research group\r\n      presentations will cover useful background material, such as\r\n      general discussions of existing Internet technology and products,\r\n      and will not be a Contribution.  (Some such presentations can\r\n      represent a Contribution as well, of course).  Throughout this\r\n      document, the term \"written Contribution\" is used.  For purposes\r\n      of this document, \"written\" means reduced to a written or visual\r\n      form in any language and any media, permanent or temporary,\r\n      including but not limited to traditional documents, email\r\n      messages, discussion board postings, slide presentations, text\r\n      messages, instant messages, and transcriptions of oral statements.\r\n\r\n   d. \"Contributor\": an individual submitting a Contribution\r\n\r\n   e. \"Covers\" or \"Covered\": a valid claim of a patent or a patent\r\n      application (including a provisional patent application) in any\r\n      jurisdiction, or any other Intellectual Property Right, would\r\n      necessarily be infringed by the exercise of a right (e.g., making,\r\n      using, selling, importing, distribution, copying, etc.) with\r\n      respect to an Implementing Technology.  For purposes of this\r\n      definition, \"valid claim\" means a claim of any unexpired patent or\r\n      patent application which shall not have been withdrawn, cancelled,\r\n      or disclaimed, nor held invalid by a court of competent\r\n      jurisdiction in an unappealed or unappealable decision.\r\n\r\n   f. \"General Disclosure\": see Section 5.8.\r\n\r\n   g. \"IETF\": In the context of this document, the IETF includes all\r\n      individuals who participate in meetings, working groups, mailing\r\n      lists, functions, and other activities that are organized or\r\n      initiated by ISOC, the IESG, or the IAB under the general\r\n      designation of the Internet Engineering Task Force, or IETF, but\r\n      solely to the extent of such participation.\r\n\r\n   h. \"IETF Documents\": RFCs and Internet-Drafts that are published as\r\n      part of the IETF Standards Process.  These are also referred to as\r\n      \"IETF Stream Documents\" as defined in Section 5.1.1 of [RFC4844].\r\n\r\n   i. \"IETF Standards Process\": the activities undertaken by the IETF in\r\n      any of the settings described in the above definition of\r\n      Contribution.  The IETF Standards Process may include\r\n      participation in activities and publication of documents that are\r\n      not directed toward the development of IETF standards or\r\n      specifications, such as the development and publication of\r\n      Informational and Experimental documents (see Section 4 of\r\n      [RFC2026]).\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 5]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   j. \"IPR\" or \"Intellectual Property Rights\": means a patent, utility\r\n      model, or similar right that may Cover an Implementing Technology,\r\n      whether such rights arise from a registration or renewal thereof,\r\n      or an application therefore, in each case anywhere in the world.\r\n      See [RFC5378] for a discussion of trademarks.\r\n\r\n   k. \"Implementing Technology\": a technology that implements an IETF\r\n      specification or standard.\r\n\r\n   l. \"Internet-Draft\": a document used in the IETF and RFC Editor\r\n      processes, as described in Section 2.2 of [RFC2026].\r\n\r\n   m. \"Participating in an IETF discussion or activity\": making a\r\n      Contribution, as described above, or in any other way acting in\r\n      order to influence the outcome of a discussion relating to the\r\n      IETF Standards Process.  Without limiting the generality of the\r\n      foregoing, acting as a Working Group Chair or Area Director\r\n      constitutes \"Participating\" in all activities of the relevant\r\n      working group(s) he or she is responsible for in an area.\r\n      \"Participant\" and \"IETF Participant\" mean any individual\r\n      Participating in an IETF discussion or activity.\r\n\r\n   m. \"Reasonably and personally known\": something an individual knows\r\n      personally or, because of the job the individual holds, would\r\n      reasonably be expected to know.  This wording is used to indicate\r\n      that an organization cannot purposely keep an individual in the\r\n      dark about patents or patent applications just to avoid the\r\n      disclosure requirement.  But this requirement should not be\r\n      interpreted as requiring the IETF Contributor or Participant (or\r\n      his or her represented organization, if any) to perform a patent\r\n      search to find applicable IPR.\r\n\r\n   o. \"RFC\": the basic publication series for the IETF.  RFCs are\r\n      published by the RFC Editor.  (See Section 2.1 of [RFC2026].)\r\n\r\n2.  Introduction\r\n\r\n   The IETF policies about Intellectual Property Rights (IPR), such as\r\n   patent rights, relative to technologies developed in the IETF are\r\n   designed to ensure that IETF working groups and Participants have as\r\n   much information as possible about any IPR constraints on a technical\r\n   proposal as early as possible in the development process.  The\r\n   policies are intended to benefit the Internet community and the\r\n   public at large, while respecting the legitimate rights of IPR\r\n   holders.  This document details the IETF policies concerning IPR\r\n   related to technology worked on within the IETF.  It also describes\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 6]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   the objectives that the policies are designed to meet.  This document\r\n   updates RFC 2026 and, with RFC 5378, replaces Section 10 of RFC 2026.\r\n   This document also obsoletes RFC 3979 and RFC 4879.\r\n\r\n   There are three basic principles regarding how the IETF deals with\r\n   claims of Intellectual Property Rights (originally outlined in\r\n   Section 10 of [RFC2026]):\r\n\r\n   (a) The IETF will make no determination about the validity of any\r\n       particular IPR claim.\r\n\r\n   (b) The IETF, following normal processes, can decide to use\r\n       technology for which IPR disclosures have been made if it decides\r\n       that such a use is warranted.\r\n\r\n   (c) In order for a working group and the rest of the IETF to have the\r\n       information needed to make an informed decision about the use of\r\n       a particular technology, all those contributing to the working\r\n       group's discussions must disclose the existence of any IPR the\r\n       Contributor or any other IETF Participant believes Covers or may\r\n       ultimately Cover the technology under discussion.  This applies\r\n       to both Contributors and other Participants, and applies whether\r\n       they contribute in person, via email, or by other means.  The\r\n       requirement applies to all IPR of the Participant, the\r\n       Participant's employer, sponsor, or others represented by the\r\n       Participant that are reasonably and personally known to the\r\n       Participant.  No patent search is required.\r\n\r\n   Section 1 defines the terms used in this document.  Sections 3\r\n   through 11 set forth the IETF's policies and procedures relating to\r\n   IPR.  Section 13 lists the changes between this document and RFCs\r\n   3979 and 4879.  A separate document [RFC5378] deals with rights (such\r\n   as copyrights and trademarks) in Contributions, including the right\r\n   of the IETF and IETF Participants to publish and create derivative\r\n   works of those Contributions.  This document is not intended to\r\n   address those issues.  See RFC 6702 [RFC6702] for a discussion of\r\n   \"Promoting Compliance with Intellectual Property Rights (IPR)\r\n   Disclosure Rules\".\r\n\r\n   This document is not intended as legal advice.  Readers are advised\r\n   to consult their own legal advisors if they would like a legal\r\n   interpretation of their rights or the rights of the IETF in any\r\n   Contributions they make.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 7]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n3.  Participation in the IETF\r\n\r\n3.1.  General Policy\r\n\r\n   In all matters relating to Intellectual Property Rights, the intent\r\n   is to benefit the Internet community and the public at large, while\r\n   respecting the legitimate rights of others.  The disclosures required\r\n   by this policy are intended to help IETF working groups define\r\n   superior technical solutions with the benefit of as much information\r\n   as reasonably possible about potential IPR claims relating to\r\n   technologies under consideration.\r\n\r\n3.2.  Rights and Permissions in Contributions\r\n\r\n   By submission of a Contribution, each person actually submitting the\r\n   Contribution, and each named co-Contributor, is deemed to agree to\r\n   the following terms and conditions on his or her own behalf and on\r\n   behalf of the organizations the Contributor represents or is\r\n   sponsored by (if any) when submitting the Contribution.\r\n\r\n3.3.  Obligations on Participants\r\n\r\n   By Participating in the IETF, each Participant is deemed to agree to\r\n   comply with all requirements of this RFC that relate to Participation\r\n   in IETF activities.  Without limiting the foregoing, each Participant\r\n   that is a Contributor makes the following representations to the\r\n   IETF:\r\n\r\n   A. Such Contributor represents that he or she has made or will\r\n      promptly make all disclosures required by Section 5.1.1 of this\r\n      document.\r\n\r\n   B. Such Contributor represents that there are no limits to the\r\n      Contributor's ability to make the grants, acknowledgments, and\r\n      agreements herein that are reasonably and personally known to the\r\n      Contributor.\r\n\r\n4.  Actions for Documents for Which IPR Disclosure(s) Have Been Received\r\n\r\n   A. The IESG, IAB, ISOC, and IETF Trust disclaim any responsibility\r\n      for identifying the existence of or for evaluating the\r\n      applicability of any IPR, disclosed or otherwise, to any IETF\r\n      technology, specification, or standard, and will take no position\r\n      on the validity or scope of any such IPR.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 8]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   B. When the IETF Secretariat has received a notification under\r\n      Section 5.1.3 of the existence of non-participant IPR that\r\n      potentially Covers a technology under discussion at IETF or which\r\n      is the subject of an IETF Document, the IETF Secretariat shall\r\n      promptly publish such notification and will request that the\r\n      identified third party make an IPR disclosure in accordance with\r\n      the provisions of Section 5.\r\n\r\n   C. When an IPR disclosure has been made as provided in Section 5 of\r\n      this document, the IETF Secretariat may request from the purported\r\n      holder of such IPR a written assurance that upon approval by the\r\n      IESG for publication of the relevant IETF specification(s) as one\r\n      or more RFCs, all persons will be able to obtain the right to\r\n      implement, use, distribute, and exercise other rights with respect\r\n      to Implementing Technology under one of the licensing options\r\n      specified in Section 5.5.A below unless a statement identifying\r\n      one of the licensing options described in Section 5.5.A has\r\n      already been received by the IETF Secretariat.  The working group\r\n      proposing the use of the technology with respect to which the\r\n      Intellectual Property Rights are disclosed may assist the IETF\r\n      Secretariat in this effort.\r\n\r\n      The results of this procedure shall not, in themselves, block\r\n      publication of an IETF Document or advancement of an IETF Document\r\n      along the Standards Track.  A working group may take into\r\n      consideration the results of this procedure in evaluating the\r\n      technology, and the IESG may defer approval when a delay may\r\n      facilitate obtaining such assurances.  The results will, however,\r\n      be recorded by the IETF Secretariat and be made available online.\r\n\r\n   D. The IESG will not make any determination that any terms for the\r\n      use of an Implementing Technology (e.g., the assurance of\r\n      reasonable and non-discriminatory terms) have been fulfilled in\r\n      practice.  It will instead apply the normal requirements for the\r\n      advancement of Internet Standards (see RFC 6410).  If the two\r\n      unrelated implementations of the specification that are required\r\n      to advance from Proposed Standard to Internet Standard have been\r\n      produced by different organizations or individuals, or if the\r\n      \"significant implementation and successful operational experience\"\r\n      required to advance from Proposed Standard to Internet Standard\r\n      has been achieved, the IESG will presume that the terms are\r\n      reasonable and to some degree non-discriminatory.  Note that this\r\n      also applies to the case where multiple implementers have\r\n      concluded that no licensing is required.\r\n\r\n      This presumption may be challenged at any time, including during\r\n      the Last Call period by sending email to the IESG.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                 [Page 9]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n5.  IPR Disclosures\r\n\r\n   This document refers to the IETF Participant making disclosures,\r\n   consistent with the general IETF philosophy that Participants in the\r\n   IETF act as individuals.  A Participant's obligation to make a\r\n   disclosure is also considered satisfied if the IPR owner, which may\r\n   be the Participant's employer or sponsor, makes an appropriate\r\n   disclosure in place of the Participant doing so.\r\n\r\n5.1.  Who Must Make an IPR Disclosure?\r\n\r\n5.1.1.  A Contributor's IPR in His or Her Contribution\r\n\r\n   Any Contributor who reasonably and personally knows of IPR meeting\r\n   the conditions of Section 5.6 which the Contributor believes Covers\r\n   or may ultimately Cover his or her written Contribution that is\r\n   intended to be used as an input into the IETF Standards Process, or\r\n   which the Contributor reasonably and personally knows his or her\r\n   employer or sponsor may assert against Implementing Technologies\r\n   based on such written Contribution, must make a disclosure in\r\n   accordance with Section 5.\r\n\r\n5.1.2.  An IETF Participant's IPR in Contributions by Others\r\n\r\n   If an individual's Participation relates to a written Contribution\r\n   made by somebody else that is intended to be used as an input into\r\n   the IETF Standards Process, and such Participant reasonably and\r\n   personally knows of IPR meeting the conditions of Section 5.6 which\r\n   the Participant believes Covers or may ultimately Cover that\r\n   Contribution, or which the Participant reasonably and personally\r\n   knows his or her employer or sponsor may assert against Implementing\r\n   Technologies based on such written Contribution, then such\r\n   Participant must make a disclosure in accordance with Section 5.\r\n\r\n5.1.3.  Voluntary IPR Disclosures\r\n\r\n   If any person has information about IPR that may Cover a technology\r\n   relevant to the IETF Standards Process, but such person is not\r\n   required to disclose such IPR under Sections 5.1.1 or 5.1.2 above,\r\n   such person is nevertheless encouraged to file an IPR disclosure as\r\n   described in Section 5.3 below.  Such an IPR disclosure should be\r\n   filed as soon as reasonably possible after the person realizes that\r\n   such IPR may Cover a Contribution.  Situations in which such\r\n   voluntary IPR disclosures may be made include when (a) IPR does not\r\n   meet the criteria in Section 5.6 because it is not owned or\r\n   controlled by an IETF Participant or his or her sponsor or employer\r\n   (referred to as third party IPR), (b) an individual is not required\r\n   to disclose IPR meeting the requirements of Section 5.6 because that\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 10]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   individual is not Participating in the relevant IETF activity, or (c)\r\n   the IPR Covers technology that does not yet meet the criteria for a\r\n   Contribution hereunder (e.g., it is disclosed in an informal or other\r\n   non-IETF setting).\r\n\r\n5.2.  The Timing of Disclosure\r\n\r\n   Timely IPR disclosure is important because working groups need to\r\n   have as much information as they can while they are evaluating\r\n   alternative solutions.\r\n\r\n5.2.1.  Timing of Disclosure under Section 5.1.1\r\n\r\n   A. The IPR disclosure required pursuant to Section 5.1.1 must be made\r\n      as soon as reasonably possible after the Contribution is submitted\r\n      or made unless the required disclosure is already on file.  See\r\n      Section 5.4.2 for a discussion of when updates need to be made for\r\n      an existing disclosure.\r\n\r\n   B. If a Contributor first learns of IPR in its Contribution that\r\n      meets the conditions of Section 5.6, for example a new patent\r\n      application or the discovery of a relevant patent in a patent\r\n      portfolio, after the Contribution is published in an Internet-\r\n      Draft, a disclosure must be made as soon as reasonably possible\r\n      after the IPR becomes reasonably and personally known to the\r\n      Contributor.\r\n\r\n5.2.2.  Timing of Disclosure under Section 5.1.2\r\n\r\n   The IPR disclosure required pursuant to Section 5.1.2 must be made as\r\n   soon as reasonably possible after the Contribution is made, unless\r\n   the required disclosure is already on file.\r\n\r\n   Participants who realize that IPR meeting the conditions of Section\r\n   5.6 may Cover technology that will be or has been incorporated into a\r\n   Contribution, or is seriously being discussed in a working group, are\r\n   strongly encouraged to make a preliminary IPR disclosure.  That IPR\r\n   disclosure should be made as soon after coming to the realization as\r\n   reasonably possible, not waiting until the Contribution is actually\r\n   made.\r\n\r\n   If an IETF Participant first learns of IPR that meets the conditions\r\n   of Section 5.6 that may Cover a Contribution by another party, for\r\n   example a new patent application or the discovery of a relevant\r\n   patent in a patent portfolio, after the Contribution is made, an IPR\r\n   disclosure must be made as soon as reasonably possible after the\r\n   Contribution or IPR becomes reasonably and personally known to the\r\n   Participant.\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 11]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n5.2.3.  Timing of Disclosure by ADs and Others\r\n\r\n   By the nature of their office, IETF Area Directors or persons\r\n   assisting them may become aware of Contributions late in the process\r\n   (for example at IETF Last Call or during IESG review) and, therefore\r\n   in such cases, cannot reasonably be expected to disclose IPR Covering\r\n   those Contributions until they become aware of them.\r\n\r\n5.3.  How Must an IPR Disclosure be Made?\r\n\r\n   IPR disclosures must be made by following the instructions at\r\n   <https://www.ietf.org/ipr-instructions>.  IPR disclosures and other\r\n   IPR-related information, including licensing information, must not be\r\n   included in RFCs or other IETF Contributions.  The RFC Editor will\r\n   remove any IPR-related information from Contributions prior to\r\n   publication as an RFC.\r\n\r\n5.4.  What Must Be in an IPR Disclosure?\r\n\r\n5.4.1.  Content of IPR Disclosures\r\n\r\n   An IPR disclosure must include the following information to the\r\n   extent reasonably available to the discloser: (a) the numbers of any\r\n   issued patents or published patent applications (or indicate that the\r\n   disclosure is based on unpublished patent applications), (b) the\r\n   name(s) of the inventor(s) (with respect to issued patents and\r\n   published patent applications), (c) the specific IETF Document(s) or\r\n   activity affected, and (d) if the IETF Document is an Internet-Draft,\r\n   its specific version number.  In addition, if it is not reasonably\r\n   apparent which part of an IETF Document is allegedly Covered by\r\n   disclosed IPR, then it is helpful if the discloser identifies the\r\n   sections of the IETF Document that are allegedly Covered by such\r\n   disclosed IPR.\r\n\r\n5.4.2.  Updating IPR Disclosures\r\n\r\n   Those who disclose IPR should be aware that as Internet-Drafts\r\n   evolve, text may be added or removed, and it is recommended that they\r\n   keep this in mind when composing text for disclosures.\r\n\r\n   A. Unless sufficient information to identify the issued patent was\r\n      disclosed when the patent application was disclosed, an IPR\r\n      disclosure must be updated or a new disclosure made promptly after\r\n      any of the following has occurred: (1) the publication of a\r\n      previously unpublished patent application, (2) the abandonment of\r\n      a patent application, (3) the issuance of a patent on a previously\r\n      disclosed patent application, or (4) a material change to the IETF\r\n      Document covered by the Disclosure that causes the Disclosure to\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 12]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      be covered by additional IPR.  If the patent application was\r\n      abandoned, then the new IPR disclosure must explicitly withdraw\r\n      any earlier IPR disclosures based on the application.  IPR\r\n      disclosures against a particular Contribution are assumed to be\r\n      inherited by revisions of the Contribution and by any RFCs that\r\n      are published from the Contribution unless the disclosure has been\r\n      updated or withdrawn.\r\n\r\n   B. If an IPR holder files patent applications in additional countries\r\n      which refer to, and the claims of which are substantially\r\n      identical to, the claims of a patent or patent application\r\n      previously disclosed in an IPR disclosure, the IPR holder is not\r\n      required to make a new or updated IPR disclosure as a result of\r\n      filing such applications or the issuance of patents on such\r\n      applications.\r\n\r\n   C. New or revised IPR disclosures may be made voluntarily at any\r\n      other time, provided that licensing information may only be\r\n      updated in accordance with Section 5.5.C.\r\n\r\n   D. Any person may submit an update to an existing IPR disclosure.  If\r\n      such update is submitted by a person other than the submitter of\r\n      the original IPR disclosure (as identified by name and email\r\n      address), then the IETF Secretariat shall attempt to contact the\r\n      original submitter to verify the update.  If the original\r\n      submitter responds that the proposed update is valid, the\r\n      Secretariat will update the IPR disclosure accordingly.  If the\r\n      original submitter responds that the proposed update is not valid,\r\n      the IETF Secretariat will not update the IPR disclosure.  If the\r\n      original submitter fails to respond after the IETF Secretariat has\r\n      made three separate inquiries and at least 30 days have elapsed\r\n      since the initial inquiry was made, then the IETF Secretariat will\r\n      inform the submitter of the proposed update that the update was\r\n      not validated and that the updater must produce legally sufficient\r\n      evidence that the submitter (or his/her employer) owns or has the\r\n      legal right to exercise control over the IPR subject to the IPR\r\n      disclosure.  If such evidence is satisfactory to the IETF\r\n      Secretariat, after consultation with the IETF legal counsel, then\r\n      the IETF Secretariat will make the requested update.  If such\r\n      evidence is not satisfactory, then the IETF Secretariat will not\r\n      make the requested update.\r\n\r\n5.4.3.  Blanket IPR Statements\r\n\r\n   The requirement to make an IPR disclosure is not satisfied by the\r\n   submission of a blanket statement that IPR may exist on every\r\n   Contribution or a general category of Contributions.  This is the\r\n   case because the aim of the disclosure requirement is to provide\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 13]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   information about specific IPR against specific technology under\r\n   discussion in the IETF.  The requirement is also not satisfied by a\r\n   blanket statement of willingness or commitment to license all\r\n   potential IPR Covering such technology under fair, reasonable, and\r\n   non-discriminatory terms for the same reason.  However, the\r\n   requirement for an IPR disclosure is satisfied by a blanket statement\r\n   of the IPR discloser's commitment to license all of its IPR meeting\r\n   the requirements of Section 5.6 (and either Section 5.1.1 or 5.1.2)\r\n   to implementers of an IETF specification on a royalty-free (and\r\n   otherwise reasonable and non-discriminatory) basis as long as any\r\n   other terms and conditions are disclosed in the IPR disclosure.\r\n\r\n5.5.  Licensing Information in an IPR Disclosure\r\n\r\n   A. Since IPR disclosures will be used by IETF working groups during\r\n      their evaluation of alternative technical solutions, it is helpful\r\n      if an IPR disclosure includes information about licensing of the\r\n      IPR in case Implementing Technologies require a license.\r\n      Specifically, it is helpful to indicate whether, upon approval by\r\n      the IESG for publication as an RFC of the relevant IETF\r\n      specification(s), all persons will be able to obtain the right to\r\n      implement, use, distribute, and exercise other rights with respect\r\n      to an Implementing Technology a) under a royalty-free and\r\n      otherwise reasonable and non-discriminatory license, or b) under a\r\n      license that contains reasonable and non-discriminatory terms and\r\n      conditions, including a reasonable royalty or other payment, or c)\r\n      without the need to obtain a license from the IPR holder (e.g., a\r\n      covenant not to sue with or without defensive suspension, as\r\n      described in Section 7).\r\n\r\n   B. The inclusion of a licensing declaration is not mandatory, but it\r\n      is encouraged so that the working groups will have as much\r\n      information as they can during their deliberations.  If the\r\n      inclusion of a licensing declaration in an IPR disclosure would\r\n      significantly delay its submission, then the discloser may submit\r\n      an IPR disclosure without a licensing declaration and then submit\r\n      a new IPR disclosure when the licensing declaration becomes\r\n      available.  IPR disclosures that voluntarily provide text that\r\n      includes licensing information, comments, notes, or URLs for other\r\n      information may also voluntarily include details regarding\r\n      specific licensing terms that the IPR holder intends to offer to\r\n      implementers of Implementing Technologies, including maximum\r\n      royalties.\r\n\r\n   C. It is likely that IETF will rely on licensing declarations and\r\n      other information that may be contained in an IPR disclosure and\r\n      that implementers will make technical, legal, and commercial\r\n      decisions on the basis of such commitments and information.  Thus,\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 14]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      when licensing declarations and other information, comments,\r\n      notes, or URLs for further information are contained in an IPR\r\n      disclosure, the persons making such disclosure agree and\r\n      acknowledge that the commitments and information contained in such\r\n      disclosure shall be irrevocable and will attach, to the extent\r\n      permissible by law, to the associated IPR, and all implementers of\r\n      Implementing Technologies will be justified and entitled to rely\r\n      on such materials in relating to such IPR, whether or not such IPR\r\n      is subsequently transferred to a third party by the IPR holder\r\n      making the commitment or providing the information.  IPR holders\r\n      making IPR disclosures that contain licensing declarations or\r\n      providing such information, comments, notes, or URLs for further\r\n      information must ensure that such commitments are binding on any\r\n      transferee of the relevant IPR, and that such transferee will use\r\n      reasonable efforts to ensure that such commitments are binding on\r\n      a subsequent transferee of the relevant IPR, and so on.\r\n\r\n   D. Licensing declarations must be made by people who are authorized\r\n      to make such declarations as discussed in Section 5.6 of this\r\n      document.\r\n\r\n5.6.  Level of Control over IPR Requiring Disclosure\r\n\r\n   IPR disclosures under Sections 5.1.1 and 5.1.2 are required with\r\n   respect to IPR (a) that is owned, directly or indirectly, by the\r\n   individual Contributor or his/her employer or sponsor (if any), or\r\n   (b) that such persons otherwise have the right to license or assert,\r\n   or (c) from which such persons derive a direct or indirect pecuniary\r\n   benefit, or (d) as to which an individual Contributor is listed as an\r\n   inventor on the relevant patent or patent application.\r\n\r\n5.7.  Disclosures for Oral Contributions\r\n\r\n   If a Contribution is oral and is not followed promptly by a written\r\n   disclosure of the same material, and if such oral Contribution would\r\n   be subject to a requirement that an IPR Disclosure be made (had such\r\n   oral Contribution been written), then the Contributor must accompany\r\n   such oral Contribution with an oral declaration that he/she is aware\r\n   of relevant IPR in as much detail as reasonably possible or file an\r\n   IPR Declaration with respect to such oral Contribution that otherwise\r\n   complies with the provisions of Sections 5.1 to 5.6 above.\r\n\r\n5.8.  General Disclosures\r\n\r\n   As described in Section 5.3, the IETF will make available a public\r\n   facility (e.g., a web page and associated database) for the posting\r\n   of IPR disclosures conforming with the disclosure requirements of\r\n   this policy.  In addition, the IETF may make available a public\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 15]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   facility for the posting of other IPR-related information and\r\n   disclosures that do not satisfy the requirements of this policy but\r\n   which may otherwise be informative and relevant to the IETF (\"General\r\n   Disclosures\").  Such General Disclosures may include, among other\r\n   things, \"blanket disclosures\" that do not contain a royalty-free\r\n   licensing commitment as described in Section 5.4.3, disclosures of\r\n   IPR that do not identify the specific IETF Documents Covered by the\r\n   disclosed IPR, and licensing statements or commitments that are\r\n   applicable generally and not to specific IPR disclosures.  All of\r\n   this information may be helpful to the IETF community, and its\r\n   disclosure is encouraged.  However, General Disclosures do not\r\n   satisfy an IETF Participant's obligation to make IPR disclosures as\r\n   required by this policy.\r\n\r\n   In some cases, if an IPR disclosure submitted by an IETF Participant\r\n   does not meet the requirements of this policy, the IETF may elect to\r\n   post the non-conforming IPR disclosure as a General Disclosure in\r\n   order to provide the greatest amount of information to the IETF\r\n   community.  This action does not excuse the IETF Participant from\r\n   submitting a new IPR disclosure that conforms with the requirements\r\n   of Sections 5.1 to 5.6.  The IETF reserves the right to decline to\r\n   publish General Disclosures that are not relevant to IETF activities,\r\n   that are, or are suspected of being, defamatory, false, misleading,\r\n   in violation of privacy or other applicable laws or regulations, or\r\n   that are in a format that is not suitable for posting on the IETF\r\n   facility that has been designated for General Disclosures.\r\n\r\n6.  Failure to Disclose\r\n\r\n   There may be cases in which individuals are not permitted by their\r\n   employers or by other factors to disclose the existence or substance\r\n   of patent applications or other IPR.  Since disclosure is required\r\n   for anyone making a Contribution or Participating in IETF activities,\r\n   a person who is not willing or able to disclose IPR for this reason,\r\n   or any other reason, must not contribute to or participate in IETF\r\n   activities with respect to technologies that he or she reasonably and\r\n   personally knows may be Covered by IPR which he or she will not\r\n   disclose, unless that person knows that his or her employer or\r\n   sponsor will make the required disclosures on his or her behalf.\r\n\r\n   Contributing to or Participating in IETF activities about a\r\n   technology without making required IPR disclosures is a violation of\r\n   IETF policy.\r\n\r\n   In addition to any remedies or defenses that may be available to\r\n   implementers and others under the law with respect to such a\r\n   violation (e.g., rendering the relevant IPR unenforceable), sanctions\r\n   are available through the normal IETF processes for handling\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 16]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   disruptions to IETF work.  See [RFC6701] for details regarding the\r\n   sanctions defined in various existing Best Current Practice\r\n   documents.\r\n\r\n7.  Evaluating Alternative Technologies in IETF Working Groups\r\n\r\n   In general, IETF working groups prefer technologies with no known IPR\r\n   claims or, for technologies with claims against them, an offer of\r\n   royalty-free licensing.  However, to solve a given technical problem,\r\n   IETF working groups have the discretion to adopt a technology as to\r\n   which IPR claims have been made if they feel that this technology is\r\n   superior enough to alternatives with fewer IPR claims or free\r\n   licensing to outweigh the potential cost of the licenses.  To assist\r\n   these working groups, it is helpful for the IPR claimants to declare,\r\n   in their IPR Declarations, the terms, if any, on which they are\r\n   willing to license their IPR Covering the relevant IETF Documents.\r\n\r\n   A. When adopting new technologies, the participants in an IETF\r\n      working group are expected to evaluate all the relevant tradeoffs\r\n      from their perspective.  Most of the time these considerations are\r\n      based purely on technical excellence, but IPR considerations may\r\n      also affect the evaluation and specific licensing terms may affect\r\n      the participants' opinion on the desirability of adopting a\r\n      particular technology.\r\n\r\n   B. The IETF has no official preference among different licensing\r\n      terms beyond what was stated at the beginning of this section.\r\n      However, for information and to assist participants in\r\n      understanding what license conditions may imply, what follows are\r\n      some general observations about some common types of conditions.\r\n      The following paragraphs are provided for information only:\r\n\r\n   C. When there is no commitment to license patents covering the\r\n      technology, this creates uncertainty that obviously is concerning.\r\n      These concerns do not exist when there is a commitment to license,\r\n      but the license terms can still differ greatly.  Some common\r\n      conditions include 1) terms that are fair, reasonable, and non-\r\n      discriminatory, and which may bear royalties or other financial\r\n      obligations (FRAND or RAND); 2) royalty-free terms that are\r\n      otherwise fair, reasonable, and non-discriminatory (RAND-z); and\r\n      3) commitments not to assert declared IPR, possibly conditional on\r\n      reciprocity.  Open source projects, for instance, often prefer the\r\n      latter two.  Note that licenses often come with complex terms that\r\n      have to be evaluated in detail, and this crude classification may\r\n      not be sufficient to make a proper evaluation.  For instance,\r\n      licenses may also include reciprocity and defensive suspension\r\n      requirements that require careful evaluation.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 17]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   D. The level of use of a technology against which IPR is disclosed is\r\n      also an important factor in weighing IPR encumbrances and\r\n      associated licensing conditions against technical merits.  For\r\n      example, if technologies are being considered for a mandatory-to-\r\n      implement change to a widely deployed protocol, the hurdle should\r\n      be very high for encumbered technologies, whereas a similar hurdle\r\n      for a new protocol could conceivably be lower.\r\n\r\n   E. IETF working groups and IETF areas may, however, adopt stricter\r\n      requirements in specific cases.  For instance, the IETF Security\r\n      Area has adopted stricter requirements for some security\r\n      technologies.  It has become common to have a mandatory-to-\r\n      implement security technology in IETF technology specifications.\r\n      This is to ensure that there will be at least one common security\r\n      technology present in all implementations of such a specification\r\n      that can be used in all cases.  This does not limit the\r\n      specification from including other security technologies, the use\r\n      of which could be negotiated between implementations.  An IETF\r\n      consensus has developed that no mandatory-to-implement security\r\n      technology can be specified in an IETF specification unless it has\r\n      no known IPR claims against it or a royalty-free license is\r\n      available to implementers of the specification.  It is possible to\r\n      specify such a technology in violation of this principle if there\r\n      is a very good reason to do so and if that reason is documented\r\n      and agreed to through IETF consensus.  This limitation does not\r\n      extend to other security technologies in the same specification if\r\n      they are not listed as mandatory to implement.\r\n\r\n   F. It should also be noted that the absence of IPR disclosures at any\r\n      given time is not the same thing as the knowledge that there will\r\n      be no IPR disclosure in the future, or that no IPR Covers the\r\n      relevant technology.  People or organizations not currently\r\n      involved in the IETF or people or organizations that discover IPR\r\n      they feel to be relevant in their patent portfolios can make IPR\r\n      disclosures at any time.\r\n\r\n   G. It should be noted that the validity and enforceability of any IPR\r\n      may be challenged for legitimate reasons outside the IETF.  The\r\n      mere existence of an IPR disclosure should not be taken to mean\r\n      that the disclosed IPR is valid or enforceable or actually Covers\r\n      a particular Contribution.  Although the IETF can make no actual\r\n      determination of validity, enforceability, or applicability of any\r\n      particular IPR, it is reasonable that individuals in a working\r\n      group or the IESG will take into account their own views of the\r\n      validity, enforceability, or applicability of IPR in their\r\n      evaluation of alternative technologies.\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 18]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n8.  Change Control for Technologies\r\n\r\n   The IETF must have change control over the technology described in\r\n   any Standards Track IETF Documents in order to fix problems that may\r\n   be discovered or to produce other derivative works.\r\n\r\n   In some cases, the developer of patented or otherwise controlled\r\n   technology may decide to hand over to the IETF the right to evolve\r\n   the technology (a.k.a., \"change control\").  The implementation of an\r\n   agreement between the IETF and the developer of the technology can be\r\n   complex.  (See [RFC1790] and [RFC2339] for examples.)\r\n\r\n   Note that there is no inherent prohibition against a Standards Track\r\n   IETF Document making a normative reference to proprietary technology.\r\n   For example, a number of IETF standards support proprietary\r\n   cryptographic transforms.\r\n\r\n9.  Licensing Requirements to Advance Standards Track IETF Documents\r\n\r\n   Section 2.2 of RFC 6410 [RFC6410] states:\r\n\r\n      If the technology required to implement the specification requires\r\n      patented or otherwise controlled technology, then the set of\r\n      implementations must demonstrate at least two independent,\r\n      separate and successful uses of the licensing process.\r\n\r\n   A key word in this text is \"requires\".  The mere existence of\r\n   disclosed IPR does not necessarily mean that licenses are actually\r\n   required in order to implement the technology.\r\n\r\n10.  No IPR Disclosures in IETF Documents\r\n\r\n   IETF Documents must not contain any mention of specific IPR.  All\r\n   specific IPR disclosures must be submitted as described in Section 5.\r\n   Readers should always refer to the online web page\r\n   <https://www.ietf.org/ipr/> to get a full list of IPR disclosures\r\n   received by the IETF concerning any Contribution.\r\n\r\n11.  Application to Non-IETF Stream Documents\r\n\r\n   This document has been developed for the benefit and use of the IETF\r\n   community.  As such, the rules set forth herein apply to all\r\n   Contributions and IETF Documents that are in the \"IETF Document\r\n   Stream\" as defined in Section 5.1.1 of [RFC4844] (i.e., those that\r\n   are contributed, developed, edited, and published as part of the IETF\r\n   Standards Process).\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 19]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   The rules that apply to documents in Alternate Streams are\r\n   established by the managers of those Alternate Streams (currently the\r\n   Internet Architecture Board (IAB), Internet Research Steering Group\r\n   (IRSG), and Independent Submission Editor, as specified in\r\n   [RFC4844]).  These managers may elect, through their own internal\r\n   processes, to cause this document to be applied to documents\r\n   contributed to them for development, editing, and publication in\r\n   their respective Alternate Streams.  If an Alternate Stream manager\r\n   elects to adopt this document, they must do so in a manner that is\r\n   public and notifies their respective document Contributors that this\r\n   document applies to their respective Alternate Streams.  In such\r\n   case, each occurrence of the term \"Contribution\" and \"IETF Document\"\r\n   in this document shall be read to mean a contribution or document in\r\n   such Alternate Stream, as the case may be.  It would be advisable for\r\n   such Alternate Stream managers to consider adapting the definitions\r\n   of \"Contribution\" and other provisions in this document to suit their\r\n   particular needs.\r\n\r\n12.  Security Considerations\r\n\r\n   This document relates to the IETF process, not any particular\r\n   technology.  There are security considerations when adopting any\r\n   technology, whether IPR protected or not.  A working group should\r\n   take those security considerations into account as one part of\r\n   evaluating the technology, just as IPR is one part, but there are no\r\n   known issues of security with IPR procedures.\r\n\r\n13.  Changes since RFCs 3979 and 4879\r\n\r\n   The material in RFC 3979 was significantly reorganized to produce\r\n   this document.  This section reviews the actual changes in content\r\n   since RFC 3979 and does not detail the reorganization.  These changes\r\n   are listed from the point of view of this document with reference to\r\n   the RFC 3979 section where useful.  This section is intended only as\r\n   an informational summary of the text contained in Sections 1-12 of\r\n   this document.  This section does not constitute the official policy\r\n   of the IETF and should not be referred to or quoted as such.  Any\r\n   discrepancies or ambiguities shall be resolved in favor of the\r\n   language contained in Sections 1-12 of this document.\r\n\r\n   Boilerplate - Since the document boilerplate formerly in Section 5 of\r\n      RFC 3979 has been moved to the Trust Legal Provisions since 2009,\r\n      the boilerplate requirements have been deleted from this document.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 20]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   1 - Definitions\r\n\r\n      1.a - \"Alternate Stream\" definition (new): Added to enable IRTF,\r\n         IAB, and Independent Submission streams to adopt and use BCP 79\r\n         more easily.\r\n\r\n      1.c - \"Contribution\" (was 1.c)\r\n\r\n            Removed \"IETF\" to more easily enable other Streams to adopt\r\n            this policy.\r\n\r\n            Added \"intended to affect the IETF Standards Process\", which\r\n            is needed to prevent information presentations (e.g.,\r\n            plenary guest speakers) from being considered Contributions.\r\n\r\n            Added BOF, design team, web site, and chat room.\r\n            Contributions can be made in any of these places.\r\n\r\n      1.e - \"Covers\" (was 1.n) - Added \"provisional patent application\"\r\n         - Required to eliminate ambiguity whether provisional\r\n         applications are included.\r\n\r\n      1.h - \"IETF Documents\" (was 1.h) - Limited to IETF (not Alternate\r\n         Stream) documents.\r\n\r\n      1.i - \"IETF Standards Process\" (was 1.b) - Clarify that\r\n         Contributions can be made in contexts other than traditional\r\n         IETF standards development.\r\n\r\n      1.j - \"IPR\" (was 1.o) - Removed reference to copyrights, database\r\n         rights, and data rights.  Copyright in IETF Documents and\r\n         contributions is addressed under RFC 5378 and is treated very\r\n         differently than patents, which are the focus of BCP 79.\r\n         Data/database rights not relevant to IETF standards, and cannot\r\n         be registered or disclosed in the manner of patents.\r\n\r\n      1.l - \"Internet-Draft\" (was 1.g) - Reduced to reference RFC 2026\r\n         without additional description for clarity.\r\n\r\n      1.m - \"Participating in an IETF discussion or activity\" (new) -\r\n         Due to numerous ambiguities over the years, it was necessary to\r\n         add a section describing what it means to \"participate\" in an\r\n         IETF activity.\r\n\r\n      1.o - \"RFC\" (was 1.e) - Added cross-reference to RFC 2026 and\r\n         eliminated textual description of RFC permanence.\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 21]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   2 - Introduction - Added text that offers an overview of why we have\r\n      this policy, cut prior discussion of Section 10 of RFC 2026 as no\r\n      longer necessary, and added references to subsequent RFCs relating\r\n      to IPR, including RFC 5378 and 6702.\r\n\r\n   3 - Participation in the IETF (was \"Contributions to the IETF\") -\r\n      Changed focus to participation rather than making of Contributions\r\n      and explained why we require IPR disclosure.\r\n\r\n   old 3.2.1.C - Deleted because all required legends in IETF Documents\r\n      are now described in RFC 5378 and Trust Legal Provisions.\r\n\r\n   3.3 - Obligations on Participants - Added to make clear that\r\n      participation in IETF obligates the participant to comply with\r\n      IETF rules.\r\n\r\n   old 4.A - Removed because inconsistent with current and historical\r\n      practice.  Also, all legends in IETF Documents are now addressed\r\n      in Trust Legal Provisions.\r\n\r\n   4.A - \"The IESG, IAB...\" - Added IAB, ISOC, and IETF Trust to\r\n      disclaimer.\r\n\r\n   4.B - \"When the IETF Secretariat...\" - Added description of current\r\n      procedure used to publish third party IPR disclosures.\r\n\r\n   4.C - \"When an IPR disclosure...\" - Updated to reflect current\r\n      practice and roles (e.g., Secretariat rather than IETF Exec Dir).\r\n\r\n   4.D - Determination of Provision of Reasonable and Non-discriminatory\r\n      Terms (was Section 4.1) - Various edits made to this paragraph to\r\n      reflect current process for advancement of standards.\r\n\r\n   old 5 - Deleted because it was not needed.\r\n\r\n   5.1.1 - Contributor's IPR in His or Her Contribution (was Section\r\n      6.1.1) - Limits disclosure obligation to written Contributions\r\n      intended to be used as inputs to the IETF Standards Process.  Oral\r\n      disclosures are now covered in Section 5.7.\r\n\r\n   5.1.2 - An IETF Participant's IPR in Contributions by Others (was\r\n      Section 6.1.2) - Revisions made consistent with Section 5.1.1\r\n      above.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 22]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   5.1.3 -  Voluntary IPR Disclosures (was Section 6.1.3) - Fixes\r\n      procedures for making voluntary IPR disclosures and adds examples\r\n      of when voluntary disclosures may be appropriate.  In addition to\r\n      IPR of others, voluntary disclosures are encouraged when an IETF\r\n      Participant is aware of its own IPR that covers IETF work in which\r\n      it is not an active participant and when the technology is\r\n      disclosed in other than an IETF setting.\r\n\r\n   5.2.1 - Timing of Disclosure under Section 5.1.1 (was Section 6.2.1)\r\n      - Trigger for disclosure changed from publication of a\r\n      Contribution in an I-D to \"submitted or made\"; lengthy example\r\n      regarding updates deleted in lieu of cross-reference to Section\r\n      5.4.2 regarding updates.\r\n\r\n   5.2.2 - Timing of Disclosure under Section 5.1.2 (was Section 6.2.2)\r\n      - Corresponding changes made per Section 5.2.1.\r\n\r\n   5.2.3 - Timing of Disclosure by ADs - Added to clarify AD disclosure\r\n      obligations.\r\n\r\n   5.3 - \"IPR disclosures and other...\" - Reflects current practice\r\n      regarding prohibition of including IPR information directly in\r\n      IETF Documents.\r\n\r\n   5.4.1 - Content of IPR Disclosures (was Section 6.4.1) - Added\r\n      requirement to disclose names of inventors - Disclosing the\r\n      name(s) of inventors on a patent will make it more likely that\r\n      IETF Participants will recognize whether the inventor is an IETF\r\n      Participant and what IETF activities that individual participates\r\n      in.  This information is easy for the discloser to provide and\r\n      less convenient for every reader of the IPR disclosure to look up\r\n      in patent office records (if even available).\r\n\r\n   5.4.2 - Updating IPR Disclosures (was Section 6.4.2) - Significant\r\n      revisions and additional detail added regarding updating of IPR\r\n      disclosures upon events such as issuance of patents, amendment of\r\n      claims, employee changing jobs, employer acquires another company,\r\n      etc.\r\n\r\n   5.4.2.D - Clarify that additional IPR disclosures are not needed for\r\n      foreign counterparts.\r\n\r\n   5.4.3 - Blanket IPR Statements (was Section 6.4.3) - wording\r\n      clarifications and changed \"willingness\" to \"commitment\".  A\r\n      blanket IPR disclosure which does not list specific patent numbers\r\n      is not compliant with this policy unless the discloser commits\r\n      (and is not just willing) to license such patents on royalty-free\r\n      and otherwise reasonable terms.\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 23]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n   5.5.C - \"It is likely that IETF will rely ...\" (new paragraph) -\r\n      Makes licensing declarations irrevocable so that they may be\r\n      relied upon in the future by implementers.\r\n\r\n   5.5.D - \"Licensing declarations ...\" (new paragraph) - Requires that\r\n      licensing declarations must be made by people authorized to make\r\n      them.\r\n\r\n   5.6 - Level of Control over IPR Requiring Disclosure (was Section\r\n      6.6) - In addition to ownership of IPR, language added to require\r\n      disclosure when Participants derive a pecuniary benefit from the\r\n      IPR, or the individual is a listed inventor - Clarifications to\r\n      address situations not covered in earlier version.\r\n\r\n   5.7 - Disclosures for Oral Contributions (new): Describes procedure\r\n      for oral Contributions.  Previously, statements regarding oral\r\n      statements were contradictory.  Some places said that disclosures\r\n      must be made for oral statements, but others talk about\r\n      disclosures only being required following publication as an I-D.\r\n      Under new text, oral statements don't trigger the normal IPR\r\n      disclosure obligations, as oral statements are inherently\r\n      imprecise and it's hard to know when they describe something\r\n      covered by the technical terms of a patent claim.  However, if an\r\n      oral contribution is made and it is not followed by a written\r\n      contribution, then the oral discloser must either make a\r\n      concurrent oral IPR disclosure or file a formal written\r\n      disclosure.\r\n\r\n   5.8 - General Disclosures (new) - Describes the IETF's public\r\n      disclosure feature, which allows IPR disclosures to be made by\r\n      anyone, whether or not an IETF Participant.  The feature has been\r\n      up and running for years, and this language describes its current\r\n      implementation.\r\n\r\n   6 - Failure to Disclose (was Section 7) - Technical and clarity\r\n      corrections, as well as new language describing potential remedies\r\n      for failures to disclose IPR in accordance with IETF rules,\r\n      including IESG actions described in RFC 6701.\r\n\r\n   7 - Evaluating Alternative Technologies in IETF Working Groups (was\r\n      Section 8).\r\n\r\n      Paragraph 1 - Minor wording changes for clarity.\r\n\r\n      Paragraphs 2-5 (new) - Relate to the considerations made by IETF\r\n          WGs when evaluating patent and licensing disclosures\r\n         concerning IETF standards.\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 24]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n      Paragraph 6 - security technologies (new) - Makes clear that\r\n         security is only one example of stricter requirements.  Also\r\n         requires that violation of requirements for royalty-free\r\n         licensing in the security area can be made only with IETF\r\n         consensus.\r\n\r\n      Paragraphs 7-8 (were paragraphs 3-4) - Wording changes for\r\n         clarity.\r\n\r\n   9 - Licensing Requirements to Advance Standards Track IETF Documents\r\n      (was Section 10) - Wording updated to reflect RFC 6410.\r\n\r\n   10 - No IPR Disclosures in IETF Documents (was Section 11) - Wording\r\n      simplified to refer to Section 5.\r\n\r\n   11 - Application to Non-IETF Stream Documents (new) - Adds procedures\r\n      to be followed by Alternate Stream (IAB, IRTF, Independent\r\n      Submission) managers to adopt these rules and procedures.\r\n      Borrowed and adapted the copyright language used in the Trust\r\n      Legal Provisions.  Each Alternate Stream (Independent Submission,\r\n      IRTF, and IAB) would need to take some action (preferably issuing\r\n      an RFC) to adopt BCP 79 for its stream.  This was done with\r\n      copyright already, and pretty smoothly.\r\n\r\n14.  References\r\n\r\n14.1.  Normative References\r\n\r\n   [RFC2026] Bradner, S., \"The Internet Standards Process -- Revision\r\n             3\", BCP 9, RFC 2026, DOI 10.17487/RFC2026, October 1996,\r\n             <http://www.rfc-editor.org/info/rfc2026>.\r\n\r\n   [RFC2028] Hovey, R. and S. Bradner, \"The Organizations Involved in\r\n             the IETF Standards Process\", BCP 11, RFC 2028,\r\n             DOI 10.17487/RFC2028, October 1996,\r\n             <http://www.rfc-editor.org/info/rfc2028>.\r\n\r\n   [RFC4844] Daigle, L., Ed., and Internet Architecture Board, \"The RFC\r\n             Series and RFC Editor\", RFC 4844, DOI 10.17487/RFC4844,\r\n             July 2007, <http://www.rfc-editor.org/info/rfc4844>.\r\n\r\n   [RFC6410] Housley, R., Crocker, D., and E. Burger, \"Reducing the\r\n             Standards Track to Two Maturity Levels\", BCP 9, RFC 6410,\r\n             DOI 10.17487/RFC6410, October 2011,\r\n             <http://www.rfc-editor.org/info/rfc6410>.\r\n\r\n\r\n\r\n\r\n\r\n\r\nBradner & Contreras       Best Current Practice                [Page 25]\r\n\f\r\nRFC 8179                  IP in IETF Technology                 May 2017\r\n\r\n\r\n14.2.  Informative References\r\n\r\n   [RFC1790] Cerf, V., \"An Agreement between the Internet Society and\r\n             Sun Microsystems, Inc. in the Matter of ONC RPC and XDR\r\n             Protocols\", RFC 1790, DOI 10.17487/RFC1790, April 1995,\r\n             <http://www.rfc-editor.org/info/rfc1790>.\r\n\r\n   [RFC2339] The Internet Society and Sun Microsystems, \"An Agreement\r\n             Between the Internet Societ",
    "submit_date": "2024-11-02",
    "submitter_name": "Aung Ko",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  }
]
