[
  {
    "errata_id": 6919,
    "doc-id": "RFC8182",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "3.4.2",
    "orig_text": "   o  When a Relying Party encounters a \"withdraw\" element, or a\r\n      \"publish\" element where an object is replaced, in a delta that it\r\n      retrieves from a Repository Server, it MUST verify that the object\r\n      to be withdrawn or replaced was retrieved from this same\r\n      Repository Server before applying the appropriate action.  Failing\r\n      to do so will leave the Relying Party vulnerable to malicious\r\n      Repository Servers instructing it to delete or change arbitrary\r\n      objects.\r\n\r\n",
    "correct_text": "   o  When a Relying Party encounters a \"withdraw\" element, or a\r\n      \"publish\" element where an object is replaced, in a delta that it\r\n      retrieves from a Repository Server, it MUST verify that the object\r\n      to be withdrawn or replaced was retrieved from this same\r\n      Repository Server before applying the appropriate action.  Failing\r\n      to do so will leave the Relying Party vulnerable to malicious\r\n      Repository Servers instructing it to delete or change arbitrary\r\n      objects.\r\n\r\n   o  For a \"publish\" or \"withdraw\" element, the hash MUST be present\r\n      if the publication operation is overwriting an existing object,\r\n      and it MUST NOT be present if this publication operation is writing\r\n      to a new URI where no prior object exists.  Presence of an object\r\n      when no \"hash\" attribute has been specified is an error, as is\r\n      absence of an object or an incorrect hash value when a \"hash\"\r\n      attribute has been specified. In this situation this file MUST be\r\n      rejected.\r\n",
    "notes": "Text taken from RFC8181. For <publish> elements in RRDP deltas, the same process described in RFC8181 applies; \"the hash of a publish MUST match to overwrite the existing file\"\r\n\r\n(This gap in the specification was independently spotted by C.J. around the same time)",
    "submit_date": "2022-04-04",
    "submitter_name": "Ties de Kock",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": null
  }
]
