[
  {
    "errata_id": "7705",
    "doc-id": "RFC8689",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "4.2.1",
    "orig_text": "   4.  Establish a TLS-protected SMTP session with its peer SMTP server\r\n       and authenticate the server's certificate as specified in\r\n       [RFC6125] or [RFC7672], as applicable.  The hostname from the MX\r\n       record lookup (or the domain name in the absence of an MX record\r\n       where an A record is used directly) MUST match the DNS-ID or CN-\r\n       ID of the certificate presented by the server.\r\n",
    "correct_text": "   4.  Establish a TLS-protected SMTP session with its peer SMTP server\r\n       and authenticate the server's certificate as specified in\r\n       [RFC6125] or [RFC7672], as applicable.",
    "notes": "The second sentence tries to explain/summarize the policies found in the RFCs referenced in the first sentence, about PKIX and DANE. But the explanation seems to accidentally sets new requirements that contradict behaviour specified by DANE: With DANE-EE TLSA records, no specific hostname validation must be done, instead verification is done based on (hash of) SPKI/entire certificate. (DANE-TA hostname verification is also a bit more nuanced). Since the requirements are accurately explained in the RFCs referenced in the first sentence, it seems better to completely remove the second sentence.\r\n\r\nI would also like to point out that implementers may want to take care not to treat the situation where all TLSA records are \"unusable\" (as explained in DANE RFCs) as \"authenticated with DANE\", in line with \"[...] or it MUST be verified successfully using DANE [...]\" on line 197.",
    "submit_date": "2023-11-20",
    "submitter_name": "Mechiel Lukkien",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  },
  {
    "errata_id": "8593",
    "doc-id": "RFC8689",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "Abstract",
    "orig_text": "If the REQUIRETLS option or TLS-Required message header field is used \r\nwhen sending a message, it asserts a request on the part of the message \r\nsender to override the default negotiation of TLS, either by requiring \r\nthat TLS be negotiated when the message is relayed or by requesting \r\nthat recipient-side policy mechanisms such as MTA-STS and DNS-Based \r\nAuthentication of Named Entities (DANE) be ignored when relaying a \r\nmessage for which security is unimportant.",
    "correct_text": "If the REQUIRETLS option or TLS-Required message header field is used\r\nwhen sending a message, it indicates the sender's preference for\r\ntransport-level encryption: REQUIRETLS mandates that the message be\r\nrelayed over a TLS-protected session, whereas the TLS-Required header\r\nfield allows the sender to request that recipient-side policy\r\nmechanisms, such as MTA-STS and DNS-based Authentication of Named\r\nEntities (DANE), be temporarily ignored – for example, so as to overcome\r\nconfiguration errors when delivery takes precedence and the\r\nsecurity of the message is unimportant.",
    "notes": "This wording is slightly misleading as the 'TLS-Required: No' header field is intended to ignore recipient-side policies, prioritizing delivery. However, it is not meant for messages \"for which security is unimportant\", but rather for cases like misconfigured recipient servers. The wording could be misinterpreted as allowing insecure delivery for convenience.\r\n\r\nThe corrected text clarifies the distinction between REQUIRETLS and TLS-Required.Emphasizes that TLS-Required is for exceptional cases (not general insecurity).",
    "submit_date": "2025-10-04",
    "submitter_name": "Liam W",
    "verifier_id": "2",
    "verifier_name": null,
    "update_date": "2025-10-06 13:51:25"
  }
]
