[
  {
    "errata_id": 5645,
    "doc-id": "RFC8448",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": 2,
    "orig_text": "   Ephemeral private keys are shown as they are generated in the traces.",
    "correct_text": "   Ephemeral private keys are shown as they are generated in the traces.\r\nNote that X25519 private keys are trimmed in accordance to [RFC 7748]\r\nSection 5, before use. This is done by clearing bit 0 to 2 of the first\r\nbyte and bit 7 of the last byte. And then set bit 6 of the last byte.",
    "notes": "On page 3,5,16,20,29,43,44,55,57, there are ten X25519 ephemeral private\r\nkeys listed. None of these private key value, when used directly in X25519\r\ncalculation, will yield the associated public key listed. These private key\r\nvalues are not the actual values used. Instead up to 5 bits are modified as\r\nrecommended by RFC 7748 section 5. Some implementations may choose NOT to\r\ndo such trimming, and it does not affect the connectivity, as the private\r\nkeys are never sent over the wire and does not affect network behavior.\r\n\r\nNot clarifying how the X25519 private keys were modified before using could\r\ncause serious confusion. I personally struggled for a day before figuring\r\nout this little obscure detail.",
    "submit_date": "2019-02-28",
    "submitter_name": "Anthony Mai",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5720,
    "doc-id": "RFC8448",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Technical",
    "section": "GLOBAL",
    "orig_text": "00 0d 00 20 00 1e 04 03 05 03 06 03 02 03 08 04 08 05\r\n08 06 04 01 05 01 06 01 02 01 04 02 05 02 06 02 02 02 \r\n\r\n",
    "correct_text": "00 0d 00 18 00 16 04 03 05 03 06 03 02 03 08 04 08 05\r\n08 06 04 01 05 01 06 01 02 01",
    "notes": "The traces all show DSA signature schemes in ClientHello messages.  The use of these is prohibited by RFC 8446.  To be compliant, these would be removed.\r\n\r\nNote that this isn't a simple substitution as implied above.  The length fields on all of the messages would also need to be reduced by 8 in addition to making the substitution.  The value of the PSK binders used in the resumption case in Section 4 would need to be recalculated also.",
    "submit_date": "2019-05-05",
    "submitter_name": "Martin Thomson",
    "verifier_id": 159,
    "verifier_name": "Benjamin Kaduk",
    "update_date": "2019-09-10 09:09:03"
  }
]
