[
  {
    "errata_id": 5501,
    "doc-id": "RFC8270",
    "errata_status_code": "Held for Document Update",
    "errata_type_code": "Editorial",
    "section": 3,
    "orig_text": "[RFC4419] specifies a recommended minimum size of 1024 bits for k,\r\n   which is the modulus length of the DH group.  It also suggests that,\r\n   in all cases, the size of the group needs be at least 1024 bits.",
    "correct_text": "[RFC4419] specifies a recommended minimum size of 1024 bits for k,\r\n   which is the modulus length of the DH group.  It also suggests that,\r\n   in all cases, the size of the group needs to be at least 1024 bits.",
    "notes": "Fix a typo (missing \"to\").",
    "submit_date": "2018-09-21",
    "submitter_name": "Eugene Adell",
    "verifier_id": 159,
    "verifier_name": "Benjamin Kaduk",
    "update_date": "2019-09-10 09:09:03"
  },
  {
    "errata_id": 5502,
    "doc-id": "RFC8270",
    "errata_status_code": "Reported",
    "errata_type_code": "Editorial",
    "section": 5,
    "orig_text": "   A malicious client could cause a Denial of Service by intentionally\r\n   making multiple connections that are less than 2048 bits in size.\r\n   Therefore, operating systems SHOULD NOT log DH groups that are less\r\n   than 2048 bits in size, as it would create an additional attack\r\n   surface.",
    "correct_text": "   A malicious client could cause a Denial of Service by intentionally\r\n   making multiple connections that are less than 2048 bits in size.\r\n   Therefore, operating systems without any rate-limited logging \r\n   SHOULD NOT log DH groups that are less than 2048 bits in size, as it\r\n   would create an additional attack surface.",
    "notes": "Instead of ignoring attacks, the administrator wants to know when one is taking place, particularly if it is an intense one which would lead to a denial of service, as suggested by the authors. Thus, using a rate-limited logging mechanism is an appropriate solution to keep records of the attack, and to notify the administrator in real-time then he can take actions if he wants to. As there might not be other ways to inform the administrator of an attack taking place, not logging at all is the last choice.",
    "submit_date": "2018-09-21",
    "submitter_name": "Eugene Adell",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": "2019-09-10 09:09:03"
  }
]
