[
  {
    "errata_id": "7654",
    "doc-id": "RFC8955",
    "errata_status_code": "Verified",
    "errata_type_code": "Technical",
    "section": "4",
    "orig_text": "   This NLRI information is encoded using MP_REACH_NLRI and\r\n   MP_UNREACH_NLRI attributes, as defined in [RFC4760].  When\r\n   advertising Flow Specifications, the Length of the Next-Hop Network\r\n   Address MUST be set to 0.  The Network Address of the Next-Hop field\r\n   MUST be ignored.\r\n",
    "correct_text": "   This NLRI information is encoded using MP_REACH_NLRI and\r\n   MP_UNREACH_NLRI attributes, as defined in [RFC4760].  When\r\n   advertising Flow Specifications, the \"Length of Next Hop Network \r\n   Address\" field MUST be set to 0.  The \"Network Address of Next Hop\" \r\n   field MUST be ignored.",
    "notes": "The fields are named incorrectly in the original text -- they don't match the field names they're referencing in RFC 4760. Most importantly there's no hyphen in the RFC 4760 field definitions, but there are other differences too.",
    "submit_date": "2023-09-22",
    "submitter_name": "John Scudder",
    "verifier_id": "175",
    "verifier_name": "Jim Guichard",
    "update_date": "2024-10-09 08:10:08"
  },
  {
    "errata_id": "8400",
    "doc-id": "RFC8955",
    "errata_status_code": "Rejected",
    "errata_type_code": "Technical",
    "section": "4.2.2, 5.1",
    "orig_text": "4.2.2.1. Type 1 - Destination Prefix\r\n\r\nEncoding: <type (1 octet), length (1 octet), prefix (variable)>\r\nDefines the destination prefix to match. The length and prefix fields\r\nare encoded as in BGP UPDATE messages [RFC4271].\r\n\r\n4.2.2.2. Type 2 - Source Prefix\r\n\r\nEncoding: <type (1 octet), length (1 octet), prefix (variable)>\r\nDefines the source prefix to match. The length and prefix fields are \r\nencoded as in BGP UPDATE messages [RFC4271].\r\n[...]\r\n\r\n5.1. Ordering of Flow Specifications \r\n[...]\r\nFor IP prefix values (IP destination or source prefix), if one of the\r\ntwo prefixes to compare is a more specific prefix of the other, the more\r\nspecific prefix has higher precedence. Otherwise, the one with the\r\nlowest IP value has higher precedence.\r\n",
    "correct_text": "No correction offered, see notes.",
    "notes": "No corrected text is supplied since the resolution of this issue is somewhat ambiguous.\r\nIn RFC 4271 Section 4.3, the definition of a prefix is:\r\n         b) Prefix:\r\n\r\n            The Prefix field contains an IP address prefix, followed by\r\n            the minimum number of trailing bits needed to make the end\r\n            of the field fall on an octet boundary.  Note that the value\r\n            of trailing bits is irrelevant.\r\n\r\nRFC 8955 doesn't quite address the \"trailing bits\" consideration.  Following the advice from RFC 4271, irrelevant would primarily impact ignoring the trailing bits for purposes of installing firewall rules generated from flowspec routes.  For the ordering procedures, comparing two equivalent prefixes that differ in trailing bits should result in them being considered equal.\r\n\r\nImplementations of flowspec that don't ignore trailing bits may treat routes with components that differ only in trailing bits for their source or destination prefixes as different flowspec routes.\r\n\r\nFor updates to RFC 8955, including the upcoming flowspec v2, more normative text to zero out the trailing bits should be considered.\n --VERIFIER NOTES-- \nFollowing is a summary of the discussion thread on IDR WG and my reading of RFC8955:\r\n1) RFC8955 removes the opaqueness aspect of FSv1 components encoded in the NLRI.\r\n2) Drawing upon the prefix encoding of RFC4271, implies that the trailing bits of the prefix beyond what is indicated by the prefix length are ignored. And since there is no opaqueness, there is technically no issue in creating a correct entry in the BGP RIB (and as an extension the firewall rules that are downloaded).\r\n3) If some implementation of RFC8955 has erred on this, then it seems like an implementation issue.\r\n4) Prudent software engineering dictates that the \"to be ignored\" parts are set to zero and putting that into a spec would only improve it. John has captured this well and I am not repeating.\r\n5) In summary, this is not a bug in RFC8955 but there is scope for clarity and improvement in this aspect.\r\n\r\nAfter discussions on the WG mailer, this erratum is rejected and the WG participants may pursue improvements via document actions that have WG consensus.\r\n\r\nFor further details, refer the discussion thread here: https://mailarchive.ietf.org/arch/msg/idr/0BhDnIq-ZrqNu5D8_lAP3R7BvQU/",
    "submit_date": "2025-04-30",
    "submitter_name": "Jeffrey Haas",
    "verifier_id": "185",
    "verifier_name": "Ketan Talaulikar",
    "update_date": "2025-05-08 23:18:34"
  }
]
