[
  {
    "errata_id": 6752,
    "doc-id": "RFC9134",
    "errata_status_code": "Reported",
    "errata_type_code": "Editorial",
    "section": 4.2,
    "orig_text": "As specified in [RFC3550] and [RFC4175], the RTP timestamp\r\ndesignates the sampling instant of the first octet of the video\r\nframe to which the RTP packet belongs.  Packets SHALL NOT include\r\ndata from multiple video frames, and all packets belonging to the\r\nsame video frame SHALL have the same timestamp.  Several\r\nsuccessive RTP packets will consequently have equal timestamps if\r\nthey belong to the same video frame (that is until the marker bit\r\nis set to 1, marking the last packet of the video frame), and the\r\ntimestamp is only increased when a new video frame begins.",
    "correct_text": "As specified in [RFC3550] and [RFC4175], the RTP timestamp\r\ndesignates the sampling instant of the first octet of the video\r\nframe/field to which the RTP packet belongs.  Packets SHALL NOT include\r\ndata from multiple video frames/fields, and all packets belonging to the\r\nsame video frame/field SHALL have the same timestamp.  Several\r\nsuccessive RTP packets will consequently have equal timestamps if\r\nthey belong to the same video frame/field (that is until the marker bit\r\nis set to 1, marking the last packet of the video frame/field), and the\r\ntimestamp is only increased when a new video frame/field begins.",
    "notes": "This RFC follows RFC4175 (and also SMPTE2110) for timestamping RTP packets. The intent has always been to have unique timestamps per progressive video frame and/or per interlaced video field (two fields of a frame MUST be allowed to have different timestamps). This is correctly reflected by the marker bit (M) that is used to indicate the last packet of a frame/field (which is correctly explained in this RFC). However, the accompanied text about the timestamp in section 4.2 does not properly formulate this for the interlaced mode case (it was an editorial oversight), which can cause confusion to implementers of this RFC.",
    "submit_date": "2021-11-24",
    "submitter_name": "Tim Bruylants",
    "verifier_id": 99,
    "verifier_name": null,
    "update_date": null
  }
]
