[
  {
    "errata_id": "7672",
    "doc-id": "RFC9172",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "3.6",
    "orig_text": "Security Context Id:\r\n This field identifies the security context used to implement\r\n the security service represented by this block and applied to\r\n each security target.  This field SHALL be represented by a\r\n CBOR unsigned integer.  The values for this Id should come from\r\n the registry defined in Section 11.3.\r\n",
    "correct_text": "Security Context Id:\r\n This field identifies the security context used to implement\r\n the security service represented by this block and applied to\r\n each security target.  This field SHALL be represented by a\r\n CBOR unsigned or negative integer.  The values for this Id should\r\n come from the registry defined in Section 11.3.\r\n",
    "notes": "Per the IANA sub-registry in Section 11.3 the Context ID has \"The value range: signed 16-bit integer.\" and negative values are reserved for private use, so the value can be either an unsigned or a negative integer.",
    "submit_date": "2023-10-10",
    "submitter_name": "Brian Sipos",
    "verifier_id": "2",
    "verifier_name": "",
    "update_date": "2025-08-11 19:57:19"
  },
  {
    "errata_id": "8312",
    "doc-id": "RFC9172",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "3.6",
    "orig_text": "/none/",
    "correct_text": "Any fields of the ASB, including the Security Source, MAY be treated \r\nas untrusted input for key material lookup in support of processing \r\na security operation as a validator or acceptor.\r\nAny fields of the ASB SHALL NOT be used for making other decisions \r\non a node unless they are covered as additional authenticated data \r\nby an successfully validated or accepted integrity or confidentiality \r\noperation on that node.",
    "notes": "There was no original text restricting how the fields of the ASB can be used by a node. This errata explicitly restricts untrusted inputs in the ASB from influencing node processing, including logic or telemetry based on the Security Source. The default security contexts of RFC 9173 do not yet have the possibility to include the Security Source as additional authenticated data.",
    "submit_date": "2025-02-24",
    "submitter_name": "Brian Sipos",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  },
  {
    "errata_id": "8681",
    "doc-id": "RFC9172",
    "errata_status_code": "Reported",
    "errata_type_code": "Technical",
    "section": "5.1.1",
    "orig_text": "   If an encrypted payload block cannot be decrypted (i.e., the\r\n   ciphertext cannot be authenticated), then the bundle MUST be\r\n   discarded and processed no further.  If an encrypted security target\r\n   other than the payload block cannot be decrypted, then the associated\r\n   security target and all security blocks associated with that target\r\n   MUST be discarded and processed no further.  In both cases, requested\r\n   status reports (see [RFC9171]) MAY be generated to reflect bundle or\r\n   block deletion.",
    "correct_text": "   If an encrypted payload block cannot be decrypted (i.e., the \r\n   ciphertext cannot be authenticated), then the bundle MUST be deleted\r\n   and processed no further. If requested, a deletion status report (see\r\n   [RFC9171]) MAY be generated using the appropriate Bundle Status \r\n   Report Reason Codes (see Section 11.2) to report bundle deletion. If \r\n   an encrypted security target other than the payload block cannot be \r\n   decrypted, then the associated security target and all security \r\n   blocks associated with that target MUST be discarded and processed \r\n   no further.",
    "notes": "There exists no block deletion status report in RFC9171.",
    "submit_date": "2025-12-17",
    "submitter_name": "Lukas Holst",
    "verifier_id": "99",
    "verifier_name": null,
    "update_date": null
  }
]
